{
  "data": [
    "What is an Individualised Second Major? How is it different from the Individualised (First) Major? ",
    "",
    "The Individualised Second Major offers students an opportunity to receive a secondary interdisciplinary major. This second major will consist of 8 CUs, with students having the option of choosing either a professional or research track, just like with the Individualised Major. ",
    "What does the College of Integrative Studies do?",
    "",
    "The College oversees the SMU Core Curriculum, and three undergraduate programmes: a deferred declaration of degree, an Individualised Major culminating in a Bachelors of Integrative Studies, and an Individualised Second Major. In time, it will also offer a postgraduate programme at both the Master’s and PhD levels. The College also houses the Wee Kim Wee Centre, and manages SMU’s Residential Living and Learning initiatives, including the Prinsep Street Residences and its programmes.",
    "Can you provide more details about the deferred declaration of degree?",
    "",
    "The deferred declaration of degree is a one-year non-degree programme which allows students to be enrolled at the CIS, without pre-committing to any specific degree programme, to explore their intellectual interests and talents via Core Curriculum courses, as well as disciplinary courses from other SMU Schools. ",
    "How many course units (CUs) do I need to take to complete my Individualised Major? ",
    "",
    "Students enrolled in an Individualised Major will take 12 Core Curriculum CUs (this is the same for most students in SMU, except for LLB, BSc (Computer Science) and BSc (Computing and Law) degree programmes), 16 Major CUs, and 8 free elective CUs for a total of 36 CUs to graduate with a Bachelors of Integrative Studies. Regardless of track, all Individualised Majors will take three major core courses (3 CUs), each co-taught by faculty from different disciplines, designed to immerse students in integrative analysis.   ",
    "What is the difference between the professional and research tracks under the Individualised Major? ",
    "",
    "The professional track envisages closer exposure to industry and real-world problems, preparing students for future employment. The research track is suitable for students with an interest in a policy, academia, government, or similar career.",
    "For the Individualised Second Major professional track, how do I decide whether to take a 1 or 2 CU capstone?",
    "",
    "This will depend on how you design your major and what you would like to populate your programme with. For example, whether you are undertaking other internships/SMU-X modules for your first major. It will also depend on how deeply you would like to explore and research a topic. When you apply, you will be encouraged to discuss this with your faculty advisor.  ",
    "What if the modules I want to select have prerequisites?",
    "",
    "You would need to take the prerequisite(s) or choose a different course that is also aligned with your theme. Alternatively, you could select a module with prerequisites that you have already met. The College of Integrative Studies is committed to a robust advising system to help you navigate these questions.  ",
    "Can I still undertake an Individualised Second Major if my GPA is below 3.4? ",
    "",
    "The College welcomes students who demonstrate aptitudes across a wide range of areas, by a variety of metrics beyond GPA. Above all, we look for a commitment to interdisciplinary approaches, and a passion to find integrative solutions to the challenges of a dynamic and complex world. Your application will be assessed on grounds of a strong personal statement that authentically reflects this, as well as the viability of your chosen them",
    "Can I change my choice of school at the end of my first year?",
    "",
    "Students who, at the end of the first year at the College of Integrative Studies, would like to move to a different School can do so without a new application if they had indicated their choice of School at the point of admission either as a second or third choice, and had met the criteria for a reserved spot. ",
    "",
    "However, if they want to move to a school previously unindicated at admission or for which they did not meet the criteria for a reserved spot, they will be treated as internal transfer students and must apply to and satisfy the relevant School’s criteria for transfer. For more information, please refer to the OASIS | Transfer of Programme Policy. "
  ]
}
