

{
  "data": [
    "1. Which of my trips will be covered by the SMU Student Travel Insurance? All students travelling overseas for activities or purposes approved, endorsed, organized, sponsored or authorized by SMU will be covered by the SMU Student Travel Insurance. Such trips shall be referred to as “Authorized SMU Student Trips” in short for purpose of this policy. Trips must commence and end in stationed location and shall not exceed consecutive 365 days in all (inclusive of 60 cumulative days of Personal Deviation immediately before and/or after an Authorized SMU Student Trip)",
    "2. What is the definition of SMU Students? All undergraduates (UGs), Postgraduates (PGPs & PGRs) & Non-Graduating (NGs) students.",
    "3. What is the end date of Student’s candidature with SMU? The Conferment Date will be the official end to Students’ candidature with SMU.",
    "4. How do I get my trips covered by SMU? Students to ensure that trips are approved, endorsed, organized, sponsored or authorized in writing by the relevant approving authority in the Faculty / Department / Centre / Program for such authorized SMU student trips. Students/ Departments are to keep proper record of the approval / endorsement for the Authorized SMU Student Trips and also Date of Departure from stationed location and Arrival to stationed location as this will account for the Personal Deviation.",
    "5. What do I have to do to be covered under the SMU Student Travel Insurance? You do not have to do anything to be covered by the SMU Student Travel Insurance, Cover is automatic as long as you are a SMU Student and travelling overseas for activities or purposes approved, endorsed, organized, sponsored or authorized by SMU.",
    "6. What are the benefits & exclusions? Please refer to “SMU Student Travel Insurance cover”.",
    "7. If I go for multiple trips within a year, will I still be covered by the travel insurance policy? Yes. There is no limit in the number of trips which you may make during the year, but it must be for an SMU endorsed activity, i.e. “Authorized SMU Student Trip”; Effective from 1 January 2020, “Per Trip” has been extended to not exceeding 365 days (inclusive of 60 days of Personal Deviation taken immediately before and after the Authorized SMU Student Trip) “Per Trip” is defined is a round trip commencing and ending in stationed location.",
    "8. If I am going for a pure leisure / home trip, am I covered by this travel insurance policy? No, this policy covers only SMU endorsed and authorized trips; pure leisure / home trips are not covered. However, if you are going for home leave that immediately connects to an Authorized Student Trip, this can be covered subject to adequacy of the personal deviation as allowed under the policy, i.e. 60 days. The duration whilst you are in your home country will be deemed as personal deviation.",
    "9. What is the difference between “Home Country” and “Country of Residence”? Home Country means the country of which the student holds a passport. Country of Residence means the country in which the student is residing (ie. Singapore).",
    "10. What is Personal Deviation and is there cover for Personal Deviation (PD)? Personal deviation means personal vacation taken by the student immediately before, during or immediately after an authorized trip up to a maximum cumulative of 60 days Coverage will be ceased upon utilization of the 60 days and there will be NO cover for the balance of the trip. You have the option to purchase cover for the number of days beyond the 60 days personal deviation. Please refer to question 19 below.",
    "11. How does the 60 days before, during and after Personal Deviation (PD) cover? Authorized travel period – 1 February 2022 to 30 April 2022 Destination – Hong Kong Scenario 1 (30 days before the Authorized Trip) Student travel on his personal vacation to Taiwan (30 days from 1st January 2022 to 31st January 2022) before the authorized trip. Is he covered? Yes, he is covered as the period is within the 60 days personal deviation period. Scenario 2 (60 days or more after the Authorized Trip) Student travel on his personal vacation to Taiwan (63 days from 1st May 2022 to 2 nd July 2022) after the authorized trip. Is he covered? Yes, he is only covered up to the 60 days personal deviation period. 60 days starts from 1st May 2022 to 29th June 2022. Beyond 29th June are not covered. Scenario 3 (Transit in Singapore) Student transit in Singapore, before embarking on Authorized Trip. Is his personal deviation covered? If the student is on personal deviation (60 days before the Authorized Trip) and transit in Singapore before embarking on Authorized Trip is covered.",
    "12. Is there any restriction if I travel out of my host country during the term of my Authorized Trip and will I be covered? There is no territorial restriction. You can travel anywhere in the worldwide except to the “excluded” countries.",
    "13. Are there any countries excluded from coverage? It is a requirement to always comply with applicable US economic and trade sanction laws in providing coverage. This Policy also does not apply to the extent that trade or economic sanctions, laws, regulations or other laws or regulations prohibit Starr from offering or providing insurance.",
    "14. After my Authorized Trip, I may want to return to my Home Country for good instead of coming back to Singapore. Will I be covered? The intention of this policy is to provide cover for student departing from and returning to Singapore. If the student decides to return to Home Country for good instead of returning to Singapore, this insurance will terminate upon the expiry of the personal deviation period as allowed under policy or upon the student arriving at his Home Country whichever is earlier.",
    "15. My host university requires me to provide proof of Health Insurance; otherwise, I am required to take up additional insurance as provided by my host university. Will SMU be able to furnish me with a Certificate of Insurance (COI)? Yes, you can request from Honan to issue you with a Certificate of Insurance (COI) which will reflect your name and your travel details as well as a summary of the benefits covered under the Policy. You can submit the COI to the host university Acceptance of SMU-arranged insurance is at the prerogative of the host university. Please write in to info@honanbenefits.com with the following details required Policy No SATA00001523 Name of Traveller Date of Birth Passport No. Destination (City & Country) Period of Trip  16. My travel dates are not confirmed yet. I may consider taking a short holiday after my Authorized Trip but these are not fixed yet. What dates should I indicate under the “Certification for Visa/Permit Application Form”? For the purpose of issuance of the COI, whether for application of Visa or Residence Permit or for submission to the host university, tentative dates are fine as long as these are sufficient to meet the requirements of immigration or the host university. However, you will need to have firm travel dates to compute your total personal deviation days (taken outside of the Authorized Trip) as the policy only provides free cover up to 60 days.",
    "17. Can I top-up higher limit for the Medical Expenses benefit or other benefits under this Student Travel Policy? No. The benefits / limits under the SMU Student Travel Policy cannot be amended. There is no top-up feature granted under the SMU Student Travel Policy.",
    "18. Can I purchase additional travel insurance cover? Yes, you can purchase your own personal travel insurance with your preferred insurance company. If you do not have one, you may consider from STARR via below link. https://smu_honan.starrinsurance.com.sg/?contract_id=149430&_curcid=16846 You can enjoy a 10% off the regular premium by keying in the promo code: HNTR  19. Can I purchase individual travel insurance to cover the number of days exceeding the 60 days personal deviation? Yes, you can only purchase the insurance cover from STARR via the above link. Scenario: Departs Singapore – 1 Jun 2022 for personal holiday (90 days) Start of Official SMU overseas programme – 30 Aug 2022 End of Official SMU overseas programme – 15 Jan 2023 You can purchase the additional 30 days cover via the above link. Just indicate the period from 1st June to 30th June 2022. Please be informed that any additional cover to the personal deviation trip must be purchased before the authorised trip. Starr will not accept application during the trip while overseas.",
    "20. If I am going overseas to represent SMU in sports or sporting activities, will I be covered? Students engaging in Co-Curricular Activities (CCA) accompanied by professional & authorized by SMU for Alpine Sports, Biking, Diving, Kayaking, Skating & Trekking are covered. This insurance excludes any competitive sports not organized by SMU or Professional sports. Professional sport means sports in which the athletes receive payment for their performance  21. Can I stay in any class of ward in the hospital? Yes, any class of ward in hospital up to the equivalent of single-bedded, and falls within reasonable accommodation for the medical condition treated by the attending physician  22. Will I be covered if I seek TCM treatment? Yes, TCM is covered subject to policy terms and conditions  23. Are dental and optical expenses covered? No, dental treatment and optical expenses are not covered except for accidental injury (dental charges to restore sound and natural teeth resulting from an accident).",
    "24. I am pregnant. Wil I be covered while I am overseas? No, the policy does not cover any pregnancy related issues (except accidental miscarriage not attributed to any natural causes and/or sickness).",
    "25. Are Acts of Terrorism covered? Yes, this policy is extended to cover terrorism (including Nuclear, Chemical or Biological Terrorism)",
    "26. Does this insurance extend to cover damage to rental vehicles or liability to third parties arising from the use of the rental vehicle? No, this travel policy does not extend to cover damage to rental vehicle or third parties.",
    "27. I will graduate mid-term during my Authorized Trip. Will I still be eligible for cover under this insurance? If you are still a registered student of SMU at the time you leave stationed location for an Authorized Trip, you will be covered for the trip, subject to terms and conditions of the policy.",
    "28. Under what circumstances will “Travel Delay” be triggered? Travel delay claim will trigger under the following circumstances: - If the Common Carrier which the student has arranged to travel on is delayed for more than 6 hours from the specified time in the itinerary, due to: a. Strike/Industrial action. b. Adverse Weather Conditions. c. Civil Commotion. d. Terrorism, Bomb Threats. e. Natural Catastrophe (Hurricane, Typhoon, Earthquake or Tsunami) f. Mechanical breakdown/derangement of that common carrier; or g. Grounding of an aircraft as a result of mechanical or structural defect.",
    "29. Under what circumstances will “Travel Misconnection” be triggered? If during the period of insurance, whilst the student is on a trip, the student misses a connecting flight due to: a) The late arrival of his incoming flight. b) Any event leading to airspace or airport closure; and no alternative transportation is made available by the Public Conveyance to the student, STARR will pay up to the benefit amount as shown in the policy schedule.",
    "30. Under what circumstances will “Cancellation/ Curtailment/ Rearrangement/ Postponement be triggered? Cancellation If during the period of insurance, the student is forced to cancel a planned trip prior to the commencement of the planned trip as a result of a “Specified Cause” occurring within 30 days of the planned trip, the policy will indemnify in respect of the Cancellation Expenses incurred (refer to expenses payable under a contract, or forfeited or unrecoverable expenses, deposits, advance payments for travel or accommodation)",
    "31. Are medical expenses covered if I contracted COVID-19 overseas and come back to stationed location? Medical expenses will be covered if the student contracted COVID-19 during the authorized school trip, up to SGD250,000/-. For Post Journey Medical Expenses, if the student has already sought treatment overseas, the follow-up treatment will be SGD10,000 within 60 days from date of arrival back to stationed location. If the student has yet to seek treatment during the overseas trip, the first treatment in stationed location must be within 7 days from the date of arrival.",
    "32. Under what circumstances will “Cancellation/ Curtailment/ Rearrangement/ Postponement be triggered for COVID-19? In the event that the student sustains Sickness (including COVID-19) while overseas and renders him/her unfit to travel (with doctor’s advice), Cancellation / Curtailment / Rearrangement benefit will respond accordingly. The maximum limit is SGD 1,000/-",
    "33. If my trip is cancelled or postponed due to the decision of external parties cancelling or postponing the event / course / seminar, will the policy pay for the costs of such disruption? No, the policy does not respond as it is not within the specified cause covered under the policy. Lockdown triggered expenses are also not covered.",
    "34. If I wish to cancel or postpone my trip due to concern of the pandemic, can I claim for the cost of cancellation or rescheduling the trip? No, the policy does not respond as it is not within the specified cause covered under the policy.",
    "35. Is Swab test covered under the program? If during the trip, the student is unwell and seeks treatment, and recommended by the doctor to perform a swab test, it is covered. Swab test for any other purposes is excluded.",
    "36. Is quarantine (local & overseas) covered under the program? Quarantine is covered on the following basis Being tested positive or come in close contact with COVID-19 positive people and is put on compulsory quarantine ordered by a government authority. SHN/Quarantine costs covered for country entry purposes are not covered.",
    "37. For COVID-19 related expenses, what countries are covered? As long as the countries are authorized planned destinations by SMU. Personal deviation in another country is covered as part of the authorized trip.",
    "38. Which are the official sites of reference used by Starr to determine if a particular destination can be covered? SG MFA travel advisory: https://www.mfa.gov.sg/Services/Singapore-Citizens/COVID-19-Travel-Restriction",
    "39. If trip already commenced prior to travel alert of destination, will the cover continue? Cover will continue in view that travel alert of destination is after trip departure"
  ]
}
