{
  "documents": [
    "Jerome Yuen, father of A-levels graduate and Year Four SMU Business student Chloe, believes that youngsters need to be pushed to think ahead to the future.",
    "It came with little surprise to Darayus Bhesania when his daughter, International Baccalaureate graduate Anahita, told him that she would apply only at SMU.",
    "Hear what Kay Gim Hwee, father of final year SMU Accountancy student Jenzen, has to say of the latter’s transition from poly to SMU.",
    "Is your child choosing his or her university? Follow this guide to help you both discover how to unleash your child’s potential.",
    "Let SMU’s Bachelor of Social Science show you how different disciplines can work together to solve society’s problems and tackle issues in today’s uncertain world.",
    "Discover how the SMU Psychology, Political Science and Sociology major produces graduates with diverse skills to tackle the fast-changing world.",
    "With competencies that are transferable across a wide range of professions and sectors, it is no wonder that the innovative Politics, Law and Economics major offered at SMU School of Social Sciences is fast gaining popularity among students.",
    "SMU Open House is set to make waves this year with an exciting line-up of both in-person and virtual experiences. Come find out how SMU can propel you into your future as a confident, world-ready individual!",
    "Read on to find out how SMU Business student Akash Mittal achieved his career goal through a short-term internship in Bangkok.",
    "Choosing a university and not sure how? Here’s a handy guide to aide you in your quest in finding the university of your dreams!",
    "National Hockey Player Gene Leck talks about how she fell into the sport by chance, juggles schoolwork with training, and aims for a fulfilling university journey.",
    "Some credit the success of Squid Game to its twisted premise, while others claim it’s Gong Yoo. Regardless, the record-breaking television series presents some solid takeaways that even students can learn a thing or two from.",
    "As the world gears up to live with Covid, we hear from some of the world's top business moguls on what it takes to keep the pandemic fatigue at bay and thrive in this highly challenging environment.",
    "Here are top programmes you can consider, hand-picked to fast-track your way to a C-suite role.",
    "Second-year School of Accountancy student Ryan Ang had an early start in golf and has not stopped playing since he was five years old.",
    "Watch how Year 4 Accountancy undergraduate Tan Shu Min got to experience a multicultural working environment through her overseas virtual internship stint with a Balinese startup.",
    "As part of SMU’s global exposure programmes, Chinkita Chugh embarked on a dream exchange programme to Babson College in the USA.",
    "As we prepare ourselves to live with the pandemic for the long haul, what are some ways to mitigate its fallouts as a society?",
    "Find out why SMU MBA graduate and Dean's List recipient Daryl Png went against the grain to go from entrepreneur to high-flying employee.",
    "Let these 10 apps help you navigate your way to a healthier mind so that you can get more enjoyment out of life.",
    "Yeo Jin Yee, Vice President of the SMU FinTech Club in 2021, recounts how her leadership experience turned into a journey of self-discovery.",
    "SMU’s Overseas Virtual Internship Programme gave SMU Accountancy student Izzaty exposure in the tax field through an internship with a Myanmar-based law firm.",
    "In his first job, SMU Accounting Data Analytics major Ho Ming Quan took his own initiative to enhance processes to run client operations 85% more efficiently.",
    "Darren Yeo, alumnus of the SMU School of Social Sciences, tells us about the advantages for poly graduates looking to prepare themselves for the global workplace at SMU.",
    "Both the IB programme and an SMU education work to prepare their students for an increasingly globalised workplace. SMU Social Sciences alumna Chua Li-En tells us more.",
    "Did you know that professional leaders have 2 things in common? Find out what they are and how the SMU Bachelor of Social Science is the perfect next step for A-Level graduates.",
    "Meet Palak Agarwal, a fourth year SMU student pursuing a Bachelor of Science in Economics who transitioned from an IB education into university.",
    "Hear from Connor Teo, who shares his journey from polytechnic to a full-fledged SMU global citizen.",
    "For Tay Huan Lin, a Year Three SMU Bachelor of Science (Computer Science) student, graduating from A-levels into university takes him a step closer to the rest of the world.",
    "In a world where data is king, SMU’s Second Major in Accounting Data and Analytics has opened doors for many students.",
    "Through learning more about wealth inequality, CJC alumnus John David hopes to find solutions to help mitigate the effects of poverty during his time here at SMU.",
    "Despite having to cope with the challenges of dyslexia, Temasek Junior College alumna Ng Ka Mun has thrived in academic environments.",
    "As a student, Sneha Peter won numerous accounting competitions including the SMU Accounting Challenge 2021 and SMU Mind the GAAP 2021.",
    "A self-professed late bloomer in school, incoming freshman Andralynn Tan developed a passion for FinTech in polytechnic.",
    "In a digital age where lawyers need to be more than good counsels, an SMU-X course is offered to prepare law graduates to stay ahead of the digital curve.",
    "SMU's A/Prof Michael Bashshur and PhD candidate Laurel Teo share how AI affects human resources aspects such as well-being, privacy and leadership at work.",
    "A first for SMU, the work-study degree in software engineering is designed to nurture workplace-ready software engineers to meet industry demand.",
    "SMU Computing and Information Systems student Calista Lim was certain she wanted an internship with a business that had triumphed the pandemic.",
    "Discover Nicolas' reasons for choosing SMU and its Bachelor of Science (Information Systems) – Smart-City Management & Technology Major here.",
    "Hear from Guan Bingyan, incoming Bachelor of Science (Software Engineering) freshie as she tells us about her passions.",
    "As an IB graduate, Year Three SMU Social Sciences student Jamie Ho took to the intimate class size pedagogy offered at SMU like a fish to water.",
    "Final Year SMU Computing student and seasoned presenter Gigi Teo tells us all about her most cherished experiences at SMU.",
    "For SMU business undergrad Deng Boya, experiencing independent living while living at the Prinsep Street Residences was a big part of her university life.",
    "Coming from a junior college, the SMU experience has nurtured in Economics student Sia Yu Ting, the courage and confidence to be bold.",
    "Through the SMU Global Innovation Immersion programme, SMU student Regina Liu landed her internship in the blockchain industry in a China-based startup.",
    "According to Ong Ken Jin, SMU Accountancy undergrad and President of SMU Sustainable Investment Club, there is no ‘one size fits all’ formula when it comes to ESG or impact investing.",
    "In celebration of International Women’s Day, hear from SMU alumnae Anna Haotanto, Sandra Lam and Wong Dan Chi as they dish out words of wisdom.",
    "To beat thousands and travel overseas for an exchange during border lockdowns is no mean feat. Indonesian exchange student, Iqbal, shares his fulfilling SMU experience.",
    "The sharp rise in financial crime worldwide has driven up demand for financial forensics talent. Hear from SMU adjunct faculty Charles Li and SMU Accountancy undergraduate Angel Peh on highlights of the SMU Second Major in Financial Forensics.",
    "Monolith, a society started by a group of volunteers made up of SMU alumni and other young professionals, is founded on the belief that help should reach those who need it.",
    "Learn how a group of SMU Accountancy undergraduates represented Singapore at the Deloitte SEA Tax Challenge 2023, to spectacular results.",
    "Appointed Partner at a consultancy firm, SMU Accountancy alumnus Rafael Lam embodies the versatility that is high in demand in today’s workforce.",
    "The new SMU Master of Science in Entrepreneurship and Innovation sets out to nurture future citizen skills. Hear from Academic Director Prof David Gomulya.",
    "Hear about the lessons SMU Accountancy student Viven Xia learnt while representing Singapore internationally and how she balances frisbee and her studies.",
    "Read how embarking on the SMU ASEAN Internship Programme has reaped myriad rewards for SMU students Hui Ling, Cheriya and Brian.",
    "Learn how SMU Accountancy alumna Tan Ci Hui clinched the honour of representing Singapore at an international accounting summit for young leaders.",
    "From sample classes, info sessions to amazing giveaways, here are 10 reasons why you cannot miss this event of the year.",
    "Learn how SMU undergraduate Mugdha Jaruhar stepped out of her comfort zone to gain a fulfilling global experience through an overseas exchange.",
    "Learn about SMU Business student Kennis Tan’s unique overseas internship in the maritime sector and how it has helped prepare her for global citizenship.",
    "Learn about the adventures of IB graduate and SMU Law student Elliot Teng as he ventures overseas for an exchange at the NOVA School of Law in Portugal.",
    "Read on to discover how SMU offers up the world to its students with an integrative and interdisciplinary education.",
    "When Archanna Selvaraju picked the University College Maastricht as the destination for her International Student Exchange Programme, she did not expect to be captured by the charms of Maastricht, a laid back city located in the south of The Netherlands.",
    "Known for lacking in natural resources, Singapore has an abundance of sunny days instead. What exactly is stopping the country from adopting wider use of solar energy, and what can it do to make hay while the sun shines?",
    "With the changes in how knowledge is consumed today, does standardised testing still have a role in modern society?",
    "SMU Business alumna, Jasmine Lim, took a leap into an international exchange programme at ISM University of Management and Economics to come off all the wiser.",
    "Preparations for Singapore’s transition to endemic living has been in the works for a while. How ready are university students to return to life on campus?",
    "This year’s SMU Arts Festival, aptly named 2GETHER AS 1, rallies the arts community together in this post-pandemic era.",
    "SMU Social Science and Business Management student Lai Siew Ping applied for and landed a virtual internship role with Filinvest Development Corporation (FDC), a conglomerate based in Manila.",
    "The pandemic has thwarted the plans of many, but the SMU arts community is not about to give up on its resolve to put up quality arts showcases.",
    "SMU rolls out a framework that teaches them how to stay mentally healthy and resilient in their university years, but also well beyond their graduation.",
    "Learn more about the growth and unforgettable experiences of 4 SMU students who ventured overseas as part of the ASEAN Short-Term Internship Programme.",
    "Learn more about the ins and outs of entrepreneurship from serial entrepreneur Inderjit Singh and how it accelerates growth, innovation and social change.",
    "In the midst of their short-term internships throughout Southeast Asia, four SMU students share their adventures and insights gained overseas.",
    "These SMU students chose to expand their horizons with overseas short-term internships in Southeast Asia. Hear what they’re most looking forward to!",
    "Committed to its vision to be an engaged city university that impacts and shapes commnities, SMU is set to open its first overseas centre in Indonesia.",
    "Recognising the importance of education, SMU is committed to providing equal educational opportunities to students who desire to achieve their full potential.",
    "Read on to learn more about how SMU students Rhea Faith Molas and Tan Yi Hao benefited from their summer internships with Indonesia-based companies.",
    "Read on to learn how global exposure opportunities at SMU have motivated Accountancy alumna Joanna Chung to pursue an overseas posting in Berlin, Germany.",
    "Learn more about the journey of SMU Computing student Felix Li, who embarked on a once-in-a-lifetime overseas internship at a Silicon Valley-based start-up.",
    "Find out how SMU’s Fast-Track BBM-MQF allows you to graduate with a BBM and MSc in Quantitative Finance in an accelerated programme.",
    "Learn travel and budgeting tips from SMU students Shanna Gandicela and Dominic Ler from their global exposure adventures in South Korea and Thailand.",
    "SMU Assoc Prof Hady Lauw and PhD graduate Truong Quoc Tuan share how data can be used to uncover user preferences and create better online experiences.",
    "When SMU student JunSoo became an Investment Analysis intern, he found out how the foundational career skills picked up at SMU came in useful.",
    "Find out how SMU undergrads, Pek Yoke and Ambrose, decided on Spain and Germany as their respective global exposure destinations as they share their budgeting and travel tips.",
    "Meet SMU Social Sciences undergraduates Clarissa and Mouli, who were in USA and Canada respectively, as they share some of their travel and budgeting tips.",
    "Let this handy guide be the starting point of your SMU freshman life as we attempt to demystify some of the most commonly used SMU lingo for you.",
    "Hear from undergraduates Joshua Yuen, Valliappan Arunachalam and Megan Cheah who share with us their global exposure experiences in Switzerland and Italy.",
    "Learn about the global exposure experiences of SMU students Jia Wei and Quok Juin who ventured overseas to Norway and The Netherlands in the New Normal.",
    "SMU Accountancy graduate Darren Ong made a surprise move to Gojek, and played a key role in the tech company’s IPO launch on the Indonesia Stock Exchange.",
    "SMU’s strong commitment to providing global exposure experiences to its students enabled Amanda Song to venture to India and South Korea in her undergraduate years.",
    "The level of autonomy a parent grants can influence their child’s cognitive and behavioural development, according to a study conducted by Germaine Tng.",
    "Canada was the destination of choice for SMU Business alumna Cheong Yi Hua when she was deciding on her semester exchange programme.",
    "Even as Singapore fights its latest wave of Covid infections, university students across the island are eager to get back their on-campus college lives. Here are some tips on how we can prioritise our health and safety as the nation adjusts to living with the endemic.",
    "Check out these six tips on how one can build career resilience amidst global changes.",
    "Check out these hacks to upgrade your personal space on a budget for an instant mood lift.",
    "The past year or so has been tough on those studying or working far from home, and it does not get better during the festive season.",
    "As a digital retail intern with a Vietnamese food products company, L’Earth Vietnam Co, Ltd, SMU final year Business student Chin Zi Ying was able to pick up e-commerce skills from both the Vietnamese and Singaporean markets.",
    "Born into a family of athletes, SMU Business undergraduate Ow Yeong Wei Bin works tirelessly to overcome his struggles as a student-athlete.",
    "A semester exchange programme to the Pearl of the Orient gave the SMU Economics alumna a taste of the unique experiences one can get only in Hong Kong.",
    "Where working from home was once a dream for cubicle dwellers here, what has gone so wrong with the phenomenon – made a necessity by Covid – that it’s propelled Singapore to the top of the chart as the most fatigued nation in the world?",
    "Hear from SMU ExD Academic Director Dr Markus Karner on the role of product managers and how one can navigate a career in product management.",
    "3rd year SMU Accountancy student Charis Tay knew an EY internship could let her put the skills and knowledge she learnt into actual, real-life practice.",
    "SMU Social Science graduate Rachel Ngu takes a look at how six sets of Malaysian families maintain familial relationships while being physically apart in her study.",
    "Learn how SMU Economics student Abdullah Khurshid got his start in the start-up ecosystem through his involvement in Protégé Ventures and SMU IIE’s Global Innovation Immersion programme.",
    "SMU Business students Sarah Ang and Lim Ji Xuan tell us more about their eye-opening experiences as interns at two Vietnam-based start-ups.",
    "SMU ExD Prog Director Dr Flocy Joseph shares how a sound cybersecurity strategy is imperative for businesses as digital transformation takes over our lives.",
    "Having observed the rich and poor divide in Myanmar, Accountancy Alumna Sheriel Chia knew she had a mission to reduce inequality when she returned home.",
    "Contracting Covid-19 upon arriving in Thailand for her overseas internship programme did not faze SMU Business student Leong Hui Ling.",
    "Humanities Scholar and ACS (Independent) alumnus Elisha Tan taught English to foreign workers in a bid to help them overcome language barriers here.",
    "Siti Noormasliana is a passionate mental health advocate who has championed social causes such as gender equality, inclusivity, and the welfare of migrant workers.",
    "Meet Muhammad Izzat Junaidie, accomplished shooting champion, who tells us what made him decide to apply to SMU’s Bachelor of Science (Computer Science).",
    "Find out from Eunoia JC alumna Sarah Thauheed on why she has chosen SMU’s Bachelor of Science (Information Systems) and how she picked up speed reading as a young student.",
    "Hear from CJC alumnus and incoming SMU freshie Andre Song on his wide interests and why he picked Bachelor of Science (Computing and Law) as his programme of choice.",
    "SMU Accounting A/Prof Richard Crowley and PhD candidate Zhao Yue discuss the intersection between online data, public trust in corporations and accountancy.",
    "As a law student with a strong interest in real estate, Cheriya Chomrat saw the perfect internship opportunity at PT Genesis Indojaya.",
    "Hear from SMU Social Sciences undergraduate Joseph Hwang as he tells us more about what SMU has enabled him to achieve with a flexible class schedule.",
    "With SMU’s flexible curriculum, students can customise their own class schedule and still find time to explore other interests.",
    "SMU Accounting student Edward Lo he tells us more about how his SMU experience has built him up to take on the working world.",
    "Check out tips from SMU Economics undergrad Uday Sasthaa on how you can live up your life at the Prinsep Street Residences, without sacrificing your GPA.",
    "How's the class enrollment process at SMU similar to a secret auction? Read on to find out how you can master BOSS bidding at SMU while bidding like a boss!",
    "In the face of an endless stream of digital distractions today, here are some tips to help us pick up the skill of deep reading to make us human again.",
    "Are your outfits getting suspiciously snug? Time to get back in shape as Phase 3 and more social activities loom in the distance.",
    "A recent study on gender dynamics revealed that female pairs work together better to handle disagreements on how work should be done, among other findings.",
    "The answer is 'yes' if it adapts to the new off-premise and digital reality. Koh Kek Sin, founder of Ants Franchise Consulting, tells us how.",
    "Dr Ang Ser Keng from SMU's Lee Kong Chian School of Business shares how and when involving venture capitalists in your startup can propel it to success.",
    "Like it or not, influencers are here to stay. Here are five pro-tips on how you can boost your business through influencer marketing.",
    "Find out how three SMU students rode on China's waves to gain eye-opening experiences through internships in the Chinese startup industry.",
    "Creative thinking and nimble planning morphed the festival into an online artistic showcase centred on being apart, yet a part of the pandemic situation.",
    "To avoid committing a major faux pas at your next video call, here are some practical tips on how you can master video conferencing like a pro.",
    "Despite having his extended internship disrupted by the pandemic, Brandon Ong found fulfilment through his work and interactions with the people he met.",
    "SMU alumnus Benjamin Loh suggests taking an introspective approach to dealing with the big unknown that Covid-19 has dealt us. He shares some questions to get you started.",
    "Three university students share how they began Project Y to Z to help the graduating class of 2020 find a guiding light through the personal stories of those who had graduated into the 2008 financial crisis.",
    "SMU Accountancy alumna Sheriel Chia wanted to expand her horizons and pursue a career in an off-beaten path. The prospect of working in Myanmar within a startup like Get All Myanmar.Co. proved irresistible to her.",
    "Do you suffer from anxiety if your mobile phone is not within your reach? If so, it may be time for a digital detox.",
    "SMU student Ishan Singh shares his five ways to stay meaningfully occupied during the #circuitbreaker, and even as Singapore readies itself for re-opening.",
    "Despite the pressure of the COVID-19 pandemic on F&B, SMU alumni, Anna Haotanto and Brian Chua made the tough call to sponsor meals for our everyday heroes?",
    "People analytics is changing the way human capital is handled. Co-founder of EngageRocket, Dorothy Yiu, shares her insights into the field and what sparked her interest in it.",
    "The inaugural SMU-ISCA Case Competition 2019 drew 46 teams from polytechnics and universities and was organised by SMU Accounting Society and Institute of Singapore Chartered Accountants.",
    "Being an entrepreneur is not easy. Besides finding the right people to fight alongside you, Tiziana Tan’s personal mantra is to ‘laugh at the odds’.",
    "SoA final year student Vicki You wrote to express her thanks to her professors in appreciation of the knowledge she had gained, especially from her second major in Accounting Data and Analytics.",
    "Year two SMU Accountancy student Kenneth Wong spends his Friday evenings in a rather untypical fashion—helping ‘rough sleepers’ in Singapore.",
    "SMU Adjunct Faculty and author Jörg Dietzel believes that to thrive post-Covid, brands need to adopt a hybrid form of digital and in-person experiences.",
    "SMU Accountancy Alumnus and founder and CEO of Workstream.us, Desmond Lim, was recognised as one of 2020 Silicon Valley Business Journal's 40 under 40 honorees.",
    "Find out here how you can spend less, save more, and improve yourself while waiting for the economy to turn around in these uncertain times.",
    "In a letter to his professors, SMU Accountancy student Irving Yeo reflects on his journey pursuing a second major in accounting data and analytics and how he has benefitted greatly from the programme.",
    "Kickstart the new year by giving your eyes a break and let your ears do the learning instead with this useful list of podcasts.",
    "Not all business pivots result in success stories, but these businesses have taken the plunge to adapt their business models to the new climate.",
    "An aging population, technological disruption, and a greater need for public engagement are just some factors that will affect the future of public housing.",
    "When Theodora Boo witnessed first-hand how venture capitalists played a key role in a startup’s success, she was hooked.",
    "Setting up a business in an economic crisis seems like a daft idea; until you realise how many of the biggest brands today were started during downturns.",
    "Organising SMU’s signature event for freshmen was no easy task. After nearly 6 months of hard work, FOMO 2021 turned up a spectacular detective-themed orientation camp.",
    "Multiple Asian Games medallist and freshly minted Olympian Kimberly Lim tells us more about her journey as she returns to campus with the opening of the new academic year.",
    "Third-year SMU Business student Evan Chow has six valuable tips for budding entrepreneurs looking to set up their first startup.",
    "Find out how being kind to ourselves in times of adversity can help build us up for future success.",
    "How can we, as a society, bring about awareness and change to protect the mental health of our youths?",
    "In good times, one may have to give up on decent remuneration, promotion opportunities and business travels to pursue a postgraduate degree.",
    "SMU pivoted its global exposure approach to enable its students to continue achieving global exposure learning outcomes, even without travelling physically.",
    "Having been bitten by the entrepreneurship bug at a young age, final year SMU Business student Marcus Cheu saw the perfect opportunity to pursue his passion the year he entered university.",
    "Determined to make their mark in the world, a group of SMU students ‘travelled’ to Indonesia to help out local SMEs.",
    "Find out how our habits in today’s new normal are adding to the burden of Planet Earth.",
    "Here are five tips to help you form new bonds and adapt to campus life as you prepare for your transition to university life in a pandemic.",
    "New at SMU and looking for somewhere to belong? With the wide variety of CCAs on offer at Vivace 2021, you are bound to find something up your alley.",
    "SMU DBA alumna Rameshwari Ramachandra tells us about her determination to turn her entrepreneurial dreams into reality, against all odds.",
    "More and more, law school education is becoming known for providing a robust training to those who have plans beyond a career as a legal eagle.",
    "Ho Ngai Meng, a Doctor of Business Administration Candidate at the Lee Kong Chian School of Business, started his career as a software developer. Out of pure happenstance, he landed a trainer role and is today, a 20-year veteran in the people and talent development field.",
    "The gamification of learning proves the concept that learners of every age learn best when we are at play and having fun. Here’s how SMU Challenge, a redeveloped learning app, is shaking up the way SMU students learn.",
    "Check out our five tips on how you can have a blast in your university years at SMU without breaking the bank!",
    "The SMU experience has developed in fourth-year Law and Business Management student, Aisyah Az Zuhra Norkhalim, useful skillsets in areas like conflict management and negotiation. The former Vice-President of the SMU Floorball Team tells us how that has helped prepare her for the working world.",
    "Not one to settle in her comfort zone, SMU Business student Tarina Naresh Khiantani switched to major in Communication Management despite her background in Accountancy.",
    "If a young Anish Kishor Dobariyapatel could see himself today, he would be in awe of his own discipline and time management skills as a university student.",
    "The retail scene is witnessing a big shift in consumption habits. What can retailers do to recalibrate their strategies to woo customers back?",
    "Fu Zhikang, a trainer at SMU Academy and an IP Strategist, shares his insights on why intellectual property management is crucial for SMEs.",
    "Mr Rafael J. Barros shares some tips on how to better present data that’s easy to analyse, and how to prevent data analytics abuse in this era of fake news.",
    "How would starting a daily food log help you to achieve your ideal weight goal and improve your overall health?",
    "When Mr Phillip Wee wanted to digitise his business, he sought help from the SME Consulting Programme (SCP) organised by the UOB-SMU AEI.",
    "Which part of migrant workers' lives require immediate help, and how can the nation build on the momentum to improve their standards of living for good?",
    "With no precedent to model after, Megan Lim and Tan Qi Qing share how their team put together FOMO—SMU’s first virtual orientation—and made it successful.",
    "For SMU alumnus Lionel Gao, pursuing a career in his industry of interest upon graduation was more important than taking on a role he was familiar with.",
    "How can a fresh graduate deal with tough times? With grit and the right mentality, says SMU alumnus Woo Jian Sheng.",
    "When the circuit breaker was announced in Singapore, business owners had to make quick decisions to adapt their businesses to the new situation.",
    "Living far away from home in Singapore, SMU PhD in Business (Finance) student Jin Zuben found a silver lining in the global crisis for having made her research life simpler and easier.",
    "As part of an SMU-X course, this team was tasked with coming up with real-life solutions to help tackle issues in their client’s revenue forecast process.",
    "SMU Core Curriculum seeks to equip graduates with agility and transferable skills to stand them in good stead, regardless of their pursuits.",
    "If you think Computing is to Law as chalk is to cheese, think again.",
    "Hoping to impact people positively and meaningfully, SMU Business alumnus Aaron Er started volunteering in his final year at SMU in 2015.",
    "SMU Business alumna, Anna Quang, got a foot into the door of a tech firm even before graduation, only to have the job offer rescinded.",
    "Overseeing the welfare of workers living in a dormitory with one of the highest number of infected Covid-19 cases in Singapore is not a job for the weak. But Melvin Ng, SMU Social Sciences alumnus, proved to have his head and heart in the right places.",
    "For SMU School of Accountancy alumna Cindy Yong, trading up physical classes for online learning turned out to be quite a discovery for her.",
    "SMU Yong Pung How School of Law’s alumnae Shim Eunkyung and Abigail Ong hold a common belief that their law studies have put them in good stead to help the disadvantaged and less-privileged.",
    "SMU Business alumnus Sean Tan wanted to find ways to convert Singapore's food waste into an environmentally sustainable yet viable business.",
    "SMU alumnus Brandon Koh shares how he is bridging the gap between psychology and the masses through his passion for science communication.",
    "Assoc Prof Liang Hao shares why CSR strategies need to be retained in a downturn, and ways companies can adapt their CSR programme to better benefit the community.",
    "Armed with pawsitivity and dogged determination, this organising committee overcame challenges to put together SMU’s signature animal welfare event.",
    "In the absence of face time with your supervisors and co-workers, how do you get the most out of your remote internship?",
    "Yeo Bao Shin, vice president of SMU Challenge 2020’s student organising committee, relates how his team overcame hiccups with creativity, and set a national record in the process.",
    "Associate Professor Jochen Reb of SMU’s Lee Kong Chian School of Business tells us how being mindful can help us cope with burnouts.",
    "Let our well-read SMU librarians offer you some pro-tips in sizing up the next sensational news story that pops up in your feed.",
    "Tasked with moving an entire cultural festival online, student organisers of Diverse-City 2020 found their recipe for success.",
    "Find out how you can still lend a hand to vulnerable groups in the society while keeping a safe and responsible distance.",
    "Digital marketer Sheryl Woon shares how being a millennial helps her to lead with respect and empathy in her job.",
    "SMU Year 3 Business undergraduate Lee Chaehyun took up a pro bono internship and found herself on a journey of growth and introspection.",
    "Let our signature open house event give you a preview to your university life at SMU—where students go on to become one of the most sought-after hires.",
    "Dilesh’s journey to land a job in his dream role of marketing has been a bumpy one, but the SMU Business alumnus is not giving up.",
    "In a tough business climate where bottomlines are king, toxic leadership is sometimes tolerated or even endorsed as a method of managing people to produce better results.",
    "If getting an internship offer in the midst of a global economic slowdown was hard, try having to turn down not one, but two offers.",
    "SMU alumnus Jaden Teo arrived in Vietnam in the midst of the Covid-19 outbreak. He pushed ahead with the launch of his edtech start-up to amazing results.",
    "When odds in the hiring market are stacked up against job seekers, it is time to reach out via alternative means to secure your next job.",
    "Find out why SMU School of Economics alumnus Benjamin Wong took a giant leap of faith leaving his job to start career accelerator business Kinobi.",
    "Social media has become an irreplaceable part of our lives, but how is it impacting the way adolescent girls view themselves?",
    "SMU Business alumna Jessica Lee returns with #HI2020, a new social initiative to support and inspire internship and job seekers through a series of personal stories.",
    "Hear from SMU Accountancy alumnus Peter Oh on why he decided to step off the beaten track to embark on his journey as an entrepreneur.",
    "Find out how SMU Access, helps ensure that no eligible student is denied an SMU education because of financial difficulties",
    "SMU introduces new second major in Digital Business and new track in Data, Design and Communication under the Communication Management major to offer graduates a leg up in the new business landscape.",
    "As a contact tracer, SMU School of Computing and Information Systems undergraduate Shawn Pang played an active role in the control of the Covid-19 pandemic in Singapore.",
    "What are the similarities between riding a bicycle and financial literacy? According to Asst Prof Aurobindo Ghosh, it’s hard to master either until you’ve taken a few falls.",
    "With the digital economy in mind, SMU has rolled out a degree programme to groom a new generation adept at bridging technology and law to take on the complexities of our fast-changing world.",
    "2020 was a busy year for SMU Year 3 Information Systems undergraduate Yash Gadodia. Identifying with the objectives of SMUMods, a review website for the SMU community, he inserted himself into the team and has since grown it into a 14-member operation.",
    "Ranked as the smartest city in the world, the pressure was on for Singapore to leverage on smart technology to help fight the deadly pandemic known as Covid-19.",
    "It takes considerable courage to leave a job you don’t identify with, especially amidst rising unemployment.",
    "SMU’s new second major in Financial Forensics is designed to equip a future workforce with the know-hows to tackle such white-collar frauds.",
    "SMU Accountancy student Tan Si Jin reflects on her experience as an intern in the SMU-KPMG Cyber Risk and Forensics Work-Study Programme.",
    "SMU Accountancy students emerged 2nd Runner Up and Most Agile Team at the ICAEW Greater China & South-East Asia Virtual Business Challenge 2021.",
    "SOA Outreach moved their activities online to reach students in JCs and Polytechnics as part of their club outreach efforts.",
    "It can be hard to choose between different universities, especially if you have multiple offers. Hear from ten of our incoming freshmen on why they chose SMU!",
    "SMU School of Economics PhD student Bian Xueying embarked on a multidisciplinary research in a bid to solve real-world issues.",
    "Besties Jaslyn and Victoria launched #STAYSAFEAHMA to raise funds to give out care packs to elderly citizens who kept the society’s engine running when everyone else was staying safe at home.",
    "Find out how a community service project in Nepal, an internship experience in Thailand, and a university exchange programme in the UK gave Nigel Ng (SMU Accountancy), Lim Jie Ai (SMU Social Sciences) and Wong Jing Ting (SMU Business) new perspectives on global citizenship.",
    "As the President of SMU People for Animal Welfare, Travis Tan is committed to seeing the club through the aftermath of a turbulent 2020.",
    "As President of Eagles Inc., SMU Business student Clarence Ong believes entrepreneurship will one day make the world a better place.",
    "Julia Hee chose a successful career path she never considered back in university. She shares why one should ‘Never Say Never’, especially in a tough job market.",
    "Research scientist Andrew Le Duy Dung’s first encounter with the computer set him on a path to SMU’s PhD in Computer Science.",
    "Undeterred by the initially overwhelming course workload pursuing her Master's, Chou En-Yu discusses the skills, connections, and perspectives she's gained.",
    "Getting the role you really want isn’t always that easy as a fresh graduate, especially when faced with a global financial crisis.",
    "A fresh graduate from SMU Accountancy shares her reflections on graduating in uncertain times and how she stays positive despite the challenges.",
    "Students Su Myat Noe and Li Jiangbo tell us how they adapted to disruptions while living at SMU Prinsep Street Residences when the pandemic hit.",
    "We chat with Aldric Chen about his approach to the job hunt during the 2008 Global Financial Crisis and how far he's come since then.",
    "]While some employees are rejoicing over the benefits of not having to be in the office, will the flexible working arrangement last beyond COVID-19?",
    "In the first interview of the Project Y to Z series, we hear from SMU class of 2008 alumnus Chen Weili, currently a Marketing Manager at Bayer.",
    "It’s not easy juggling a postgraduate programme while being in a new environment far away from your family. But Cassandra Stephanie took all the challenges in her stride.",
    "SMU Accountancy student Janessa Sim and her partners set up an online marketplace selling fan-made Kpop merchandise—KpopKart. They recognised the business opportunity that a global fanbase presented.",
    "Featuring the pioneer SOA Social Media Student Team members in an interview on their journey with SOA since our first social media presence in 2015.",
    "Accountancy graduate Peter Peng started his own cleaning services business which trains its crew to make use of technology effectively in their work.",
    "At SOA Engage, SMU Accountancy alumni, students, faculty and staff came together for a day of community service at the PEACE-Connect Senior Activity Centre.",
    "One of the best things about an overseas exchange? Road trips! In this article, Cheong Sheng shares the top 4 road trips he's made from Massachusetts, USA.",
    "Marvin David De Santos takes us through his SMU-X overseas trip to Manila—a land full of growth and opportunities, yet deeply rooted in its Filipino heritage.",
    "Accountancy student Joel Long and his friends started INSPIRE—a mentoring programme for children from low-income families in the Kebun Bahru community.",
    "From smartphone apps to online resources, here are some useful digital tools you can use to maximise your efficiency and boost productivity.",
    "Ivan Chong was keen to obtain his licence to become an approved liquidator. He knew SMU's Master of Professional Accounting would give him the qualification he needed.",
    "After working for more than a decade in Japan decade in corporate banking and real estate, Yuta took advantage of an APEC Scholarship to study his MBA at SMU.",
    "Ever given a thought to the fruit peel that you throw out after a meal, and its insignificance now that the fruit has been devoured? Not necessarily so.",
    "We last spoke with Ryan Goh before he had joined SMU. One year on, we’ve caught up with the Economics freshman to find out how he's been doing.",
    "Should you pursue a double degree or a second major? What's the difference? Read on to get some clarity on the choice that will work best for you.",
    "Hostel life can be exciting and fun, but it also requires a lot of self-discipline and getting used to communal living. Here are 5 tips to help you thrive.",
    "One year on, we’ve caught up with SMU Information Systems Freshman Lim Wei Xiang to find out how he's been doing this past year.",
    "University is the best time to gain new experiences, make mistakes and come into your own. SMU alumnus Kelvin Fan shares more in this interview.",
    "Though his A-level results far from ideal, Joel Chin didn't let this bring him down. Instead, he chose subjects and teaching styles that worked best for him; leading him into the field of social science.",
    "What dreams did you have at the age of 12? For SMU alumnus Gabriel Tan, that was when he began the road towards realising the dream of starting his own social enterprise.",
    "A fast-paced field where learning never stops—this was exactly the reason that Tan Kee Hock chose to pursue SMU’s BSc (Information Systems) programme.",
    "Don't be overly influenced by what everyone else is chasing; seek your own passions and keep exploring—this was the advice shared by SMU alumnus Brandon Lum",
    "Let our student leaders take you through how their student leadership experiences are shaping them to conquer the challenges of adulthood.",
    "One year on, we’ve caught up with SMU Law Freshman Alicia Li to find out what her experience has been like and how this past year in SMU has impacted her.",
    "In the times of COVID-19, gender gap trends are being crystallised and accelerated. SMU Assistant Professor Aliya Hamid Rao tells us more.",
    "To many health-conscious consumers, finding traditionally high-carb foods that are yet low in their glycaemic index is a dream come true.",
    "One year on, we’ve caught up with the Social Sciences Freshman to find out how this past year in SMU has impacted him and his learning experience.",
    "For the SOA Teambuilding Event 2019, the faculty and staff of SOA spent the morning together at Changi Coast clearing the beach.",
    "Public speaking is an important skill in the workplace, but how does one go from an undergraduate to an effective presenter at his first job?",
    "One year on, we’ve caught up with Fenston Lewitt Founder and Accountancy Freshman Bryan Tay to find out how his first year at SMU has been like so far.",
    "We last spoke with Amanda Lim in 2019, just before she had joined SMU. We caught up with the Business Freshman to find out how she's been doing this past year.",
    "SMU Accountancy graduate Neo Yi Ren juggled his career and professional development shortly after graduation, achieving Top Scorer in the Financial Reporting module.",
    "How can we market well on social media? We sat down with Marketing Science Expert at Facebook, Astha Kalbag, to glean some tips and tricks.",
    "'What do I want to do after graduation?' SMU Career Champions shares 3 questions that can help you find the right career path.",
    "The seemingly disparate passions for reading and finance from a young age paved the way for Associate Professor Fu Fangjian’s journey in academia.",
    "We hear from undergraduate Lee Jin Pin on how volunteering with starringSMU—SMU's largest and longest-running student-led community service project.",
    "Just because the hype has died down, blockchain is most definitely not dead. In fact, a new wave is coming, and it's coming in the form of decentralisation.",
    "With a multitude of ways to hack your way to success, it seems traditional MBA programmes are facing fluctuating applications alongside digital disruptions.",
    "Seeing the growing importance of having basic coding skills in this digital age, Zul and Manfred decided to start Project Heartcode.",
    "Plastic waste has been a widely discussed topic in recent times. But there’s another growing problem that we need to talk about—and that’s e-waste.",
    "Elizabeth Quek shares her experience joining Project Inspirar in her freshman year and how she’s gained much more beyond just clearing community service hours.",
    "Most would assume that humour would have a positive impact in the office when it comes to bonding—but the opposite may in fact be true.",
    "To truly experience a well-rounded university life one needs to step outside of the classroom and go beyond the books. Toshin Sequeira shares some tips.",
    "Spotting the growing trend in social media adoption, Mongchin Yeoh made the leap from sideline blogging gig to full-time social media influencer career.",
    "If you haven't already heard, SMU has enhanced its undergraduate curriculum. To get you started, we've put together 5 must-know changes.",
    "The rapid expansion of digital tech in our daily lives and the commoditisation of data, governments and the legal profession are now scrambling to catch-up.",
    "Four years after completing his bachelor's degree at SMU, Joel Ng decided to return to his alma mater to pursue a Master of IT in Business.",
    "SMU Accountancy graduates have been emerging as Top Scorer for the Financial Reporting Module of the SCAQ Professional Exams for three consecutive cohorts",
    "Armed with his knowledge in data analytics and machine learning Accountancy student Lee Tze Yiing secured an internship with Deloitte France during his exchange.",
    "There’s definitely more to university life than books and lectures. With over 120 student clubs to choose from, we've picked out 5 unique CCAs that just might pique your interest.",
    "The idea of leading an independent and self-defined work life may be alluring, but do would-be giggers really know what they're getting themselves into?",
    "Everyone has the ability to effect positive changes on society if we open our eyes to the reality of social barriers. No one exemplifies this better than Cai Yinzhou.",
    "Through the use of technology, SMU alumni and husband-and-wife team, Jeffrey and Angeline Ong, are changing the way we shop for fish with their startup, Dishthefish.",
    "Seeing is believing. Ryan Ng talks about his winter business study mission to trace the footsteps of top global tech innovators in China.",
    "SMU Economics and Finance double major undergraduate Lim Yee Xien shares more about her experience at SMU.",
    "SMU undergraduate and co-leader of Project Xing Fu 8, Muhammad Zhafri Bin Azman, shares his experiences working to help Rohingya refugees in Malaysia.",
    "Curious to know how getting negative can actually help you decide on the university of your dreams? Let's find out.",
    "We're constantly on the hunt for a personalised experience. But can education be customised too? Here are ways a personalised degree can get you ahead.",
    "In this interview, we speak to SMU Double Degree undergrad Merrill Cheong to find out what his experience at SMU has been like and how he is preparing for his future career plans.",
    "Besides protecting the environment, running a sustainable business is actually a plus for the bottom-line. Here are 4 reasons why it pays to be sustainable.",
    "Choosing a university and just don’t know where to start? Here are some helpful resources to guide you in identifying your choice undergraduate journey.",
    "The SOA Community united once again for SOA Engage 2019. Here's their experience volunteer at Arts Connect@Bendemeer and the Willing Hearts Kitchen.",
    "What’s the real deal about leadership meltdowns and why do they seem to be on the rise? Find out why and four ways to prevent a leadership meltdown.",
    "SMU research group Preferred.AI recently organised TechFest 2019 to share about the projects they are pursuing to advance AI and machine learning.",
    "Lam Hui Yun (BBM 2019) shares with The Mentoring Circle, her experiences of giving back and the many places she's had the chance to travel to with SMU.",
    "There is a powerful CV differentiator on the rise—the master’s in management. Peng Yuan Yuang discusses the doors it's opened for her in the business world.",
    "Extreme climate changes can negatively impact the financial resilience of businesses, argues Dr Artur Hugon from the Arizona State University.",
    "An internship can be a great learning opportunity. And when it's an overseas internship, the experience could be a huge gamechanger.",
    "With the “innovate or die” maxim at the forefront of every business strategy, we’ve put together 4 ways leaders can enable innovation.",
    "Third-year business student Agalia Tan shares her motivations, thoughts and advice on leading the overseas community service Project Hua Tat 2",
    "Finding yourself at a career crossroads can be daunting. But with the right approach, it is possible to make that switch. Here 6 tips to help you get there.",
    "Doing good should be a great thing. But why are some companies keeping silent about their philanthropic efforts? SMU Prof Wang Heli sheds light on this phenomena.",
    "Western brands have been tripping up big time recently in their efforts to market their products to the Chinese. Why is this market proving so tricky?",
    "As big fans of flexibility and haters of rigidity, the Gen Z crowd loves customisation. Find out how SMU is offering more options in this fast-changing economy.",
    "How can one build a credible personal brand and be a true thought leader amidst influencer fatigue? Here are some ideas.",
    "Masahiro Tan, co-founder of The Mentoring Circle, shares about the ups and downs in his life, his experiences in SMU, and building a career in investing.",
    "Vincent shares about finding his golden ticket to a career at Google, attracting passive income, inspiring data juniors, and many more.",
    "With her activist movement, hash.peace, Nazhath Faheema is on a mission to further improve social and racial awareness in our society.",
    "SMU alumnus and co-founder of The Mentoring Circle, Soon Zhengxiang, shares some words of advice on a career in consulting.",
    "New to travelling? Travelling alone for the first time? Travelling long distance? Here are 10 tips to help tide you through the pre-travel anxiety!",
    "When it comes to approaching societal challenges such as climate change, one's socioeconomic status (SES) could lead to vastly different behaviours.",
    "An interior designer with the aspiration of being an entrepreneur, Viona Giovanni Felisiana made the decision to upskill with SMU MSc in Management programme",
    "When Kok Yin heard about SMU's Politics, Law & Economics major back in JC, it seemed like the stars were aligned—even her friends thought the same!",
    "We find out how AI and analytics are set to transform the legal profession, and what the latest SMU-X course on 'Legal Analytics and AI in Law' is all about.",
    "We're moving SMU Open House 2020, entirely online. But it doesn't mean you will be getting a diminished Open House experience this year. Far from it!",
    "SMU undergraduates share with us their experience as regular volunteers at the Harvest Care Centre, and offer tips for students who are new to volunteering.",
    "From the frequent tinkering with gadgets to hacking existing software on his computer, Shreyas' interest in all things tech was piqued very early in life.",
    "SMU alumnus Sri Saravanan Sithiasagaran shares why daunting as it may be, you will reap benefits by taking that leap and stepping out of your comfort zone.",
    "A-level results day is a nerve-racking experience. But don't fret. Keep calm and let our snappy guide tide you over the highs and lows of it all.",
    "Michelle Lim shares her views on the benefits of a seminar-style learning approach and how the SMU has helped her in preparing for a career in accounting.",
    "In this interview, SMU Assoc Prof Hady Lauw shares about the important skills one can learn from coding, even if you they aren't planning a career in programming.",
    "We spoke with Law graduate, Cheng You Duen, about his success at SMU and hope his experience can be both a source of inspiration for aspiring law students.",
    "For today's workforce staying relevant is contingent on learning new skills. Here are four key skills that can help you thrive in the modern workplace.",
    "SMU Law alumnus Nguyen Sinh Vuong’s grandfather taught him that a just legal system is necessary for a prosperous nation. Find out how his SMU experience has helped set him on the path towards playing a part in this.",
    "Don’t let stress run your life. Here are some tips we’ve put together to help you manage your stress levels.",
    "2019 Valedictorian and Accountancy alumnus Eugene Tan gives a lowdown on what his time at SMU has been like, and top tips for undergraduates.",
    "What exactly happens during admissions interviews? What can I do to prepare for it? We asked our faculty and students, and here is what they have revealed.",
    "SMU Accountancy alumna is a two-time Top Scorer at the Singapore Chartered Accountant Qualification Exam! How does she do it? We speak to her to find out.",
    "SMU Accountancy graduate Bryan Halim was posted to Zurich under the Graduate Talent Program at UBS. He tells us about his experience in Zurich.",
    "SMU Assoc Prof Clarence Goh sheds some light on how AI is infiltrating the accounting sector, and why accountants with tech know-how are in high demand.",
    "What really is a business incubator and how do you pick the right one? We speak with veteran technopreneur Shirley Wong to find out more.",
    "Reminiscing on their time in SMU, alumni Chinkita and Amanda decided to pen down five ways their SMU experience has transformed them.",
    "Chuck Ng’s first degree was in chemical engineering, but he knew he wanted a career in finance even before he had graduated.",
    "Catalin Burlacu sets out the main trends that will affect the industry in the next five years: AI and Machine Learning, Conversational Computing and Immersive Technologies.",
    "Ng Pei Lin was keen to deepen her knowledge about data analytics after realising it was playing an increasingly important role in her work.",
    "As what the world eats becomes increasingly globalised, Prof Lily Kong argues that the best way to keep Singaporean food culture alive is to go global.",
    "Retailers are finding it tougher to keep afloat. Experts suggest that investing in innovation and intellectual property is key to retailers’ survival.",
    "Blockchain technology's impact has evolved far beyond cryptocurrencies. One hot area of debate is its impact on the environment.",
    "What are some of the best practices PhD students should keep in mind when preparing for the job search process? SMU PhD graduating students share tips.",
    "Big data isn't something new—it's existed from the very day humans began to make records of their work. So when exactly did consumers come into the picture?",
    "Students often find themselves leaving career planning to the last minute. But SMU undergrad Aaron Lim says an early start to career planning is key.",
    "It isn't always easy taking on the multitude of challenges that university life throws at you. For Lim Zhi Ying, having the support of her parents to keep her afloat through stormy weathers has been the greatest blessing.",
    "SMU Adjunct Faculty Johnson Poh offers some guidelines to help companies transition into a data-ready culture.",
    "First year student Nicholas Fu shares his personal reflection on joining the Kidleidoscope family. And how \"teaching\" his beneficiaries has enriched him.",
    "Singapore may be wealthy, but given its small and highly competitive domestic market, the only way for SMEs to grow is to expand beyond the island’s borders.",
    "At #67 out of 149 countries, the numbers speak for themselves—gender pay gap is a fact in Singapore. But ranking alone doesn't tell the full story.",
    "From delicious meals to working directly with KFC Vietnam, Katrina Inumerable's SMU-X overseas trip to Ho Chi Minh was most certainly Finger Lickin' Good.",
    "If you're in finance and haven't heard of Tan Su Shan yet, you definitely should read up now. We find out from one of Asia's leading women in banking.",
    "Presented with the opportunity for cross-cultural learning in Yogyakarta, Michelle Lie knew this was a SMU-X overseas course she couldn't miss.",
    "Meet David Chen, 35, COO and co-founder of Golden Sunland. When it comes to rice, David is in familiar territory but it is also his calling and passion.",
    "The fintech revolution is gaining momentum and it knows no boundaries. SMU Prof Robert Kauffman gives a peek into upcoming trends and outlook.",
    "To date, only a precious few billion-dollar ‘unicorns’ have emerged in Singapore. What conditions need to change to drive a wave of local startup successes?",
    "John Tan may have begun in sociology, but a switch in discipline has led this Juris Doctor graduate to become one of Singapore's most influential lawyers.",
    "Want a career that has tons of potential? Here are 5 unexpected sectors to be bullish about in 2018 and the roles you can land.",
    "Can we have it all? Security AND convenience? We asked Associate Professor Gao Debin— is cyber security the Achilles heel of the new digital economy?",
    "Companies need to understand what makes their employees happy and what drives their stress if they want to attract and retain today's talent.",
    "We caught up with SMU PhD in Business (Marketing) grads, Lim Leon Gim and Tan Yee Heng, to find out more about their first job placements after their PhDs.",
    "Already a founder of a pretty sustainable startup? Furthering your studies might just provide the know-how you need to take your business to the next level.",
    "For those of you interested in making a career out of freelance work, here are some essential tips on surviving the gig economy.",
    "We speak to SMU alumnus Hayden Leow, to find out how local startup, Amazin’ Graze, is bringing granolas to a whole new level.",
    "Do you get hit with a sense of dread at the thought of participating in class? An introvert herself, SMU undergrad Vandita Attal shares some tips.",
    "Economists have long been concerned about widening inequality between the wealthy and the rest of society. Could the digital age further shift this balance?",
    "Speaking at the recent Odyssey 2019 event, SMU Chairman Mr Ho Kwon Ping shared his views on a new approach to mentoring in SMU.",
    "Despite little experience in the travel industry, SMU alumnus Steve Sng started OWNRIDES in Taiwan. Today, he handles almost S$1M worth of bookings a year.",
    "As times change, universities are starting to place more weight on more than just an applicant's grades. Here are 5 tips to help your application stand out.",
    "The Mentoring Circle sits down to a chat with SMU alumnus Alvin Poh to find out what advice he would give to his 20-year-old self if he had a chance.",
    "For many of us, a spin on the bike is a great way to keep healthy. But for others, it could make the difference between staying in school or dropping out.",
    "Mobile apps have brought so much convenience in our lives. But are we so seduced by the limitless functionalities that we’ve overlooked security & privacy?",
    "Information systems a consideration of Kuok Juin. But a chance discovery at SMU Open House opened his mind to a whole new slate of possibilities.",
    "With rising nationalism, it's more important than ever to look towards building inclusive communities. One way is to embrace the idea of global citizenship.",
    "The role of a second generation business leader is a tricky one, especially when it comes to a family business rich in history and tradition.",
    "SMU Masters alumnus Linh Trinh shares how he ventured out of Vietnam and landed a top job in the Singapore finance sector.",
    "Moving from consultancy to investment banking isn’t easy. Here’s how SMU Masters alumna Kathy Zhou managed to make the change.",
    "The skills you need to survive and thrive in Singapore banking and finance are changing rapidly. Here's how to get your career ready for the future.",
    "Ian Chong knew that having the right Master’s degree would be critical in determining the success of the career switch he was aiming for.",
    "For the busy Uni student, the start of a new semester means schedules swamped with activity after activity. We've put together some tried and tested tips.",
    "The Accounting Study Mission to Israel left an indelible mark on its participants. SMU students Alice, Ron and Benjamin tell us why.",
    "SMU Accountancy alumnus Lai Shanru was named among the Forbes 30 under 30 Asia for 2018 for her achievements as co-founder of the e-commerce startup ShopBack.",
    "The SMU School of Accountancy unveiled two new financial schemes funded by the SOA Student Fund which was launched at SOA Run 2017.",
    "Heard of blu? It currently has one of the largest parcel terminal networks in Singapore and is the brainchild of SMU alumnus Prashant Dadlani.",
    "A strange new environment can sometimes prove overwhelming for the university freshman. Nicole Foo shares how SMU Parents' Day helps overcome the jitters.",
    "Driven by the fear of idleness, Jiali Du decided to pursue her PhD. With newfound knowledge, she's found her niche in AI as a Data Scientist at Booking.com.",
    "Whether you’re a first-year undergraduate or in your final year, it’s never too early to start formulating a plan for repaying your student loan.",
    "All it took was a gap year to get a dream off the ground. SMU Business undergrad Mandy Chan shares how she started BOW for Bold at just 19.",
    "Before heading into your career, take the chance to get out there and celebrate with a short grad trip—one that won't break the bank.",
    "Accountancy student Lim Yong Chuan was inspired to join SMU during his polytechnic days. What was the deciding fact for Yong Chuan join SMU? Find out more.",
    "With sustainability now a core part of global businesses’ day-to-day operations, accountants discovering the need for knowledge and skills in this area.",
    "Finding a conducive space is not always easy. With the help of your SMU seniors, we’ve sussed out the best spots on campus.",
    "You’ve probably heard of specialist programmes. Or even specialist degrees. But what about a specialist university?",
    "Singapore's heavy reliance on imported food is gradually being threatened by global conditions. Masters alumnus David Chen suggests tapping into ag-tech.",
    "Office-appropriate garb doesn’t have to cost an arm and leg, or epitomise drab dressing. Check out these tips on building an affordable professional wardrobe.",
    "When an opportunity came knocking, Jaden Teo made the tough decision to leave a highly sought-after career in management consulting to start edtech Kalpha.",
    "Already an experienced accounting professional, David Djapri decided to pursue the SMU MSc in Accounting in order to build invaluable data analytics skills.",
    "It's not always easy finding good coffee when you need one—not to mention how costly it can be. Facing the same issue herself, Faye Sit created Hook Coffee.",
    "While quantum computing presents the prospect of solving problems previously considered insoluble, it’s also moving at a painfully slow pace. Find out why.",
    "Embarking on an overseas exchange programme? We speak to SMU seniors to find out some of their top tips for maximising your exchange experience.",
    "'Alpha male' managers significantly underperform low-testosterone managers. Want to know why? Professor Melvyn Teo reveals some interesting observations.",
    "You don't always need to be a hardcore techie to work in tech. SMU alumna Clare Lim shares how she found her way into the world of tech at Salesforce.",
    "The growth of the gig economy has seen the creation platforms that can efficiently match people with jobs. But are these platforms also creating a race to the bottom on wages?",
    "Global exposure is an important part of university education. But it doesn't always have to entail travelling across borders.",
    "Can multi-generation talents co-exist in the workplace? SMU alumnus and executive coach Benjamin Loh shares how companies can tackle this complexity.",
    "With the internet of things (IoT) on the rise, what are the top booming areas to watch for in the coming year?",
    "Pornsak’s spontaneous and humorous personality has made him one of the most sought-after hosts and brand ambassadors in Asia. Find out how it all began.",
    "A curious streak that sparked a line of Kindred Teas. SMU alumna Madelene Poon shares how her travels helped inspire the unique flavours of her teas.",
    "Started by SMU students Alexander Lim and Sean Lam, Cudy is an online marketplace for that is revolutionising the private tuition industry.",
    "Investment companies around the world are pitching ‘robo-advisors’ to clients, but how much of your trust—and savings—should you put on an algorithm?",
    "4 signs that prove you've made the transition from student to a full-fledged grown-up. And if you're not doing them yet, it’s time to up your adulting game!",
    "A study has shown that fake news that spreads faster than a true story. So, is fake news really killing quality journalism?",
    "Three weeks, three cities, two cultures. SMU undergrad and Samba Masala member, Perry Teo, shares his many firsts performing on the global stage.",
    "Crowdfunding has provided an invaluable platform for connecting social causes to donors. But how can they be protected from fraud? Enter, AdvocAid.",
    "Being told his \"soft\" background in psychology would never get him a job in an analytical position was all the push Kian Boon Ng needed to prove them wrong.",
    "Whether you're aware of it or not, chances are you’ve been chatting to robots of late. Will the future see chatbots replacing all human communication?",
    "Inspired to build an organisation that reflect their family values, owners of family businesses today are leading proponents of social entrepreneurship.",
    "SMU Accountancy Graduates Seah Yi Ru and Ng Si Jia emerge Top Scorers of their modules at the SCAQ Exams a year after graduating.",
    "Mandeep Sedha from Credit Suisse didn’t have to wait long to see the benefits of her Singapore Management University MBA.",
    "Watch these 10 thought-provoking films of trailblazing \"outsiders\" who expose the challenging barriers of unfamiliar yet desired social worlds.",
    "Technology is putting traditional finance jobs in Singapore at risk. Here's how to stay employed thrive in the new accountancy environment.",
    "Becoming a global citizen takes more than learning the local language. Here are 4 areas to be mindful of while trying to be a citizen of the world.",
    "An internship at The Artground was an eye-opening experience for SMU alumna Jesslyn Lim. She gives her opinion on what it'll take to grow the arts in Singapore.",
    "I Did a Global EMBA in the Heart of Singapore. It’s Taken My Finance Career to New Levels",
    "Industry 4.0 may be the consequence of rapid advances in AI and machine learning, but don't be too quick to rule out the need for human skills.",
    "In our highly interconnected and fast-changing world, we can't afford not being global-minded anymore. Here are four ways to help you become true global citizens.",
    "SMU may not have been her top university choice at the start, but a surprising turn of events changed SMU Economics freshman Karista Khoo's perspective.",
    "SMU undergraduate Carissa Lim shares 5 insights about art management that she's learnt from her interviews with four Singapore arts managers.",
    "SMU Business freshman Muhammad Haris Lim had other offers even before he completed poly. But, he felt compelled to give SMU a try as well and has never looked back.",
    "Senior Lecturer Rosie Ching and her statistics 101 class have confronted the topic of death head-on to create Singapore's first End-of-Life Index.",
    "Tracking a smartphone's location can unlock a world of deep data on human behaviour. Assoc Prof Rajesh Balan, tells us how SMU LiveLabs is doing this.",
    "SMU Associate Professor Mark Chong explains why brands should look a transitioning from storytelling to story-making in the digital age.",
    "Sustainable living has just gotten easier, thanks to the efforts of SMU alumna Joline Tang and her eco-friendly business, The Sustainability Project.",
    "You can't fully learn about a country until you've seen it for yourself. For Muhammad Razeef, an exchange to India has since changed his perception of the country.",
    "SMU alumna and Google Women Techmakers scholar Chinkita Chugh shares her observations as a female in a traditionally male dominant tech industry.",
    "A 'mentor' may help guide you through your career with good advice, but a true high flyer knows to lean on a 'sponsor'. Find out more on the SMU Blog.",
    "13 alumni from the SMU Myanmar Alumni Chapter become students again for a week, as they embark on the inaugural Alumni Study Mission to Jakarta, Indonesia.",
    "Silently creeping its way all across the web—the work of bots is never-ending. They may be highly intelligent, but are they friend or foe?",
    "With there still being roadblocks aplenty, SMU Assoc Prof Pradeep Varakantham discusses how AI can help Singapore reach its full bike-sharing potential.",
    "It's hard to ignore the importance of an online identity, especially when it comes to building one's network. We find out from experts some dos and don'ts.",
    "Ever walked away from a dance performance not knowing what to feel? Natalie Khoo shares her perspectives on what more can be done to engage audiences.",
    "Charmian Yeo did an undergraduate degree in chemistry, but the SMU Master of Professional Accounting alumna is now an auditor at Ernst & Young in Singapore.",
    "SMU alumnus Desmond Lim's first startup was a Thai restaurant. With little capital on hand, he came up with creative ideas to bootstrap and start the business.",
    "Banks have been slow in harnessing disruption. So how can banks find its footing to co-exist with fintech, and what is this second wave called \"TechFin\"?",
    "Singapore, today, still trails behind the likes of China when it comes to the adoption of e-payments. What will it take for Singapore to go cashless?",
    "When presented with the opportunity to take on SMU's MSc in Wealth Management programme, Jay See leapt at the chance without hesitation. Find out why.",
    "While qualifications and experience are highly valued, having a vast network drastically tips the scale in your favour. Here are some quick tips.",
    "While graduate starting salaries may be at an all-time high, don't expect it to always be a given. And neither should it be the only factor when evaluating your career.",
    "SMU alumni Ghislaine Wong and James Ng were posted to the Deloitte Myanmar office in 2017. They share their experiences here.",
    "Analytics is changing the face of HR, and People Analytics is right at the heart of it. Data scientist and SMU alumnus Ridwan Ismeer explains its impact.",
    "Having your research papers selected for publications is not an easy feat. SMU PhD student Tony Li shares insights on getting papers published.",
    "Embrace AI, says SMU alumnus Spencer Yang. He shares about chatbot design firm, KeyReply, which he's co-founded with fellow alumni Carylyne Chan and Max Xu.",
    "SMU Accountancy graduate Marcus Ng believes in perseverance as the key to overcoming all challenges to eventually achieve success.",
    "Dr Suiunbek Ibraev delves deeper into the Ethereum platform and its digital currency, Ether—second largest cryptocurrency after Bitcoin.",
    "SMU undergrad Tan Xin Hao finds himself presented with the opportunity to hear from Barack Obama himself during his internship at Bank of Singapore.",
    "Is Singapore really a boring place? Not if The Fun Empire co-founders Natasha Toh and Ryan Ho have anything to say about it!",
    "To overcome FOMO, Nurin Nazifa shares her five handy “rules” that helps her stay connected and centred, and re-examines our relationship with social media.",
    "Keeping the business in the family and family in the business. Will this breath new life into businesses, or risk of intergenerational tension?",
    "For many, the zero-waste movement may seem unattainable and complicated. Sheryl Lee shares six simple swaps to help you get started.",
    "Naomi Lim takes us back to her experience as a freshman at SMU Parents' Day 2017 and why she decided to become an SMU Ambassador.",
    "In an interview with Bondlinc co-founder EK Ong, he explains how fintech will ultimately play a big role in making banks more efficient.",
    "While most acknowledge that 'fake news' regulation is needed, some worry of it impeding on free speech. Assoc Prof of Law Goh Yihan has a different thought.",
    "Spurred by the difficulties faced during his own experience studying abroad, SMU alumnus Melvin Lee decided to set up Flying Chalks.",
    "SMU MSc in Management students Victor Tan and Ashita Gogia, as well as Senior Lecturer Karen Gan score big at IMMA Morningstar Global Case Challenge.",
    "Technology is taking over practically everything, including the humble pen. But did you know writing could do more for your brain than typing on a keyboard?",
    "SMU Accountancy student Yan Lun decided to join the sports scene in France while on exchange, and ended up playing competitively for two sports that season.",
    "Law student Nicole Leong shares an eye-opening experience taking on the Singapore Convention on Mediation treaty, during her SMU-X course.",
    "Samantha's underlying curiosity to learn more about the synergistic effects in our societies was what finally led her to choose a path in social sciences.",
    "Have you ever thought about crowdsourced advertising? Combine that with transit advertising and you have Carblicity. Founder Endru Chen shares more.",
    "Realising the value behind having a mentor in university, SMU alumnus Hafiz Kasman was determined to establish a mentorship initiative to help his juniors.",
    "After working for PwC in Singapore for 6 years, Fony Njauw was keen to upskill. Here's how she came to choose SMU's Master of Professional Accounting.",
    "After 2 years serving NS, having to adjust to a brand new school environment can be quite a daunting task. Stanley Low shares tips on how he coped.",
    "The life of a law student is often an uphill climb, but it doesn't have to be the only thing that consumes your day and night.",
    "Retail payment processing has, traditionally, been dominated by end-of-day batch processing, This is changing with real-time payments fast becoming ubiquitous.",
    "The Mentoring Circle invites SMU Alumni Jimmy Soh and Jackson Kwa, and Assoc Prof Paul Griffin to talk about adapting to an ever-changing tech world.",
    "ASM Japan opened the eyes of our students to the business operations in Tokyo. They share their reflections here.",
    "Our Master of Science in Management students share their experience during the prestigious European case competition, and the important lessons learnt.",
    "Paypal is undoubtedly the pioneer in online payments. With 600 payments per sec, its key success factor is obvious: Data – an astonishing magnitude of it.",
    "Making a difference is neither a one-off affair nor is it just clocking community service hours. Faith Woon reflects on her 9-month SMU Challenge project.",
    "Online sources are often the fastest and easiest go-to channel for research. But how do you separate fact from fiction to make sure your reports are legit?",
    "SMU Arts Festival is back, BIGGER and BETTER! With over 2 weeks of constant activities, here's our 5-point guide on highlights you can't afford to miss.",
    "Just because you prefer to be an observer rather than the centre of attention, doesn’t mean that life in a city campus has to be a struggle.",
    "There's a growing fear that our future is under assault from the machines. But is that really so? Korn Ferry Institute's research tells a different story.",
    "Don’t fret if the job hunt is tougher than expected, because you’re not alone. Instead, try these tips on getting ahead of the competition.",
    "Blockchain and AI may both be hot topics right now, but that's where similarities end. What happens when the two meet? Will we see convergence or collision?",
    "Founded by a team of three SMU graduates, OneThreeOneFour is not quite your conventional wedding photography service. Here's how this all SMU team came to be.",
    "These SMU information systems final year undergrads are making their move to disrupt the healthcare sector, and they're doing it one Stepwise at a time.",
    "SMU undergrad Eugene Tan shares his experience as the first Singaporean selected to attend the Institute of Management Accountants Student Experience Programme.",
    "Real estate investment and finance are two of the hottest sectors at the moment. Here's how you can get a foot in the door of this lucrative market.",
    "The best thing about a city campus is its awesome dining spots. From simple, hearty meals to trendy, instaworthy munchies, you'll be spoilt for choice!",
    "The corporate world is often the next step for most after graduation. But a traditional career isn't for everyone. Is there a future chasing your passion?",
    "Co-founder of the LUPPI mobile app and SMU alumnus, Matthew Luo, tells us how the app's hail-for-service structure is making the process more efficient.",
    "Give a man a fish and you feed him for a day. Teach a man to fish and you feed him for a lifetime. This is the foundation upon which Project Namaste was built.",
    "Professional services, such as accountancy, are likely to be profoundly disrupted. It's time for accountants to stop seeing themselves as just \"the numbers person\".",
    "Technological change is making the personal finance landscape ever more complicated and increasing the importance of financial literacy for young adults.",
    "An internship is one of the best ways to get your foot in the door of your dream company. Here's how you can turn your internship into a full-time job.",
    "'Time' is always on your side – if you know how to play it to your advantage. Here's how to really maximise the hours spent cramming.",
    "The make or break factor of ASEAN, 50 years on, lies in leadership. How can ASEAN hold up against new and old challenges?",
    "Creators are taking to crowdfunding platforms to help turn their ideas into a real business. But are crowds better at identifying what is truly innovative?",
    "Can you remember the last time you picked up a book? Here are five recommended #BuySingLit books to broaden your literary horizons.",
    "Quick meals, junk food and the lack of a fitness regime – a day in the life of a university student. Don't let the flab get the upper hand with these tips.",
    "A viable and sustainable social enterprise takes more than just a great idea. To do that, entrepreneurs need to 'go to the ground'.",
    "Finally ready to consider something different? Don't go in blind. Prep yourself with the foundation and necessary skills for your new career.",
    "Deciding which city offers the best in higher education? This enviable list of traits is reason enough to put Singapore at the top of your list!",
    "Do millennials read anything over 140 characters? Kirpal Singh discusses why holding a book in our hands is distinctively more intimate than a Kindle.",
    "HR's function may primarily be in dealing with people, but that is no excuse to lag behind in the technological revolution.",
    "Overwhelmed by an endless list of course options? These tips will guide you when the time comes to choose your university modules and tackle the BOSS.",
    "With the world's economy in a state of constant flux, here are a few skills you should have to keep ahead of the curve in our unpredictable job market.",
    "If you want to know what freshman year holds for you, there's no one better to ask than student ambassador Sandra Tan who has just completed her first year.",
    "Fake news, alternative facts – with social media as a catalyst, how do we begin to distinguish between quality journalism and fake news?",
    "Starting freshman year can be both exciting and scary. Don't fret! Here’re some freshie events that will help you start SMU life on a high!",
    "Here's why it's time to get serious about change and sustainability. More from the SMU Tri-sector Forum 2017.",
    "Social entrepreneurship pioneer, Bill Drayton, shares why millennials and companies need to become drivers of change or be prepared to be left behind.",
    "Social media, much like clinching the right job, is about connecting with the right people. Here's how it can give your job hunt a major boost.",
    "SMU PhD students were in for a treat over a special lunch with SMU President Prof Arnoud De Meyer where he shared about his role, the triumphs and struggles",
    "Schaffen Watches is a successful start-up which sells customised watches globally. To better understand its success, we interviewed co-founder Nicholas Han.",
    "Concerns of xenophobia are not unheard of in multicultural Singapore. SMU Law undergrad Farahna Alam sheds light on her minority group—Singaporean Bengalis.",
    "Following a trip to Europe which opened his eyes to tackling food waste, Nicholas and fellow SMU alumnus Tylor decided to set things in motion with TreeDots",
    "SMU undergrads team up with the Ministry of Foreign Affairs to find new and innovative solutions to improve the safety of Singaporeans overseas.",
    "How do ‘great’ workplaces manage an almost impossible equilibrium of keeping satisfaction and motivation up, without sacrificing performance?",
    "Europe is perennial a favourite when it comes to student exchanges. But for undergrad Yuveen Suresh, he chose the road less travelled at exotic Peru.",
    "800k tonnes of plastic waste with only a fraction recycled—SMU Assoc Prof Hannah Chang suggests that a simple nudge could see significant behavioural shift.",
    "The spirit of volunteerism is more evident than ever. One such individual is SMU Law undergrad Susanna Yim. She shares her experience with pro bono work.",
    "How can you find a balance between maintaining a stellar GPA score and participating in a CCA you love? We spoke to a couple of student leaders to get tips.",
    "The need for specialists to envision and build future cities is real. Here's how SMU's Smart-City Management & Technology major is preparing grads for the future.",
    "Happiness at work isn't just determined by the salary package. What can universities and organisations do to help graduates find fulfilment in their career?",
    "Vanessa Paranjothy isn't afraid to use her product as a conversation starter—to have people talking not just periods, but women and their bodies.",
    "With over 400 scholarships, bursaries and financial aid available at SMU, which is the right one for you?",
    "What's up this Friyay? How about some exciting entertainment in the City at our annual SMU Patron's Day bash. Everyone's invited!",
    "Sarah Goh introduces us to her Arts and Culture Management Study Mission and the cities of Venice, Italy and Kassel, Germany.",
    "From the arts to politics, law and economics, Chelsea's transition may seem surprising, but this freshman says the decision was as natural as could be.",
    "Participating in moots may be laborious, but the skills acquired is what will give Law graduates that distinctive edge.",
    "Here's how the SHINESeniors Project is looking towards silver-tech to make ageing-in-place an achievable reality in Singapore.",
    "In today's world, multidisciplinary learning is no longer just a nice-to-have, but a MUST-HAVE. So, what is SMU doing to keep our students future-ready?",
    "With Black Friday and 11.11, online shopping has definitely hit many highs. But accessibility comes with a price. Are there safeguards for online consumers?",
    "While you're taking a breather from the books, why not pursue a different type of knowledge with these 5 must-watch Ted Talks.",
    "With millennials being the largest generation in workforces, it pays for companies to lead the pack in attracting young workers.",
    "Feeling a tinge of wanderlust but not sure where to head to on short-notice? Check out these tips for planning last minute vacays without the hefty costs.",
    "Being ultra-prepared for a job interview is the first step to wowing prospective new bosses. But what do you do when you're asked these quirky questions?",
    "Asia isn't quite the hottest home to innovations these days—and it seems that culture might be related to this, says SMU Assoc Prof Roy Chua.",
    "Feeling the heat of juggling multiple activities and looming deadlines? Here are some tips to avoid letting the anxiety become unmanageable.",
    "Will international pressures on Aung San Suu Kyi and Myanmar further aggravate the highly complex and delicate Rohingya Crisis?",
    "Did you read the fine print before ticking \"I AGREE\"? Even if you did, Dr Guido Noto La Diega says you'd probably need a PhD to understand all of it.",
    "Time to whip out your student cards for some awesome perks that you probably never knew existed!",
    "Would you rather be memorising case studies from a textbook or stepping out and learning through real-world opportunities?",
    "The world is shrinking. In today's hyper-connected global village, having some form of global experience can be beneficial in every aspect of our lives.",
    "Fresh out of JC, Carissa Chen still hadn't a clue which university she wanted to apply for. This all changed after making a trip to SMU's open house.",
    "New environment, new learning style—it's quite a lot to take in at one go, much less having to juggle a double degree and scholarship requirements as well.",
    "Industries in Singapore are being disrupted by technology and digitalisation, but coming together is key to overcoming the changing landscapes.",
    "Before you freak out over your next speech or presentation, here are 5 reasons to calm yourself down and bring out the star speaker in you.",
    "Want to personalise your Master of Business Administration (MBA) experience? Dr Ang Ser Keng, SMU’s Academic Director of MBA programmes, tells you how.",
    "When an overseas opportunity presents itself during his internship at F&N, SMU Business undergrad Seet Joon Hau, he grabbed it without hesitation.",
    "Don't underestimate the power of a great presentation, whether you’re discussing a case study in class or a business plan at work.",
    "It was a tough choice but after weighing a number of factors SMU freshman Eddie Leow finally made the switch to SMU's BSc (Information Systems).",
    "Break the cycle of stress and make life that much easier with smart hacks to get you through the academic year and beyond.",
    "Channel your inner entrepreneur with cool gigs that can all be started right in your very own bedroom.",
    "China’s dramatic economic growth over the past two decades has often been sorely misunderstood. Dr Jin Keyu unravels its paradoxes.",
    "Whether your a student or just starting out your career, our 4 top-pick apps are sure to give your productivity a much needed boost.",
    "New school, new squad and a totally new academic programme. Here’s a handy guide to navigating this new chapter of your life – the Freshman year.",
    "Here’re the best ways to live it up in a city college, without busting your budget.",
    "SMU alumnus Aaron Er and undergrad Wilson Teo show you how financial literacy can be fun and 'games' to gain financial independence.",
    "Simply studying hard isn't going to get you that perfect GPA. Here are some simple but effective brain hacks to study SMARTER (not harder).",
    "SMU students immersed in the commercial and cultural environment in Hong Kong, and gained insights into HK companies during their Accounting Study Mission.",
    "SMU Business undergrad Leow Hui Min shares her Project Triveria III community service trip to Hue, Vietnam, and her unexpected journey of self-discovery.",
    "Whether you’re on LinkedIn to build contacts and network, or simply keeping a lookout for career possibilities, here are some unwritten rules to observe.",
    "The chance to represent SMU at the Harvard College in Asia Programme 2017 was a one in a million experience for Social Sciences undergrad Charlotte Kwang.",
    "Caught between his interest in two undergrad programme offers, SMU Business freshman Norman Tay had a tough decision to make. Here's what led him to SMU.",
    "Want to take on a part-time postgraduate degree and keep your full-time job? It's definitely not an impossible task. Here are some tips to help you cope.",
    "With the education sector's growing inclination towards participatory and seminar-style learning, will introverted personalities be left behind?",
    "Xavier Lur is not quite your typical influencer. Avoiding promotional posts as much as possible, this digital ninja prefers to keep things authentic.",
    "SMU Law freshman Lydia Tan shares her journey from choosing a university, tackling the dreaded admissions interview, to facing the reality of freshman year.",
    "SMU alumna Shereen Aziz-Williams' tireless efforts in tackling social division in the UK is an important lesson in conviction and empathy for all.",
    "Is playing video games really bad for you? SMU PhD student, Andree Hartanto's study into this topic is just the start of his research journey.",
    "A melting pot of the arts, dining, shopping and start-ups, the Big Apple was no doubt a huge eye-opener for Cheyenne on her BSM NY trip.",
    "An overseas exchange to Japan is not quite complete if you don't experience living like a local. SMU undergrad, Leonard Neo, shares his experience with us.",
    "Legal studies just got a makeover, thanks to the innovative teaching approaches of Assoc Prof Goh Yihan—the youngest dean to head SMU School of Law.",
    "We find out from SMU Provost Prof Lily Kong and economics undergrad Ng Kok Yin what makes SMU's new Politics, Law and Economics major so attractive.",
    "Is “smart” really better? SMU Prof Tan Hwee Pink cautions that while we enjoy the benefits of IoT, potential threats and issues shouldn't be overlooked.",
    "Have you met Bus Uncle yet? SMU alumnus Abhilash Murthy shares more about this truly Singaporean chatbot innovation.",
    "Most students get an adrenaline rush just before the crucial finals. But SMU EYE Investment Club's Jun Wei gets his from taking strategic currency punts.",
    "Business undergraduate Asnawi Jufrie shares his experience at SMU and tips on how to make your university experience count.",
    "Think an economics major could only be an economist? It’s time to relook this hot degree, coveted by plenty of forward-thinking employers.",
    "SMU PhD in Information Systems alumnus, Dr Payas Gupta, talks about his award-winning research on Phoneypot and his journey to becoming a data scientist.",
    "Running a successful e-commerce business can be a gruelling journey, as SMU alumnus and CEO of fashion start-up Refash, Aloysius Sng, reveals.",
    "It's never too early to start with plenty of opportunities for learning how to be a real influencer (not just in the context of social media) here at SMU.",
    "SMU alumna, marketer and Starlight Alchemy acroyoga performer at Singapore Night Festival, Sophia Guan, explains how living your dream can be a reality.",
    "Our loved ones are often generous with advice when we enter the workforce for the first time. But you might want to take them with a pinch of salt.",
    "Having been by his daughter's side through an intense first year at SMU, what advice would Irina Sia’s father give to parents of incoming freshmen?",
    "Cheng Xinhui is a recent graduate of SMU Master of Professional Accounting. She shares her experiences and the opportunities that has opened up for her.",
    "What does it take to develop a winning campaign? Team #LetsTechFinlandForward from the SMU MSc in Communication Management programme reveals more.",
    "If employers only take 6 seconds to look through each person’s CV, how can you capture their attention long enough to get one foot through the door?",
    "Jiang Liang’s PhD journey was not without hurdles but with his determination to learn from the best, his academic dream is already within reach.",
    "While an early start to entrepreneurship is beneficial, you don’t have to forgo your studies to make it in business, especially with SMU!",
    "Spot an SMU grad from a mile away! No matter the industry, an SMU grad is definitely one to look out for. But how can you tell? Here are 5 signs.",
    "When it comes to choosing a university, SMU Accountancy freshman Mavis Seah says the school environment makes all the difference.",
    "Whatever your life's goals are, it's not always easy getting there alone. Even the world's most successful people have had help from the right mentor.",
    "The reality of the global water shortage may not have hit us yet, but this law undergrad has already been fighting the good fight for over half a decade.",
    "Saying 2017 has been an eventful year might be an understatement. But it's all a thing of the past, so let's look forward to great things to come in 2018!",
    "Actions speak louder than words. Be it an interview or presentation, engaging your audience takes more than a well-written script. Check out these tips.",
    "Multidisciplinary today's economy buzzword. To get ahead, a diverse range of complementary skillsets is becoming more a necessity than just a good to have.",
    "With Singapore's edge lying in its insights and knowledge into ASEAN, it need not fear China’s Belt and Road Initiative, says the SMU China Forum 2017.",
    "Machines are already making decisions which can sometimes be discriminatory and infringe upon fundamental rights. How should the law respond?",
    "We all seek that elusive balance in our lives between work and rest. Here are 5 tips on how to unplug and reclaim your life to succeed and thrive.",
    "A quick Google search on \"Singapore\" and Seo Kyung Pyo's bags were packed for Singapore. impulsive, perhaps. But he says it was the best decision he's made.",
    "Thinking critically; creating innovative solutions; passion for research—if you’ve checked all three, a PhD would be would be just right up your alley.",
    "If you've only got 60 seconds, how would you describe what is it like studying in Singapore and SMU? Hear it from business undergrads Akshay, Ngoc & Jiwon.",
    "Heard all that there is to do on our sunny island? Trust us, if these 10 things aren’t on your list, it wouldn’t be the true Singapore experience yet.",
    "SMU accountancy alumnus, Benjamin Loh, was not your straight A student. However, he shares why getting that first C- was the best thing that ever happened.",
    "Global exposure experienced locally? It's definitely possible in the SMU Global Summer Programme as fourth year business undergraduate Darren Yuen shares.",
    "If you think that debate is an intense sport, you’re not wrong. SMU freshman, Emerlyn Ng, takes us to the deep end of what it is like to be a debater.",
    "How can we find our own mind space amidst the daily mad rush? SMU Professor Jochen Reb shares more about the Mindfulness initiative.",
    "It's time to take hold of the conversation and change it from what you can’t to what you can do. As Sheryl Sandberg says, we need more women at the table.",
    "Find out how SMU alumna, Siddika Jaffer's 'Halal Dining Club' start-up is set to be the bridge for Halal establishments across the globe!",
    "A good cover letter is key to helping your job application stand out...IF you tell a good story. Here's how you can weave a killer story starring 'you'.",
    "Can Singapore claim back its top 10 most entrepreneurial countries ranking? We put the question to SMU Prof Arcot Desai Narasimhalu.",
    "School’s out, but that doesn’t mean you should engage in 24/7 play and zero productivity. Here are activities to boost your academics and career.",
    "Take time to explore your interests and lock down a major that just might lead to a lucrative career.",
    "Did you know that a timely, thoughtful follow-up will make all the difference for your job hunt? Here are some interview follow-up tips to up your 'A' game.",
    "It’s never too late to score a stellar last-minute summer internship, or at least a stint that will provide valuable work experience.",
    "And for anyone reading this, thinking about taking the plunge to follow a personal passion, Quanda says there’s no better time than now.",
    "Coming up with a business idea is not that toughest part – building up and maintaining a business is. Do you have what it takes to be an entrepreneur?",
    "SMU business alumnus, Lee Yan Gen, shares how SMU's financial assistance schemes enabled him to live the full SMU experience.",
    "With the world quickly moving into an era with high demands for adaptability, SMU's School of Economics stood out as the programme of choice for Yash.",
    "SMU's information Systems programme may not be the easiest, but Derrick shares tips on how to manage your first year—both academically and socially.",
    "Maksim Tkachenko’s move to Singapore was quite unexpected. Four years on, this Russian SMU PhD student is now well on the way to settling in like a local.",
    "SMU undergraduate, Asnawi Jufrie, shares his top five takeaways of meaningful lessons, experiences and friendships at SMU Lee Kong Chian School of Business.",
    "SMU accountancy alumna, Grace Lim, learns that every \"failure\" is really a learning experience that paves the way to small successes.",
    "It’s that time of the year—choosing that dream university to attend! Here are some awesome reasons that you'll need to see for yourself at Open House 2017.",
    "It's exciting times those in financial services who have embraced technology. So, what is the next big catch and how are banks future-proofing?",
    "It hasn't always been rosy for Sarah, especially after experiencing a slipped disc. But things have a way of righting itself with friends by your side.",
    "Putting thoughts of the usual career pursuit aside, Leon Gim took the leap to pursue her PhD. Four years on and absolutely no regrets, she says!",
    "How do you get that golden ticket into your dream university? While there are no guarantees, here are 5 tips to help give your application the added oomph.",
    "We speak to fintech start-up incubator, LATTICE80, and SMU Prof Paul Griffin on what lies ahead in Singapore's evolution to becoming a global fintech hub.",
    "SMU undergraduate Farah Natalya speaks about her experience within her programme and what she's planning to do with her professional future.",
    "While ASEAN seems set to become the world’s fourth-largest economy by 2050, one inherent implication on the future lies in the area of labour skills gap.",
    "Innovation welcomes creative chaos. But what does this mean for Singapore – a country whose success has been built on an efficient, rules-based system?",
    "Senior Credit Suisse banker Mary Ann Gabriel already works with some of Asia’s wealthiest entrepreneurs. So why did she decide to start an EMBA?",
    "Keeve Tan was already enjoying considerable success in Asian banking. But he wanted to ensure his skills stayed relevant for a long-term career.",
    "With SMU located right in the heart of the city, where exactly do our SMU PhD students live?Let our PhD students give you a tour around their neighbourhood.",
    "SMU information systems undergraduates and innovative social solutions. Here's what they are doing for the visually impaired and dementia patients.",
    "SMU Law undergraduate Grace Goh shares three things that SMU Law has taught her thus far on this adventure of higher education.",
    "SMU15 - a retrospective of memorable moments and events held in celebration of SMU’s 15th Anniversary and Singapore’s Golden Jubilee.",
    "The Technopreneurship Study Mission allows students to understand the entrepreneurship landscape of many successful start-ups and companies.",
    "SMU’s Dato’ Kho Hui Meng Career Centre has supported generations of SMU students. Here's how it helped MBA student Ariel with her internship interviews.",
    "Current full-time SMU MBA student Jung-Yoon Kim reflects on the MBA modules that have left the deepest impression on him thus far.",
    "What's it like to go on an overseas exchange programme to a country where you don't speak the local language?",
    "The inaugural SMU Global Summer Programme provided an eye-opening experience for Ana Teresa Rodríguez from ITAM School of Business in Mexico City. Find out more.",
    "University life can be stressful at times. At SMU, our Peer Helpers provide a listening ear and emotional support for their peers during times of need.",
    "In this series of blog posts, current SMU MBA student Jung-Yoon Kim aka KJ shares his insights into his MBA journey.",
    "How does one transform into a Different U? Find out more from the experiences of Wayne Kang, a member of the SMU Ambassadorial Corps.",
    "The Special Interest and Community Service Sodality helped the SMU community show our appreciation to our janitors, technicians and security guards.",
    "Don't just study; study SMART! Here are 10 productivity hacks and tricks to help you with SMUgging for your finals.",
    "From being a social entrepreneur to being a link between industry and academia, student-preneur Tiziana Tan is the ultimate multi-hyphenate millennial.",
    "Being an introvert doesn't mean you'll miss out on student life. It's all about taking the plunge to step out of your comfort zone when the time is right.",
    "The Fourth Industrial Revolution is creating a disruption unlike any other we've seen before. But what does this mean for the future jobs market?",
    "SMU sophomore, Rachel Tan of the Lion Befrienders Programme shares with us how there is indeed a child in everyone, silver tresses or not.",
    "Heard about Patron's Day 2017, but still confused about what it's all about? The Blue and Gold team gives us a run down of what, when, where, why and how!",
    "Three years on with her volunteer work at Project Sukacita. How have perspectives changed for SMU undergraduate Jessica Chandra?",
    "Interested in a PhD? Getting your application accepted. We’ve got you covered with tips straight from the people behind these PhD programmes.",
    "The university learning journey is more than just lectures and textbooks. Take a look at the SMU 360 experience both inside and outside of the classroom.",
    "LKCSP Scholars learn about the brutal reality of the shark fishing industry in Lombok and about these deeply misunderstood 'predators' of the sea.",
    "SMU PhD Business student Samantha Sim gives her uncensored views on what it takes to do a PhD in these 5 quick questions.",
    "Here are 20 things you should know about university life that would definitely make your Freshman year and beyond so much more awesome.",
    "Prof Thomas Menkhoff explains how seizing opportunities for innovation management education will be instrumental in making organisations more profitable.",
    "SMU law students were unstoppable at the 2016 ICC moot court competition. Angus Koh takes us behind-the-scenes on their journey to 'Making History'.",
    "Our student Ambassadors dedicate this blog article to the most important people in their lives—their parents. Here are their raw and heartfelt messages.",
    "SMU Arts Festival 2016 will challenge the boundaries of traditional art forms with the unconventional! Jolyn Seet gives an exclusive into what's FRESH!",
    "The students from SMU’s MSc in Innovation (MI) programme, who won second prize at the 2016 Asia Venture Challenge, share their entrepreneurial journey.",
    "We've just welcomed a new batch of SMU PhD students. We caught up with them to see what their first glimpse of the SMU experience was like.",
    "The final installment of your freshmen experience is our annual mega CCA fair, VIVACE, where you just might go crazy and shout \"Gotta Catch 'Em All!\"",
    "Find out how Economics student Desiree Yang's empathy for those in need spurred her to start up Saltsteps, Singapore’s first social supermarket.",
    "Power couples in the same MBA programme are few and far between; but what’s more stunning is when both emerge top students one after the other.",
    "Here are just some of the benefits global exposure can bring in the long run—especially when it comes to giving you a headstart in your career.",
    "Two Nepalese Brothers and a Singaporean come together to bring to you a new way of 'travelling for good' with their social enterprise, Backstreet Academy.",
    "Junior College and Polytechnic students open their eyes to accounting at the SMU-EY Accounting Immersion Programme.",
    "Participants of the Accounting Study Mission to Manila spent 8 days on a unique itinerary of company visits, cultural experiences and community service.",
    "Cultural appropriation is a hot topic that constantly finds itself in the spotlight. But could this be a topic that has been blow out of proportion?",
    "When it comes to choosing a university, location matters too. Here are 10 reasons a city campus may be the best thing ever.",
    "Find out what inspired SMU alumnus, Shahril, to start a social enterprise that sheds light on Singapore’s social issues and instigates change.",
    "With so many people pursuing a university education, what value is there to getting one these days? SMU undergraduate Joachim Fong, shares his opinion.",
    "The myriad of global exposure opportunities at SMU was a big factor for Ngoc in her university selection. Here's what her learning journey has been like.",
    "SMU SIS undergraduate Jackson Kwa's start-up, TechSociety, is empowering children with critical tech survival skills.",
    "SMU MBA graduate Anshuman Chaturvedi looks back fondly at the reasons that have led him to pursue an unforgettable SMU MBA journey.",
    "Now that you've graduated, should you consider a PhD? Embarking on a PhD is a BIG decision. So here are a few things you'd want to find out before investing your time in it.",
    "Crowdfunding has been lauded as the next big thing. In fact, MoolahSense's CEO says it's an innovation that can fill the funding gap for SMEs and start-ups.",
    "Find out why Fundnel's founding team of finance sleuths, data analysts and creative folk left their banking and consulting jobs to invest efforts in this start-up.",
    "From broadcasting giant KBS to innovative tech start-up Memebox, Mandes Sim talk about riding the K-wave on their Technopreneurship Study Mission South Korea 2016.",
    "From helping start-ups find the ideal location to spotting potential terrorist attacks in Singapore, SMU SIS students find innovative uses of geospatial analytics.",
    "Meet SMU alumnus Spencer Li: a professional trader, coach and founder of Synapse Trading, who became ‘financially free’ by the age of 27. How did he do it?",
    "Universities are now admitting students based on merits beyond academic grades. What does it mean to be accepted on discretionary grounds? Sean Koh shares his views.",
    "A firm commitment to innovation pervades Germany’s Mittelstand firms. Find out why this has left an indelible impression on SMU business student Kevin Lim.",
    "Lim Yi Sheng shares that, on hindsight, even though SMU Information Systems is a very challenging course, he has No Regrets!",
    "SMU undergrad, Karl Gan, shares how his team of three are looking to make art more accessible in Singapore, starting their exhibition venture, The stART! Series.",
    "So, what's happening at SMU Open House 2016 this weekend? Student Joachim Fong shares the regular must-sees and newest highlights not to be missed.",
    "How do you embark on the search for your choice university? Vera Zhang shares why visiting open house is so important and how to make the most out of it.",
    "If you're considering a business degree with SMU, here are 6 truths about life in SMU's business school that student Kenneth Wong thinks you ought to know.",
    "Lionel Heng shares why he believes that he's found the best of both worlds in SMU's School of Economics.",
    "Year 4 student Sheriel Chia shares with us how her experiences have reaffirmed that her decision to join SMU's School of Accountancy was definitely the right one.",
    "Find out what are the three defining aspects of Tan Jun Wei's 4-month exchange journey to the US and the lessons learnt in venturing out of his comfort zone.",
    "Project Vikasa, an overseas Community Service Project (OCSP) organised by students from SMU teams up with I-India to help empower the women of Jaipur.",
    "Undergraduate, Pearlynn Wang, discovers that there is much more to be learnt about the bustling city, on her recent law study mission to Hong Kong.",
    "When everything else from a status bag to a suit is bespoke, why not opt for personalised learning when it comes to higher education?",
    "Accountancy was a foreign subject to Kai Yang when he first entered university. But knowing his strengths, Kai Yang is thankful that he stuck to his guns.",
    "Silence isn't always golden, especially if it stems from the fear of discrimination. Alex Chow breaks the silence on the stigma surrounding HIV.",
    "Justin Bay is definitely one for a challenge. A double degree, CCA activities, and even scoring a full-time position in the consulting firm he interned in.",
    "Two SMU alumni – Kaushal Dugar of Teabox and Raghav Somani of Headphone Zone – are taking India by storm with their appetite for disruption.",
    "From supportive professors, inspirational books, an internship with Ernst & Young to aspirations of becoming a CXO — Jaren Lim, shares his journey to ICT.",
    "In the legal realm, how will artificial intelligence work with us, and how will it work against us? Professor of Law Eliza Mik shares more.",
    "When it comes to finding that university match made in heaven, SMU’s top students reveal how to think outside the box.",
    "SMU students and alumni divulge their personal strategies for killing that crucial university admissions interview.",
    "The ability to teach well is an important skill that any exemplary professor must have. So how is the SMU PhD programme preparing our students for this?",
    "The humble kopi tiam has enormous potential to facilitate interaction, brainstorming and the creation of new knowledge.",
    "Although law school is a legendarily competitive environment, graduates from SMU's School of Law will tell you that it was the best four years of their lives.",
    "The SMU Peer Helpers provide a listening ear and emotional support for their peers during times of need. Find out more in this post.",
    "As a social sciences undergraduate, you are ideally poised to contribute meaningfully through research and other contributions in the area of public policy.",
    "At SMU, the world is your campus. Hear from students who went on invaluable and even life-changing overseas experiences.",
    "Let our final-year student Ila Nitin Gokarn tell you why she chose to pursue Information Systems Management at SMU.",
    "Think working at a library is boring? A SMU library assistant tells us it's quite the contrary, in this post about being Little Miss Librarian.",
    "The study of economics is key to making sense of our world. In this post, find out why the School of Economics is a great choice.",
    "Find out more about the qualities that hiring managers look for in job-seeking graduates.",
    "Through his audacious success in trekking Mount Everest, Siddiq was inspired to work towards effecting positivity among underprivileged youths.",
    "As a freshman, Manorama was cynical about SMU's compulsory community service hours. 3 years later, she is actively serving the global community.",
    "If consulting is your calling, check out the events held by SMU MBA Consulting Club 2015!",
    "If you are interested in marketing, you would love this! Check out the events held by SMU MBA Marketing Club 2015.",
    "Welcome to SMU! To prepare you for your first semester, here are some tried-and-tested tips for you.",
    "A well-written cover letter helps hiring managers to learn more about you as a person. An unconventional one will help you to stand out. Find out more.",
    "Tanoto Foundation scholars in SMU were invited to an event where they met their scholarship sponsor Sukanto Tanoto for the first time. Their thoughts here.",
    "What's it like to volunteer at a hospice, a place where people spend their final days? Plenty of joys, alongside the inevitable sorrows. Find out more.",
    "For Team Singapore triathlete Clement Chow, who's studying at SMU, training and competing in triathlons has provided him with valuable perspectives.",
    "Cheer on our SEA Games Athletes from SMU School of Accountancy!",
    "Read about the Ho siblings' shared SMU experience, and how it contributed to the unique relationship between the two of them.",
    "There are many with strong opinions on how best to conserve Singapore's hawker heritage. SMU alumnus Jack Sai is already doing so first-hand.",
    "Summer's over and a new academic year has just begun. Are you prepared yet? Check out our to-do list to help you get into the groove of a new semester!",
    "What's it like to run your own business while you're still in school? Our student Amanda Goh shares her experiences from running Pentagraphy Studios.",
    "MBA, full time MBA",
    "In the age of disruptive innovations, it becomes critical to overcome barriers towards creativity and innovation. Find out how innovation coaching can help.",
    "All our School of Information Systems complete an intensive final year project that requires working with real corporate clients on live projects and use cases.",
    "Find out all about our SMU MBA Overseas Exchange Programmes and Business Study Missions by Deckie He Dong, an SMU MBA alumni. (Written in Chinese)",
    "Find out about our Irish part-time student’s reason for embarking on the SMU MBA with us.",
    "For his first internship season, Kang Liang sought out a startup internship. Find out more about his internship experience with local startup ShopBack.",
    "An entrepreneur and current SMU Master of Science in Innovation postgraduate student shares insights on her journey, both in and out of the classroom.",
    "With the next semester quickly approaching, SMU student blogger Karl gives you the lowdown on the top 5 things you didn't think you'd miss about SMU!",
    "For a fitness buff like Jun Hao, working as a trainer at the SMU Gym is the perfect part-time job.",
    "What does it take to make it to compete in an international moot competition? Peek behind the scenes of SMU School of Law’s international moot court programme.",
    "Find out how the team from SMU triumphed over the competition to emerge champions at the Willem C. Vis (East) International Commercial Arbitration Moot 2015.",
    "Team Singapore sailor Terena Lam first started sailing as a freshman in SMU. Four years on, she's representing Singapore at SEA Games 2015.",
    "What better way to understand how New York's creative industry manages to thrive, than by visiting the city? Find out what our students gained from this experience.",
    "At this annual awards ceremony, SMU recognises those who have made outstanding contributions to our university's vibrant student life.",
    "The Medici Board Game is one approach to introduce people to the mind-set and logic of innovation potential at intersections. Find out more in this post.",
    "Project Reef Alert is a unique overseas community service project that combines the members' love of diving with a passion for marine conservation.",
    "What's a faci and what do they do at FOC? Where are NAKA and the T-Junction? This guide will help you to make sense of SMU's unique lingo!",
    "When Andrew left the Philippines to begin his life as an SMU MBA student, little did he know that he was embarking on an unforgettable adventure.",
    "The Li Ka Shing Library, second home to many an SMU student, was recently upgraded to serve students better. Have a look at the new library facilities here!",
    "Sailors often face a multitude of variables while they are on the waters. How are our SMU Sailors trained to sail to the win?",
    "In this series of blog posts, current SMU MBA student Jung-Yoon Kim aka KJ shares his insights into his MBA journey.",
    "Your project meetings often take much more time than absolutely necessary. Find out the 3Cs of optimising your group meeting productivity level.",
    "JC and Polytechnic students had the chance to immerse in the SMU Accountancy degree experience over a two-day camp.",
    "Our SoA athletes have made us proud at SEA Games 2015, with several athletes winning multiple gold medals.",
    "SMU School of Accountancy alumna Chua Wan Rong has excelled at the teaching end of the learning spectrum. Read about her journey from student to teacher!",
    "The SMU MBA has been instrumental in enabling its international students to build contacts and gain cross-cultural learnings. Find out more in this blog post.",
    "In the four-week Global Summer Programme, students converged on SMU for a combination of high quality academic learning and transformative cultural experiences.",
    "An overseas community service project combines two of the hallmarks of the SMU undergraduate experience: social responsibility and global exposure.",
    "Originally tone-deaf, SMU's business student and 11th president of BONDUE Hubert Ng spent this past summer pursuing his dream of recording his own music album.",
    "The majority of SMU's undergraduates complete 2 - 6 internships during their four years at SMU. When's the right time to start? Find out from a senior!",
    "Through their study mission to Myanmar, our students gained a first-hand understanding of the country's economy and culture.",
    "Does public speaking give you the jitters? Here are some presentation tips from our student Shan An.",
    "Training for the Ironman 70.3 requires discipline & determination. Read about SMU triathlete Brandon Tung's journey to the Ironman 70.3 World Championship.",
    "It's a common misconception that accountancy exists only as a subset of a business degree. Here's why you should consider joining the SMU School of Accountancy.",
    "Unlike the archetype of the socially-apathetic millennial, SMU students give back to society by completing at least 80 community service hours each.",
    "Once you start your university applications process, you'll encounter more unfamiliar terms that lead you deeper down the rabbit hole. Let us help!",
    "The process of applying to university comes with a number of unfamiliar terms. In this post, we help you shed light on some commonly-encountered words and phrases.",
    "'You confidently step into the class during orientation… and to your shock and horror, most of your would-be classmates are nearly half your age.'",
    "With over 120 CCAs to choose from, SMU offers no shortage of avenues for creative expression and self-development. Learn about the clubs that await you here!",
    "An internship is one of the best ways for you to gain exposure to real-world career options. Here's how to make a Super Impression during your internship.",
    "The DingGo team from SMU’s Master of Science in Innovation (MI) shares their journey to the annual Asia Venture Challenge business plan competition.",
    "Here are five unique experiences that you will experience in your freshman year of university, which will make it truly a year to remember.",
    "What are the seminar-style lessons really like? Why do so many SMU students go overseas for study missions, exchange programmes and more?",
    "An insider's take on everything that you wanted to know about SMU but weren't sure who to ask: about university life, CCAs, school-life balance and more.",
    "As the only university located in the heart of downtown Singapore, not only is SMU a part of the city—the city also is a big part of the SMU experience.",
    "SMU is well-equipped with fitness facilities that make it easy for you to get a workout in between classes.",
    "Life as an undergraduate in our Lee Kong Chian School of Business is one full of unique opportunities to learn and grow — and not just academically, either.",
    "Day 1 of SMU's Open House 2015 was packed full of insightful talks and exciting showcases. Find out more in this post!",
    "At the start of 2015, SMU Labs was unveiled as our university's latest learning experiment. Discover the unique facilities, designed by students for students.",
    "Here's a guide to the personalities you're bound to encounter at some point or another while doing project work.",
    "Read about the ups and downs of these three SMU students' exchange experiences, and how their perspectives have been shaped by living and studying abroad.",
    "SMU part-time MBA student, Masaki Hosokawa, reviews the modules that he has taken so far. (Written in Japanese)",
    "Pioneered by a group of SMU Tanoto scholars, this project is a way for the scholars to give back to society, in concert with the values of their scholarship body.",
    "You can and will experience stressful periods over the course of your university life. Here are some stress-management strategies that will help.",
    "Choosing which university to attend is a huge decision. You're not just choosing a field of study—you're also choosing your way of life for 4 entire years.",
    "Are you considering the SMU MBA part-time programme? Find out how our MBA student Jia Yong successfully balanced work, study and his personal life.",
    "Who do our students hope to work for? Which industries are they interested in, and what are their other priorities when embarking on their job hunt?",
    "Find out how you can use non-verbal cues to boost your confidence level and affect the outcome of your job application.",
    "College is great time to expand your social circle, and you meet different people. Student blogger Kritika writes about the 5 types of students you will find at SMU."
  ],
  "sources": [
    "https://blog.smu.edu.sg/smu-categories/admissions/from-one-smu-parent-to-another-a-levels-to-smu/",
    "https://blog.smu.edu.sg/smu-categories/admissions/from-one-smu-parent-to-another-international-baccalaureate-to-smu/",
    "https://blog.smu.edu.sg/smu-categories/admissions/from-one-smu-parent-to-another-polytechnic-to-smu/",
    "https://blog.smu.edu.sg/lb/ug/4-questions-to-ask-your-child-when-choosing-a-university/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoss/navigating-a-changing-world-with-the-aid-of-the-social-sciences/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoss/stand-out-in-a-competitive-economy-with-the-smu-psychology-political-science-and-sociology-major/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoss/master-interdisciplinary-thinking-with-the-smu-politics-law-and-economics-major/",
    "https://blog.smu.edu.sg/events-2/smu-open-house/explore-learn-and-experience-what-your-future-could-hold-at-smu-open-house-2022/",
    "https://blog.smu.edu.sg/smu-categories/global/achieving-career-goals-in-university-with-smu-short-term-internship/",
    "https://blog.smu.edu.sg/lb/ug/how-to-choose-a-university/",
    "https://blog.smu.edu.sg/lb/ug/smu-athletes-to-watch-national-hockey-player-gene-leck/",
    "https://blog.smu.edu.sg/topics/arts/squid-game-life-skills-every-student-can-borrow/",
    "https://blog.smu.edu.sg/topics/business/how-to-thrive-during-a-pandemic-according-to-the-worlds-top-business-leaders/",
    "https://blog.smu.edu.sg/masters/will-pursuing-a-masters-degree-advance-your-c-suite-goals/",
    "https://blog.smu.edu.sg/lb/ug/smu-athletes-to-watch-national-golfer-ryan-ang/",
    "https://blog.smu.edu.sg/smu-categories/global/overseas-virtual-internship-programme-opening-doors-to-a-career-of-the-future/",
    "https://blog.smu.edu.sg/smu-categories/global/exchange-and-entrepreneurship-my-experience-at-babson-college-usa/",
    "https://blog.smu.edu.sg/topics/covid19/living-with-covid-for-the-long-haul/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/from-startup-entrepreneur-to-corporate-innovation-and-venture-building/",
    "https://blog.smu.edu.sg/topics/psychology/swipe-your-way-to-mental-wellness-in-just-10-apps/",
    "https://blog.smu.edu.sg/icli/iie/life-lessons-from-my-stint-as-vice-president-of-smu-fintech-club/",
    "https://blog.smu.edu.sg/smu-categories/global/smu-overseas-virtual-internship-programme-setting-izzaty-up-for-success-in-a-career-in-tax/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/excelling-at-his-first-job-with-the-smu-second-major-in-accounting-data-analytics/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoss/poly-to-smu-preparing-for-the-global-workplace-with-the-versatile-and-fulfilling-smu-bachelor-of-social-science/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoss/ib-to-smu-preparing-for-the-global-workplace-with-the-versatile-and-fulfilling-smu-bachelor-of-social-science/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoss/a-levels-to-smu-preparing-for-the-global-workplace-with-the-versatile-and-fulfilling-smu-bachelor-of-social-science-degree/",
    "https://blog.smu.edu.sg/smu-categories/global/from-international-baccalaureate-to-smu-my-journey-towards-global-citizenship/",
    "https://blog.smu.edu.sg/smu-categories/global/from-polytechnic-to-smu-my-journey-towards-global-citizenship/",
    "https://blog.smu.edu.sg/smu-categories/global/from-a-levels-to-smu-my-journey-towards-global-citizenship/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/how-the-smu-second-major-in-accounting-data-and-analytics-kickstarted-careers/",
    "https://blog.smu.edu.sg/lb/ug/meet-incoming-freshman-of-smu-2022-john-david/",
    "https://blog.smu.edu.sg/lb/ug/meet-incoming-freshman-of-smu-2022-ng-ka-mun/",
    "https://blog.smu.edu.sg/lb/ug/meet-incoming-freshman-of-smu-2022-sneha-peter/",
    "https://blog.smu.edu.sg/lb/ug/meet-incoming-freshman-of-smu-2022-andralynn-tan/",
    "https://blog.smu.edu.sg/lb/smu-x/propelling-law-graduates-into-the-digital-era/",
    "https://blog.smu.edu.sg/lb/doc/how-ai-could-affect-well-being-privacy-and-leadership-at-work/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smuscis/smu-bsc-software-engineering-skillsfuture-wsdegree/",
    "https://blog.smu.edu.sg/smu-categories/global/manoeuvring-myanmar-with-dynamic-data-on-an-asean-internship/",
    "https://blog.smu.edu.sg/lb/ug/meet-incoming-freshman-of-smu-2022-nicolas-tang/",
    "https://blog.smu.edu.sg/lb/ug/meet-incoming-freshman-of-smu-2022-guan-bingyan/",
    "https://blog.smu.edu.sg/lb/ug/why-i-chose-smu-social-sciences-jamie-ho/",
    "https://blog.smu.edu.sg/lb/ug/why-i-chose-smu-computing-and-information-systems-gigi-teo/",
    "https://blog.smu.edu.sg/lb/ug/why-i-chose-smu-business-deng-boya/",
    "https://blog.smu.edu.sg/lb/ug/why-i-chose-smu-economics-sia-yu-ting/",
    "https://blog.smu.edu.sg/icli/iie/an-internship-in-the-blockchain-industry-in-china/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/impact-investing-and-esg-an-amalgamation-in-the-smu-impact-investing/",
    "https://blog.smu.edu.sg/smu-categories/alumni/smu-celebrates-international-womens-day-2022/",
    "https://blog.smu.edu.sg/smu-categories/global/iqbal-in-singapore-a-fulfilling-in-person-exchange-experience-amidst-the-pandemic/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/accounting-professionals-in-the-fight-against-rising-financial-crime/",
    "https://blog.smu.edu.sg/smu-categories/alumni/monolith-transforming-lives-of-young-refugees-through-the-gift-of-education/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/smu-tax-champions-score-big-at-the-deloitte-sea-tax-challenge-2023/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/how-an-smu-accountancy-degree-paved-the-way-for-a-career-in-consultancy/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/breaking-the-mould-how-the-new-master-of-science-in-entrepreneurship-and-innovation-degree-imparts-future-citizen-skills/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/smu-accountancy-student-takes-her-passion-for-ultimate-frisbee-to-the-international-stage/",
    "https://blog.smu.edu.sg/smu-categories/global/career-development-with-the-asean-internship-programme-aip/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/representing-singapore-as-the-isca-one-young-charteredstar-2022/",
    "https://blog.smu.edu.sg/events-2/smu-open-house/10-reasons-to-visit-smu-open-house-2023/",
    "https://blog.smu.edu.sg/smu-categories/global/from-jc-to-the-world-my-global-exposure-experience-of-the-lifetime/",
    "https://blog.smu.edu.sg/smu-categories/global/from-poly-to-the-world-my-global-exposure-experience-of-the-lifetime/",
    "https://blog.smu.edu.sg/smu-categories/global/from-ib-to-the-world-my-global-exposure-experience-of-the-lifetime/",
    "https://blog.smu.edu.sg/lb/ug/why-you-need-an-interdisciplinary-education-to-thrive-in-a-vuca-world/",
    "https://blog.smu.edu.sg/smu-categories/global/experiencing-maastricht-on-exchange-an-underrated-dutch-retreat/",
    "https://blog.smu.edu.sg/strategic-pillars/sustainable-living/shedding-light-on-solar-challenges/",
    "https://blog.smu.edu.sg/topics/education/will-exams-ever-become-obsolete/",
    "https://blog.smu.edu.sg/smu-categories/global/lessons-from-lithuania-exchange-at-ism-university-of-management-and-economics/",
    "https://blog.smu.edu.sg/smu-categories/studentlife/preparing-for-a-return-to-life-on-campus/",
    "https://blog.smu.edu.sg/departments/office-of-student-life-x-cept/smu-community-comes-2gether-as-1-in-art-part-ii/",
    "https://blog.smu.edu.sg/smu-categories/global/overseas-virtual-internship-programme-opening-doors-to-a-career-in-digital-transformation/",
    "https://blog.smu.edu.sg/departments/office-of-student-life-x-cept/smu-community-comes-2gether-as-1-in-art-part-i/",
    "https://blog.smu.edu.sg/smu-categories/studentlife/you-are-not-alone-multiple-touchpoints-for-mental-resilience/",
    "https://blog.smu.edu.sg/smu-categories/global/reflections-conversations-with-students-on-short-term-internships-sti/",
    "https://blog.smu.edu.sg/masters/transforming-knowledge-into-entrepreneurial-impact/",
    "https://blog.smu.edu.sg/smu-categories/global/jumping-right-in-conversations-with-students-on-short-term-internships-sti/",
    "https://blog.smu.edu.sg/smu-categories/global/pre-flight-check-in-conversations-with-students-on-short-term-internships-sti/",
    "https://blog.smu.edu.sg/strategic-pillars/growth-asia/the-new-smu-overseas-centre-in-jakarta-forging-asias-knowledge-gateway/",
    "https://blog.smu.edu.sg/smu-categories/grants/smu-overseas-centre-jakarta-scholarships-to-ensure-a-brighter-future/",
    "https://blog.smu.edu.sg/smu-categories/global/multicultural-immersion-in-indonesia-through-the-smu-asean-internship-programme/",
    "https://blog.smu.edu.sg/smu-categories/global/how-global-exposure-opportunities-led-this-smu-alumna-to-pursue-her-career-in-germany/",
    "https://blog.smu.edu.sg/smu-categories/global/a-chance-encounter-a-dream-pursued-and-the-internship-of-a-lifetime/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/accelerate-your-career-in-quantitative-finance-with-the-smu-fast-track-bbm-mqf-programme/",
    "https://blog.smu.edu.sg/smu-categories/global/global-exposure-in-the-new-normal-south-korea-thailand/",
    "https://blog.smu.edu.sg/lb/doc/breaking-analysis-paralysis-with-the-help-of-artificial-intelligence/",
    "https://blog.smu.edu.sg/smu-categories/global/smu-overseas-virtual-internship-programme-building-foundational-skills-on-a-global-level/",
    "https://blog.smu.edu.sg/smu-categories/global/global-exposure-in-the-new-normal-part-4-spain-germany/",
    "https://blog.smu.edu.sg/smu-categories/global/global-exposure-in-the-new-normal-part-3-usa-canada/",
    "https://blog.smu.edu.sg/smu-categories/studentlife/smu-lingo-demystified/",
    "https://blog.smu.edu.sg/smu-categories/global/global-exposure-in-the-new-normal-part-2-switzerland-and-italy/",
    "https://blog.smu.edu.sg/smu-categories/global/global-exposure-in-the-new-normal-part-1-norway-the-netherlands/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/smu-accountancy-graduate-when-one-career-peak-is-not-enough/",
    "https://blog.smu.edu.sg/lb/ug/why-i-chose-smu-accountancy-amanda-song/",
    "https://blog.smu.edu.sg/topics/psychology/what-is-intrusive-parenting-and-how-does-it-shape-the-people-we-become/",
    "https://blog.smu.edu.sg/smu-categories/global/exchange-in-the-great-white-north/",
    "https://blog.smu.edu.sg/topics/covid19/back-to-school-essentials-the-covid-19-edition/",
    "https://blog.smu.edu.sg/topics/employability/6-ways-to-build-career-resilience-in-the-disruptive-future/",
    "https://blog.smu.edu.sg/topics/covid19/5-budget-tricks-to-upgrade-your-home-learning-space/",
    "https://blog.smu.edu.sg/smu-categories/tips/5-ways-to-celebrate-the-holidays-away-from-home/",
    "https://blog.smu.edu.sg/smu-categories/global/overseas-virtual-internship-programme-getting-the-best-of-both-worlds-in-regional-work-experience/",
    "https://blog.smu.edu.sg/lb/ug/smu-athletes-to-watch-national-sprinter-and-hurdler-ow-yeong-wei-bin/",
    "https://blog.smu.edu.sg/smu-categories/global/experiencing-hong-kong-through-my-overseas-exchange-programme/",
    "https://blog.smu.edu.sg/topics/asia/overworked-and-sleep-deprived-in-singapore-how-to-nurture-healthier-and-more-productive-workers/",
    "https://blog.smu.edu.sg/lb/ed/why-product-management-is-key-to-thrive-in-the-digital-economy/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/sharpening-my-data-analytics-skills-with-the-smu-ey-accounting-data-analytics-wsep/",
    "https://blog.smu.edu.sg/contentpillars/research/sustaining-malaysian-transnational-families-though-kin-work/",
    "https://blog.smu.edu.sg/icli/iie/my-360%cb%9a-learning-experience-with-a-student-run-venture-fund-and-a-start-up-incubator/",
    "https://blog.smu.edu.sg/smu-categories/global/experiencing-the-golden-era-of-vietnam-through-the-smu-asean-internship-programme/",
    "https://blog.smu.edu.sg/lb/ed/how-businesses-can-fight-cybersecurity-risks-in-todays-digital-world/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/an-accountancy-alumnas-journey-to-reduce-inequality-one-step-at-a-time/",
    "https://blog.smu.edu.sg/smu-categories/global/taking-first-steps-towards-a-career-in-sustainability-with-smu-asean-internship-programme/",
    "https://blog.smu.edu.sg/lb/ug/meet-incoming-freshman-of-smu-2022-elisha-tan/",
    "https://blog.smu.edu.sg/lb/ug/meet-incoming-freshman-of-smu-2022-siti-noormasliana/",
    "https://blog.smu.edu.sg/lb/ug/meet-incoming-freshman-of-smu-2022-muhammad-izzat-junaidie/",
    "https://blog.smu.edu.sg/lb/ug/meet-incoming-freshman-of-smu-2022-sarah-thauheed/",
    "https://blog.smu.edu.sg/lb/ug/meet-incoming-freshman-of-smu-2022-andre-song/",
    "https://blog.smu.edu.sg/lb/doc/the-intersection-between-online-data-public-trust-in-corporations-and-accountancy/",
    "https://blog.smu.edu.sg/smu-categories/global/smu-overseas-virtual-internship-programme-finding-new-opportunities-in-familiar-places/",
    "https://blog.smu.edu.sg/academic/insights-from-an-insider-joseph-hwang/",
    "https://blog.smu.edu.sg/academic/insights-from-an-insider-charmaine-lim/",
    "https://blog.smu.edu.sg/academic/insights-from-an-insider-edward-lo/",
    "https://blog.smu.edu.sg/smu-categories/housing/5-tips-on-how-to-live-your-best-smu-life-at-prinsep-street-residences/",
    "https://blog.smu.edu.sg/undergraduate/how-to-bid-like-a-boss/",
    "https://blog.smu.edu.sg/topics/what-the-internet-generation-needs-to-be-more-human/",
    "https://blog.smu.edu.sg/topics/covid19/how-to-get-back-in-shape-while-maintaining-social-distance/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/4-ways-gender-dynamics-affect-intercultural-conflict-in-the-workplace/",
    "https://blog.smu.edu.sg/publications/perspectives-at-smu/can-the-fast-food-industry-survive-covid-19/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/how-to-make-venture-capital-funding-work-for-you/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/5-ways-to-boost-your-business-through-influencer-marketing/",
    "https://blog.smu.edu.sg/icli/iie/adventures-within-the-great-wall/",
    "https://blog.smu.edu.sg/departments/office-of-student-life-x-cept/how-to-create-an-arts-festival-in-a-pandemic/",
    "https://blog.smu.edu.sg/topics/career/career-career/video-conferencing-101-in-the-new-normal/",
    "https://blog.smu.edu.sg/icli/iie/dream-big-and-work-hard-how-to-benefit-from-an-internship-amidst-the-pandemic/",
    "https://blog.smu.edu.sg/undergraduate/class-2020-graduating-recession-5-questions-gain-clarity-direction/",
    "https://blog.smu.edu.sg/undergraduate/project-y-to-z-hindsight-20-20-from-class-2008-to-class-2020/",
    "https://blog.smu.edu.sg/undergraduate/bacc/off-the-beaten-track-starting-fresh-career-myanmar/",
    "https://blog.smu.edu.sg/topics/life/4-signs-might-need-digital-detox-how-go-about-it/",
    "https://blog.smu.edu.sg/icli/lcsi/living-learning-lockdown-5-ways-stay-productive-entertained-home/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/smu-alumni-entrepreneurs-help-nourish-frontline-healthcare-workers-fight-against-covid-19/",
    "https://blog.smu.edu.sg/undergraduate/bbm/people-analytics-key-happier-workplace/",
    "https://blog.smu.edu.sg/undergraduate/bacc/inaugural-smu-isca-case-competition/",
    "https://blog.smu.edu.sg/undergraduate/bbm/girlboss-tiziana-tan-power-teamwork/",
    "https://blog.smu.edu.sg/undergraduate/bacc/a-letter-to-my-accounting-professors/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/serving-the-homeless-in-singapore/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/building-your-brand-in-the-experience-economy/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/accountancy-alumnus-workstream-ceo-enters-2020-silicon-valley-business-journals-40-under-40-honorees/",
    "https://blog.smu.edu.sg/smu-categories/grants/5-ways-financially-prudent-in-challenging-times/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/reflecting-on-my-second-major-in-accounting-data-and-analytics/",
    "https://blog.smu.edu.sg/publications/podcast-at-smu/10-podcasts-to-help-you-navigate-2021/",
    "https://blog.smu.edu.sg/topics/business/4-creative-pandemic-business-pivots-to-learn-from/",
    "https://blog.smu.edu.sg/academic/how-holistic-well-being-will-shape-life-and-living-in-hdb-estates/",
    "https://blog.smu.edu.sg/icli/iie/theodora-boo-leading-seas-first-student-venture-fund/",
    "https://blog.smu.edu.sg/topics/covid19/5-ideas-for-downturn-proof-startups/",
    "https://blog.smu.edu.sg/events-2/fomo-2021-the-case-of-the-missing-medallion/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/olympian-sailor-kimberly-lim-making-waves-from-classroom-to-regatta/",
    "https://blog.smu.edu.sg/icli/iie/6-entrepreneurial-tips-to-give-startups-a-head-start/",
    "https://blog.smu.edu.sg/smu-categories/tips/4-ways-we-can-learn-self-compassion-to-reach-our-full-potential/",
    "https://blog.smu.edu.sg/smu-categories/studentlife/protecting-the-mental-health-of-youths-in-a-pandemic/",
    "https://blog.smu.edu.sg/lb/pg/why-pursuing-a-masters-might-be-prudent-in-a-time-of-crisis/",
    "https://blog.smu.edu.sg/smu-categories/global/nurturing-global-ready-citizens-amid-and-beyond-covid-19/",
    "https://blog.smu.edu.sg/icli/iie/forging-his-path-as-an-entrepreneur-marcus-cheu/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/smu-x-overseas-accounting-study-mission-leaving-our-virtual-footprints-in-indonesia/",
    "https://blog.smu.edu.sg/topics/sustainability/how-to-be-more-environmentally-sustainable-when-working-from-home/",
    "https://blog.smu.edu.sg/undergraduate/5-tips-on-starting-freshman-year-in-a-pandemic/",
    "https://blog.smu.edu.sg/undergraduate/find-your-tribe-at-smu-vivace-2021/",
    "https://blog.smu.edu.sg/lb/doc/the-pioneering-path-of-entrepreneur-smu-dba-alum-rameshwari-ramachandra/",
    "https://blog.smu.edu.sg/academic/schools-libraries/yphsol/unexpected-careers-you-may-pursue-with-a-law-degree/",
    "https://blog.smu.edu.sg/lb/doc/those-who-can-train/",
    "https://blog.smu.edu.sg/academic/how-an-award-winning-smu-app-is-shaking-up-the-way-we-learn/",
    "https://blog.smu.edu.sg/lb/ug/5-tips-on-how-to-survive-on-50-a-week-at-smu/",
    "https://blog.smu.edu.sg/academic/insights-from-an-insider-aisyah-az-zuhra-norkhalim/",
    "https://blog.smu.edu.sg/academic/insights-from-an-insider-tarina-naresh-khiantani/",
    "https://blog.smu.edu.sg/academic/insights-from-an-insider-anish-kishor-dobariyapatel/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/4-smart-ways-to-market-to-stay-in-consumers/",
    "https://blog.smu.edu.sg/lb/smua-pce/how-effective-ip-management-can-help-your-sme/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smuscis/data-analytics-how-to-better-understand-data-to-make-it-useful/",
    "https://blog.smu.edu.sg/academic/should-you-track-what-you-eat/",
    "https://blog.smu.edu.sg/undergraduate/taking-learning-to-the-next-level-pairing-smes-and-students-for-mutual-benefits/",
    "https://blog.smu.edu.sg/icli/lcsi/sustaining-momentum-on-migrant-worker-issues-after-covid-19/",
    "https://blog.smu.edu.sg/undergraduate/what-we-learnt-putting-together-smus-very-first-virtual-freshmen-orientation-from-scratch/",
    "https://blog.smu.edu.sg/undergraduate/project-y-to-z-boost-your-employability-lionel-gao/",
    "https://blog.smu.edu.sg/undergraduate/project-y-to-z-get-your-game-face-on-interview-woo-jian-sheng/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/navigating-my-education-startup-through-the-covid-19-crisis/",
    "https://blog.smu.edu.sg/doctoral/perspectives-on-pursuing-a-phd-in-a-pandemic/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/solving-real-world-issues-through-smu-x-accounting-analytics-capstone-project/",
    "https://blog.smu.edu.sg/departments/core-curriculum/smu-core-curriculum-readying-a-new-generation-for-the-future/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smuscis/when-computing-and-law-have-more-similarities-than-you-think/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/hi2020-making-a-social-impact-with-aaron-er/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/hi2020-bouncing-back-stronger-with-anna-quang/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoss/hi2020-going-the-extra-mile-with-melvin-ng/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/online-learning-in-my-last-semester-at-smu-school-of-accountancy/",
    "https://blog.smu.edu.sg/academic/schools-libraries/yphsol/a-law-degree-serving-humanity/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/hi2020-taking-flight-with-sean-tan/",
    "https://blog.smu.edu.sg/academic/on-a-quest-to-make-psychology-research-relatable/",
    "https://blog.smu.edu.sg/academic/schools-libraries/managing-corporate-social-responsibility-in-a-downturn/",
    "https://blog.smu.edu.sg/academic/leading-the-pack-with-the-inaugural-virtual-smu-paw-animal-day/",
    "https://blog.smu.edu.sg/departments/4-ways-to-get-the-most-out-of-a-remote-internship/",
    "https://blog.smu.edu.sg/academic/surpassing-expectations-with-the-smoo-challenge/",
    "https://blog.smu.edu.sg/academic/preventing-and-reducing-burnout-with-mindfulness/",
    "https://blog.smu.edu.sg/academic/schools-libraries/5-real-tips-for-sniffing-out-fake-news/",
    "https://blog.smu.edu.sg/academic/bringing-the-world-to-smu-with-diverse-city-2020/",
    "https://blog.smu.edu.sg/smu-categories/5-ways-to-serve-the-community-in-the-time-of-social-distancing/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/rising-through-the-ranks-an-effective-millennial-manager/",
    "https://blog.smu.edu.sg/academic/hi2020-a-journey-of-growth-with-lee-chaehyun/",
    "https://blog.smu.edu.sg/events-2/smu-open-house/come-on-a-journey-with-smu-virtual-open-house-2021/",
    "https://blog.smu.edu.sg/undergraduate/bbm/hi2020-staying-hungry-to-learn-with-dilesh-kumar/",
    "https://blog.smu.edu.sg/academic/do-you-have-to-be-toxic-to-get-to-the-top/",
    "https://blog.smu.edu.sg/undergraduate/bbm/hi2020-investing-in-oneself-with-farid-mohammad/",
    "https://blog.smu.edu.sg/undergraduate/bbm/how-learning-app-kalpha-is-changing-lives-in-covid-19/",
    "https://blog.smu.edu.sg/smu-categories/career-smulife/find-a-job/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoe/building-a-business-with-benjamin-wong/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoss/5-ways-social-media-can-influence-body-esteem-in-female-adolescents/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/why-jessica-lee-back-with-social-initiative-hindsight-2020/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/making-a-social-enterprise-profitable-an-interview-with-smu-accountancy-alumnus/",
    "https://blog.smu.edu.sg/lb/ug/rise-above-your-circumstances-with-smu-access/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/thrive-in-the-digital-age-with-smus-new-business-major-and-track/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smuscis/hi2020-contact-tracing-with-shawn-pang/",
    "https://blog.smu.edu.sg/icli/skbi/5-reasons-to-start-financial-literacy-young/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smuscis/bridging-technology-and-law-with-smus-bachelor-of-science-in-computing-law/",
    "https://blog.smu.edu.sg/academic/hi2020-developing-a-team-with-yash-gadodia/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smuscis/smart-city-tools-for-battling-a-pandemic/",
    "https://blog.smu.edu.sg/academic/hi2020-follow-your-heart-with-chan-huang-suan/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/fight-white-collar-crimes-with-the-new-smu-second-major-in-financial-forensics/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/my-smu-kpmg-cyber-risk-and-forensics-work-study-programme-experience/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/making-an-impact-at-icaew-greater-china-south-east-asia-business-challenge-2021/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/physical-or-online-its-still-business-as-usual-for-soa-outreach/",
    "https://blog.smu.edu.sg/academic/10-reasons-why-smu-is-the-university-for-you/",
    "https://blog.smu.edu.sg/doctoral/multidisciplinary-research-and-its-real-world-impact/",
    "https://blog.smu.edu.sg/academic/hi2020-one-bag-at-a-time-with-jaslyn-quek-and-victoria-neo/",
    "https://blog.smu.edu.sg/smu-categories/global/smu-global-exposure-programmes-nurturing-global-citizens-of-tomorrow/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/hi2020-being-pawsome-with-travis-tan/",
    "https://blog.smu.edu.sg/icli/iie/finding-the-sweet-spot-in-his-entrepreneurial-journey-clarence-ong/",
    "https://blog.smu.edu.sg/undergraduate/project-y-to-z-stay-never-say-never-interview-julia-hee/",
    "https://blog.smu.edu.sg/doctoral/life-as-a-self-driven-phd-student-in-multicultural-singapore/",
    "https://blog.smu.edu.sg/masters/graduate-student-interview-developing-global-perspective/",
    "https://blog.smu.edu.sg/undergraduate/project-y-to-z-stay-be-resilient-interview-chng-li-ming/",
    "https://blog.smu.edu.sg/undergraduate/bacc/reflections-of-graduate-who-found-her-silver-lining-uncertain-times/",
    "https://blog.smu.edu.sg/undergraduate/psr-living-through-covid19/",
    "https://blog.smu.edu.sg/undergraduate/project-y-to-z-stay-in-motion-interview-aldric-chen/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/will-working-from-home-become-new-normal/",
    "https://blog.smu.edu.sg/undergraduate/project-y-to-z-take-your-first-step-interview-chen-weili/",
    "https://blog.smu.edu.sg/masters/msa/graduate-student-interview-finding-independence-community-smu/",
    "https://blog.smu.edu.sg/undergraduate/bacc/when-k-pop-becomes-your-business/",
    "https://blog.smu.edu.sg/undergraduate/bacc/going-social-with-soa/",
    "https://blog.smu.edu.sg/undergraduate/bacc/entrepreneur-breaking-cleaning-services-stereotype-re-training-digitalisation/",
    "https://blog.smu.edu.sg/undergraduate/bacc/soa-engage-coming-together-family-serve-the-community/",
    "https://blog.smu.edu.sg/undergraduate/bbm/top-4-road-trips-from-massachusetts/",
    "https://blog.smu.edu.sg/undergraduate/no-place-world-like-manila/",
    "https://blog.smu.edu.sg/undergraduate/bacc/accountancy-student-inspire-giving-to-receive/",
    "https://blog.smu.edu.sg/topics/tech/10-digital-tools-individual-productivity/",
    "https://blog.smu.edu.sg/masters/mpa/smus-mpa-helps-accelerate-career-accounting-finance-heres-how-programme-helping-me-achieve-goals/",
    "https://blog.smu.edu.sg/masters/mba/student-interview-series-yuta-morita-smu-mba/",
    "https://blog.smu.edu.sg/undergraduate/cleantech-startup-gives-new-life-organic-waste/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/one-year-on-ryan-goh-economics-freshman/",
    "https://blog.smu.edu.sg/undergraduate/double-degree-double-major-which-should-choose/",
    "https://blog.smu.edu.sg/undergraduate/5-tips-surviving-hostel-life/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/one-year-on-lim-wei-xiang-information-systems-freshman/",
    "https://blog.smu.edu.sg/undergraduate/bbm/insights-insider-business-valedictorian-kelvin-fan/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/insights-insider-social-sciences-valedictorian-joel-chin/",
    "https://blog.smu.edu.sg/undergraduate/bbm/unlocking-chain-reaction-social-impact/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/insights-insider-information-systems-valedictorian-tan-kee-hock/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/insights-insider-economics-valedictorian-brandon-lum/",
    "https://blog.smu.edu.sg/undergraduate/adulting-101-student-leaders-life-lessons-campus-life/",
    "https://blog.smu.edu.sg/undergraduate/llb/one-year-on-alicia-li-law-freshman/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoss/unequal-burdens-covid-19-impacts-working-women/",
    "https://blog.smu.edu.sg/undergraduate/bbm/aim-solve-big-problems-foodtech-entrepreneur-alan-phua/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/one-year-on-marc-ong-social-sciences-freshman/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/typical-day-the-beach-soa-faculty-staff/",
    "https://blog.smu.edu.sg/undergraduate/bbm/preparing-survive-real-world-after-graduation/",
    "https://blog.smu.edu.sg/undergraduate/bacc/one-year-on-bryan-tay-accountancy-freshman/",
    "https://blog.smu.edu.sg/undergraduate/bbm/one-year-on-amanda-lim-business-freshman/",
    "https://blog.smu.edu.sg/undergraduate/bacc/surfing-learning-curve-young-accounting-professional/",
    "https://blog.smu.edu.sg/undergraduate/bbm/what-every-marketer-should-know-about-social-media-today/",
    "https://blog.smu.edu.sg/undergraduate/how-decide-which-career-path-best-for-you/",
    "https://blog.smu.edu.sg/masters/maf/from-fiction-finance/",
    "https://blog.smu.edu.sg/undergraduate/from-eyes-beneficiaries-fond-memories-starringsmu/",
    "https://blog.smu.edu.sg/masters/mitb/decentralise-me/",
    "https://blog.smu.edu.sg/masters/mba/what-mba-programme-must-do-stay-relevant/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/heart-coding-these-students-helping-underprivileged-youths-level-up-coding/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/not-talking-about-e-waste-enough-thats-problem/",
    "https://blog.smu.edu.sg/undergraduate/not-just-clearing-hours-lessons-from-inspirar/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/humour-can-backfire-workplace-heres-why/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/student-to-student-tips-going-beyond-good-grades/",
    "https://blog.smu.edu.sg/undergraduate/bacc/realities-being-social-media-influencer-mongchin-yeoh/",
    "https://blog.smu.edu.sg/undergraduate/what-need-know-smu-new-undergraduate-curriculum/",
    "https://blog.smu.edu.sg/academic/schools-libraries/yphsol/tech-disruption-legal-sector-no-longer-question-when-but-how/",
    "https://blog.smu.edu.sg/masters/mitb/valuechampion-joel-ng-mitb/",
    "https://blog.smu.edu.sg/undergraduate/bacc/three-consecutive-top-scorers-scaq-smu-school-accountancy/",
    "https://blog.smu.edu.sg/undergraduate/bacc/being-data-analytics-swiss-army-knife-experience-intern-deloitte-france/",
    "https://blog.smu.edu.sg/undergraduate/clubbing-up-university-life/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/rise-gig-economy-digital-nomad/",
    "https://blog.smu.edu.sg/masters/mtsc/breaking-down-barriers-cai-yinzhou/",
    "https://blog.smu.edu.sg/undergraduate/digitalising-fishy-business/",
    "https://blog.smu.edu.sg/undergraduate/tracing-footsteps-worlds-leading-tech-innovators-china/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/student-interview-series-lim-yee-xien-economics/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/humbling-experience-helping-rohingya-refugees-project-xing-fu-8/",
    "https://blog.smu.edu.sg/undergraduate/picking-university-your-dreams-be-negative/",
    "https://blog.smu.edu.sg/undergraduate/what-does-mean-have-personalised-degree/",
    "https://blog.smu.edu.sg/undergraduate/bbm/student-interview-series-merrill-cheong/",
    "https://blog.smu.edu.sg/topics/sustainability/4-ways-sustainability-boost-bottom-lines/",
    "https://blog.smu.edu.sg/undergraduate/trying-choose-university-some-people-resources-turn-guidance/",
    "https://blog.smu.edu.sg/undergraduate/bacc/soa-engage-2019-cook-paint-that-question/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/dont-become-another-leadership-meltdown-4-steps-better-leader/",
    "https://blog.smu.edu.sg/doctoral/smu-techfest-2019-preferred-ai-artificial-intelligence/",
    "https://blog.smu.edu.sg/undergraduate/bbm/around-the-world-in-4-smu-years-going-global-with-lam-hui-yun/",
    "https://blog.smu.edu.sg/masters/mm/reaping-lifelong-returns/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoa/dollars-sense-climate-change/",
    "https://blog.smu.edu.sg/icli/iie/no-holds-barred-access-vibrant-startup-culture-bangkok-global-innovation-immersion-thailand/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/four-top-ways-leaders-can-enable-innovation/",
    "https://blog.smu.edu.sg/undergraduate/bbm/14-days-hua-tat-village-vietnam/",
    "https://blog.smu.edu.sg/topics/career/mid-career-itch-6-tips-scratch/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/why-companies-keep-silent-good-deeds/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/marketing-china-why-cant-western-brands-get-right/",
    "https://blog.smu.edu.sg/undergraduate/picking-university-offers-more-options-fast-changing-economy/",
    "https://blog.smu.edu.sg/topics/life/how-hought-leader-when-anyone-self-proclaimed-influencer-these-days/",
    "https://blog.smu.edu.sg/undergraduate/bacc/struggles-strengths-deciphering-truths-with-masahiro-tan/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/hidden-gems-of-writing-analytics/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/faheema-discusses-prejudice-extremism-how-combating-one-conversation-time/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/community-consulting-soon-zhengxiang-combining-work-passion/",
    "https://blog.smu.edu.sg/undergraduate/10-tips-for-new-travellers/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoss/for-richer-poorer-ses-affects-climate-change/",
    "https://blog.smu.edu.sg/masters/mm/student-interview-series-viona-giovanni-felisiana-smu-mim/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/student-interview-ng-kok-yin-soss/",
    "https://blog.smu.edu.sg/undergraduate/llb/how-ai-analytics-affect-next-generation-legal-professionals/",
    "https://blog.smu.edu.sg/undergraduate/virtual-open-house-2020/",
    "https://blog.smu.edu.sg/undergraduate/keep-open-mind-ready-help-student-volunteers-tips-community-service-experience/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/student-interview-shreyas-krishnaswamy-sis/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/student-to-student-tips-stepping-out-comfort-zone/",
    "https://blog.smu.edu.sg/undergraduate/a-level-results-day-game-plan/",
    "https://blog.smu.edu.sg/undergraduate/bacc/student-interview-michelle-lim-si-jia-soa/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/important-life-skills-learn-coding/",
    "https://blog.smu.edu.sg/undergraduate/llb/student-interview-series-cheng-you-duen-law/",
    "https://blog.smu.edu.sg/masters/four-skills-fast-track-your-career-growth/",
    "https://blog.smu.edu.sg/undergraduate/llb/insights-insider-law-valedictorian-nguyen-sinh-vuong/",
    "https://blog.smu.edu.sg/undergraduate/beat-stress-before-gets-best-of-you/",
    "https://blog.smu.edu.sg/undergraduate/bacc/insights-insider-accountancy-valedictorian-eugene-tan/",
    "https://blog.smu.edu.sg/undergraduate/insider-tips-aceing-your-admissions-interviews/",
    "https://blog.smu.edu.sg/undergraduate/bacc/soa-graduate-emerges-scaq-top-scorer-once-again/",
    "https://blog.smu.edu.sg/undergraduate/bacc/a-peek-into-working-and-living-in-zurich/",
    "https://blog.smu.edu.sg/undergraduate/bacc/5-reasons-ai-revolutionise-accounting/",
    "https://blog.smu.edu.sg/icli/iie/entrepreneurs-dilemma-startups-join-incubator/",
    "https://blog.smu.edu.sg/undergraduate/5-ways-smu-made-different-me/",
    "https://blog.smu.edu.sg/masters/mwm/my-smu-mwm-gave-me-technical-knowledge-needed-boost-career/",
    "https://blog.smu.edu.sg/masters/mitb/the-future-robo-advisor/",
    "https://blog.smu.edu.sg/masters/msa/i-wanted-learn-more-about-data-analytics-enhance-my-career-smus-msa-giving-me-skills-need/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoss/sustain-local-food-culture-go-global/",
    "https://blog.smu.edu.sg/icli/rcoe/intellectual-property-innovation-secret-weapons-retailers-survive/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/can-blockchain-impact-environment/",
    "https://blog.smu.edu.sg/doctoral/job-market-experience-shared-smu-phd-business-candidates/",
    "https://blog.smu.edu.sg/masters/mitb/big-data-and-consumer/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/student-to-student-tips-heres-why-use-university-career-services/",
    "https://blog.smu.edu.sg/undergraduate/shared-freshman-voyage-between-parent-child/",
    "https://blog.smu.edu.sg/masters/mitb/driving-effective-data-ready-culture-companies-take-data-driven-approach-business/",
    "https://blog.smu.edu.sg/undergraduate/reflections-kidleidoscope-these-kids-taught-me-stick-dream/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/what-obstacles-getting-singaporean-smes-overseas/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/beneath-singapores-glowing-economy-hides-widening-gender-pay-gap/",
    "https://blog.smu.edu.sg/undergraduate/finger-lickin-good-trip-ho-chi-minh-city/",
    "https://blog.smu.edu.sg/undergraduate/learn-unlearn-conversation-dbs-tan-su-shan/",
    "https://blog.smu.edu.sg/undergraduate/bbm/hello-yogyakarta-lessons-learnt-during-smu-x-overseas-course-indonesia/",
    "https://blog.smu.edu.sg/icli/lcsi/rice-to-the-occasion-david-chen/",
    "https://blog.smu.edu.sg/masters/mitb/the-fintech-revolution/",
    "https://blog.smu.edu.sg/icli/iie/in-search-of-singapores-unicorns/",
    "https://blog.smu.edu.sg/masters/jd/from-sociology-major-to-one-of-singapores-most-influential-lawyers/",
    "https://blog.smu.edu.sg/undergraduate/5-unexpected-industries-that-will-be-bullish-in-2018/",
    "https://blog.smu.edu.sg/masters/mitb/cybersecurity-convenience-can-we-have-all-new-digital-economy/",
    "https://blog.smu.edu.sg/undergraduate/even-highly-effective-people-struggle-when-they-cant-find-balance-at-work/",
    "https://blog.smu.edu.sg/doctoral/how-recent-phd-business-graduates-found-good-academic-placements/",
    "https://blog.smu.edu.sg/masters/going-back-school-might-best-thing-start-up/",
    "https://blog.smu.edu.sg/undergraduate/how-to-be-a-full-time-freelancer/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/is-there-such-thing-delicious-healthy-snacks-amazin-graze-granolas/",
    "https://blog.smu.edu.sg/undergraduate/an-introverts-guide-to-class-participation/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoe/digital-age-widening-inequality-gap/",
    "https://blog.smu.edu.sg/undergraduate/ho-kwon-ping-redefining-concept-mentoring/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/how-found-success-travel-startup-despite-lack-experience/",
    "https://blog.smu.edu.sg/undergraduate/why-grades-arent-everything-university-application/",
    "https://blog.smu.edu.sg/undergraduate/advice-20-year-old-self-conversation-alvin-poh/",
    "https://blog.smu.edu.sg/undergraduate/biking-for-cause-project-bike4change/",
    "https://blog.smu.edu.sg/masters/mitb/functionality-privacy-mobile-applications-whos-going-win-game/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/my-smu-information-systems-freshman-year-quok-juin/",
    "https://blog.smu.edu.sg/undergraduate/what-global-citizenship-how-no-longer-afford-ignore/",
    "https://blog.smu.edu.sg/undergraduate/bbm/when-digital-meets-traditional-royal-artisanship/",
    "https://blog.smu.edu.sg/masters/mqf/moved-from-vietnam-landed-cutting-edge-job-singapore-finance/",
    "https://blog.smu.edu.sg/masters/maf/career-change-tech-consultancy-to-singapore-investment-banking/",
    "https://blog.smu.edu.sg/masters/need-know-your-future-finance-job-singapore/",
    "https://blog.smu.edu.sg/masters/maf/my-prep-route-becoming-fixed-income-analyst/",
    "https://blog.smu.edu.sg/undergraduate/the-art-of-doing-more-with-less/",
    "https://blog.smu.edu.sg/undergraduate/bacc/accounting-study-mission-to-israel-a-reflection/",
    "https://blog.smu.edu.sg/undergraduate/bacc/chat-forbes-30-under-30-shopback-co-founder-lai-shanru/",
    "https://blog.smu.edu.sg/undergraduate/bacc/soa-community-united-for-a-good-cause/",
    "https://blog.smu.edu.sg/icli/iie/blu-here-to-revolutionise-retail-logistics/",
    "https://blog.smu.edu.sg/undergraduate/interview-with-nicole-foo-peek-into-smu-parents-day-2018/",
    "https://blog.smu.edu.sg/doctoral/innovation-the-way-forward/",
    "https://blog.smu.edu.sg/undergraduate/how-pay-off-your-student-loans-early-and-build-your-finances/",
    "https://blog.smu.edu.sg/undergraduate/bbm/how-i-started-my-business-at-19/",
    "https://blog.smu.edu.sg/undergraduate/5-spots-for-a-graduation-trip-that-wont-break-the-bank/",
    "https://blog.smu.edu.sg/undergraduate/bacc/finding-his-voice-and-meeting-his-goal-in-smu/",
    "https://blog.smu.edu.sg/undergraduate/bacc/want-sustainable-business-look-your-accountant/",
    "https://blog.smu.edu.sg/undergraduate/seniors-say-5-must-know-campus-study-spots-at-smu/",
    "https://blog.smu.edu.sg/undergraduate/what-exactly-is-a-specialist-university/",
    "https://blog.smu.edu.sg/masters/mtsc/feeding-singapore-hungry-city-fragile-world/",
    "https://blog.smu.edu.sg/undergraduate/5-wallet-friendly-tips-building-professional-wardrobe/",
    "https://blog.smu.edu.sg/undergraduate/bbm/smu-alumnus-quits-job-co-found-startup-kalpha/",
    "https://blog.smu.edu.sg/masters/msa/valuechampion-david-djapri-msa/",
    "https://blog.smu.edu.sg/undergraduate/bbm/finding-right-hook-their-fresh-coffee-brew/",
    "https://blog.smu.edu.sg/masters/mitb/quantum-computing-is-here-to-stay/",
    "https://blog.smu.edu.sg/undergraduate/blog-5-ways-most-out-exchange-programme/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/busting-myth-hedge-fund-alpha-male/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/the-road-to-working-in-tech-clare-lim-of-salesforce/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smuscis/gig-economy-driving-down-wages/",
    "https://blog.smu.edu.sg/undergraduate/4-ways-gain-global-education-without-leaving-home/",
    "https://blog.smu.edu.sg/undergraduate/bacc/communicating-across-generations-workplace/",
    "https://blog.smu.edu.sg/topics/tech/top-5-segments-rocked-by-iot-2019/",
    "https://blog.smu.edu.sg/undergraduate/bbm/exclusive-interview-pornsak-host-entrepreneur-extraordinaire/",
    "https://blog.smu.edu.sg/undergraduate/bbm/up-close-personal-founder-kindred-teas-madelene-poon/",
    "https://blog.smu.edu.sg/icli/iie/edtech-startup-cudy-takes-new-spin-tuition-classes/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smuscis/should-robot-run-your-investment-portfolio/",
    "https://blog.smu.edu.sg/undergraduate/signs-prove-transitioned-student-full-fledged-grown-up/",
    "https://blog.smu.edu.sg/smu-categories/events/fake-news-is-killing-traditional-journalism/",
    "https://blog.smu.edu.sg/undergraduate/we-are-samba/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/verify-crowdfunding-campaigns-money-goes-genuine-cause/",
    "https://blog.smu.edu.sg/masters/mqf/hiring-manager-told-me-would-never-be-analytical-position-because-background/",
    "https://blog.smu.edu.sg/masters/mitb/chatbots-conversation-killers-makers/",
    "https://blog.smu.edu.sg/icli/bfi/family-businesses-leading-new-age-social-entrepreneurship/",
    "https://blog.smu.edu.sg/undergraduate/bacc/exclusive-with-scaq-exam-top-scorers/",
    "https://blog.smu.edu.sg/masters/mba/my-bank-promoted-me-within-months-getting-my-mba/",
    "https://blog.smu.edu.sg/icli/lcsi/10-movies-and-documentaries-with-an-inclusion-message/",
    "https://blog.smu.edu.sg/masters/msa/automation-threatening-singapore-finance-jobs-heres-how-fight-back/",
    "https://blog.smu.edu.sg/undergraduate/4-pitfalls-avoid-path-becoming-global-citizen/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/down-rabbit-hole-we-go/",
    "https://blog.smu.edu.sg/masters/emba/global-emba-heart-singapore-taken-finance-career-new-levels/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/human-skills-important-technology-industry-4/",
    "https://blog.smu.edu.sg/undergraduate/how-become-citizens-world-4-ways/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/my-smu-economics-freshman-year-karista-khoo/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/more-than-just-managers-enabling-arts/",
    "https://blog.smu.edu.sg/undergraduate/bbm/my-smu-business-freshman-year-haris-lim/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/what-funeral-services-do-statistics-101/",
    "https://blog.smu.edu.sg/icli/livelabs/livelabs-collecting-deep-data-with-mobile-sensors/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/switching-brand-story-telling-story-making-digital-age/",
    "https://blog.smu.edu.sg/undergraduate/bacc/joline-tang-eco-minded-entrepreneur/",
    "https://blog.smu.edu.sg/undergraduate/bbm/breaking-barriers-misconceptions-asean-india-students-exchange-trip/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/google-women-techmakers-scholar-talks-talent-crisis-tech-diversity/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/sponsorship-not-mentorship-key-management-success/",
    "https://blog.smu.edu.sg/smu-categories/alumni/who-says-study-missions-are-only-for-students/",
    "https://blog.smu.edu.sg/masters/mitb/march-of-the-silent-bots/",
    "https://blog.smu.edu.sg/masters/mitb/leveraging-artificial-intelligence-capture-singapore-rideshare-market/",
    "https://blog.smu.edu.sg/topics/tech/insider-tips-managing-your-social-media-identity/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/dance-spectators-perspective-engagement/",
    "https://blog.smu.edu.sg/masters/mpa/from-bachelor-chemistry-joining-big-four-singapore/",
    "https://blog.smu.edu.sg/undergraduate/bacc/how-bootstrapped-and-started-restaurant-for-15000/",
    "https://blog.smu.edu.sg/masters/mitb/disruptive-technology-can-banking-industry-harness-disruption-competitive-edg/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/can-singapore-become-cashless-society/",
    "https://blog.smu.edu.sg/masters/mwm/going-back-to-school-allowed-this-private-banker-to-go-from-strength-to-strength/",
    "https://blog.smu.edu.sg/undergraduate/how-to-build-an-influential-network/",
    "https://blog.smu.edu.sg/undergraduate/truth-getting-high-salary-after-graduation/",
    "https://blog.smu.edu.sg/undergraduate/bacc/working-in-myanmar/",
    "https://blog.smu.edu.sg/undergraduate/bbm/taking-hr-to-the-next-level-with-people-analytics/",
    "https://blog.smu.edu.sg/doctoral/writing-research-papers/",
    "https://blog.smu.edu.sg/undergraduate/want-get-ahead-business-get-chatbot/",
    "https://blog.smu.edu.sg/undergraduate/bacc/perseverance-his-bridge-between-failure-and-success/",
    "https://blog.smu.edu.sg/masters/mqf/ethereum-and-me/",
    "https://blog.smu.edu.sg/undergraduate/bbm/in-conversation-with-barack-obama/",
    "https://blog.smu.edu.sg/undergraduate/bbm/having-fun-is-serious-business/",
    "https://blog.smu.edu.sg/icli/lcsi/overcome-fomo/",
    "https://blog.smu.edu.sg/icli/bfi/breathing-new-life-into-family-firms/",
    "https://blog.smu.edu.sg/icli/lcsi/coming-naught-kickstarting-zero-waste-journey-six-simple-swaps/",
    "https://blog.smu.edu.sg/undergraduate/llb/the-evening-mother-i-first-walked-into-smu-hall/",
    "https://blog.smu.edu.sg/masters/mitb/in-the-know-fear-not-fintech-bondlinc-ek-ong/",
    "https://blog.smu.edu.sg/academic/schools-libraries/yphsol/stopping-fake-news-could-make-freedom-of-speech-more-prevalent/",
    "https://blog.smu.edu.sg/icli/iie/flying-chalks-startup-will-change-experience-studying-abroad/",
    "https://blog.smu.edu.sg/masters/mm/smu-wins-big-in-virtual-case-competition/",
    "https://blog.smu.edu.sg/undergraduate/your-brain-can-use-a-helping-hand/",
    "https://blog.smu.edu.sg/undergraduate/bacc/sporting-team-colours-while-on-exchange/",
    "https://blog.smu.edu.sg/undergraduate/llb/road-ratifying-singapore-convention-smu-x-student-journey/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/my-smu-social-sciences-freshman-year-samantha-lork/",
    "https://blog.smu.edu.sg/icli/iie/carblicity-puts-spin-transit-advertising/",
    "https://blog.smu.edu.sg/undergraduate/wishing-mentor-university-decided-start-mentorship-initiative-juniors/",
    "https://blog.smu.edu.sg/masters/mpa/studying-smu-took-accounting-career-whole-new-level/",
    "https://blog.smu.edu.sg/undergraduate/bacc/my-smu-accountancy-freshman-year-stanley-low/",
    "https://blog.smu.edu.sg/undergraduate/llb/my-smu-law-freshman-year-ong-siew-choo/",
    "https://blog.smu.edu.sg/masters/mitb/the-rise-real-time-retail-payments/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/future-with-technology-mentoring-podcast/",
    "https://blog.smu.edu.sg/undergraduate/bacc/reflections-from-asm-japan/",
    "https://blog.smu.edu.sg/masters/mm/race-finnish-line-nordic-business-design-case-competition/",
    "https://blog.smu.edu.sg/masters/mitb/getting-paypally-with-big-data/",
    "https://blog.smu.edu.sg/undergraduate/bacc/sporting-cause-worth-signing-up-for/",
    "https://blog.smu.edu.sg/undergraduate/f-word-overheard-along-the-concourse/",
    "https://blog.smu.edu.sg/undergraduate/5-point-cheat-sheet-smu-arts-festival-2017/",
    "https://blog.smu.edu.sg/undergraduate/introverts-guide-surviving-university-life/",
    "https://blog.smu.edu.sg/smuacademy/could-the-future-of-work-in-fact-be-human/",
    "https://blog.smu.edu.sg/undergraduate/what-do-you-do-when-job-hunting-tougher-than-you-thought/",
    "https://blog.smu.edu.sg/academic/when-ai-met-blockchain-a-coming-of-two-powers/",
    "https://blog.smu.edu.sg/undergraduate/saying-i-do-all-smu-team-onethreeonefour/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/disrupting-healthcare-sector-one-stepwise-a-time/",
    "https://blog.smu.edu.sg/undergraduate/bacc/an-eye-opener-at-the-ima-leadership-experience-in-san-diego/",
    "https://blog.smu.edu.sg/undergraduate/land-job-lucrative-real-estate-finance-investment-sector/",
    "https://blog.smu.edu.sg/undergraduate/5-dining-spots-around-smu-that-youve-got-to-try/",
    "https://blog.smu.edu.sg/undergraduate/can-passion-pay-the-rent/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/lupping-into-the-future/",
    "https://blog.smu.edu.sg/undergraduate/the-gift-that-keeps-giving/",
    "https://blog.smu.edu.sg/undergraduate/bacc/accounting-careers-of-the-future/",
    "https://blog.smu.edu.sg/academic/institutes/understanding-your-finances-in-time-of-technological-change/",
    "https://blog.smu.edu.sg/masters/4-insider-ways-convert-postgraduate-internship-full-time-job/",
    "https://blog.smu.edu.sg/undergraduate/how-maximise-your-learning-according-time-of-day/",
    "https://blog.smu.edu.sg/icli/isl/societal-leadership-is-the-key-to-aseans-future/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/to-win-on-kickstarter-dont-look-too-innovative/",
    "https://blog.smu.edu.sg/undergraduate/five-buysinglit-books-to-read-besides-your-textbooks/",
    "https://blog.smu.edu.sg/undergraduate/6-best-ways-to-beat-freshman-flab/",
    "https://blog.smu.edu.sg/icli/lcsi/go-to-the-ground-succeed-social-enterprise/",
    "https://blog.smu.edu.sg/masters/the-best-postgraduate-studies-to-take-for-a-mid-career-switch/",
    "https://blog.smu.edu.sg/undergraduate/9-top-reasons-choose-singapore-university/",
    "https://blog.smu.edu.sg/undergraduate/how-well-read-millennial-generation/",
    "https://blog.smu.edu.sg/masters/mhcl/is-human-resources-becoming-less-human/",
    "https://blog.smu.edu.sg/undergraduate/ultimate-cheat-sheet-picking-university-modules/",
    "https://blog.smu.edu.sg/undergraduate/7-essential-skills-you-need-keep-your-job/",
    "https://blog.smu.edu.sg/undergraduate/bbm/an-open-letter-to-incoming-freshmen-signed-sandra/",
    "https://blog.smu.edu.sg/academic/fake-news-finding-truth-avalanche-lies/",
    "https://blog.smu.edu.sg/undergraduate/smu-events-every-freshie-needs-to-check-out/",
    "https://blog.smu.edu.sg/masters/mtsc/changing-business-to-change-the-world-tri-sector-forum-2017/",
    "https://blog.smu.edu.sg/icli/lcsi/bill-drayton-embrace-change-or-toast/",
    "https://blog.smu.edu.sg/undergraduate/5-ways-social-media-can-enhance-your-job-search/",
    "https://blog.smu.edu.sg/doctoral/inspiring-lunch-with-smus-president-professor-arnoud-de-meyer/",
    "https://blog.smu.edu.sg/icli/iie/smu-student-entrepreneur-brings-watch-customisation-next-level/",
    "https://blog.smu.edu.sg/undergraduate/llb/opinion-regardless-of-race-or-religion/",
    "https://blog.smu.edu.sg/undergraduate/waste-not-want-not-redefining-uglies-with-treedots/",
    "https://blog.smu.edu.sg/undergraduate/smu-x-projects-take-chatbots-and-vpas-ministry-foreign-affairs/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/human-resource-leaders-making-great-place-work/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/the-road-less-travelled-my-time-in-peru-dise/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/nudging-consumers-to-reduce-plastic-waste/",
    "https://blog.smu.edu.sg/undergraduate/llb/the-value-of-volunteering/",
    "https://blog.smu.edu.sg/undergraduate/possible-juggle-ccas-and-studies-and-survive/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/how-you-can-build-real-life-sim-city/",
    "https://blog.smu.edu.sg/undergraduate/how-universities-prepare-students-find-work-make-them-happy/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/breaking-the-taboo-cycle-period/",
    "https://blog.smu.edu.sg/undergraduate/scholarships-grants-apply-right-now/",
    "https://blog.smu.edu.sg/undergraduate/5-reasons-hangout-patrons-day-2018-this-friyay/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/venice-kassel-study-mission-arts-and-culture/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/my-smu-social-sciences-freshman-year-chelsea-cheng/",
    "https://blog.smu.edu.sg/undergraduate/llb/what-can-law-students-gain-from-moots/",
    "https://blog.smu.edu.sg/icli/icity/out-of-hospital-and-into-the-home-ageing-transformed-through-tech/",
    "https://blog.smu.edu.sg/undergraduate/future-multidisciplinary-what-consider-choosing-degree/",
    "https://blog.smu.edu.sg/icli/cebcla/good-goods-bad-goods-can-you-really-tell-when-shopping-online/",
    "https://blog.smu.edu.sg/undergraduate/five-inspiring-ted-talks-every-uni-student-should-watch/",
    "https://blog.smu.edu.sg/masters/top-3-traits-millennial-friendly-companies-share/",
    "https://blog.smu.edu.sg/undergraduate/last-minute-year-end-holidays-you-can-actually-afford/",
    "https://blog.smu.edu.sg/undergraduate/totally-unexpected-questions-job-interview-how-ace-them/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/is-asia-creatively-challenged/",
    "https://blog.smu.edu.sg/undergraduate/coping-with-anxiety/",
    "https://blog.smu.edu.sg/acad-support-units/wkwc/seeing-rohingya-crisis-as-whole/",
    "https://blog.smu.edu.sg/icli/cebcla/echo-consumer-protection-perils-lurking-fine-print/",
    "https://blog.smu.edu.sg/undergraduate/ten-top-student-discounts-you-never-knew-existed/",
    "https://blog.smu.edu.sg/undergraduate/the-x-factor-in-smu-x/",
    "https://blog.smu.edu.sg/undergraduate/global-exposure-makes-graduates-more-confident-and-employable/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/my-smu-economics-freshman-year-carissa-chen/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/how-dealt-pressures-being-scholar/",
    "https://blog.smu.edu.sg/academic/integration-key-conquering-industry-disruptions-in-singapore/",
    "https://blog.smu.edu.sg/undergraduate/five-reasons-why-speaking-up-isnt-something-to-fear/",
    "https://blog.smu.edu.sg/masters/mba/how-to-tailor-your-mba-programme/",
    "https://blog.smu.edu.sg/undergraduate/bbm/fn-interns-first-business-trip-to-myanmar/",
    "https://blog.smu.edu.sg/undergraduate/ace-your-next-presentation-with-these-tips/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/my-smu-information-systems-freshman-year-eddie-leow/",
    "https://blog.smu.edu.sg/undergraduate/5-top-hacks-to-survive-the-academic-year/",
    "https://blog.smu.edu.sg/undergraduate/5-businesses-you-can-start-up-from-your-bedroom/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoe/how-china-growth-misunderstood-tale-paradoxes-jin-keyu/",
    "https://blog.smu.edu.sg/undergraduate/4-top-pick-apps-you-need-supercharge-university-life/",
    "https://blog.smu.edu.sg/undergraduate/4-ways-to-beat-freshman-stress/",
    "https://blog.smu.edu.sg/undergraduate/how-stretch-your-dollar-and-live-it-up-city-college/",
    "https://blog.smu.edu.sg/undergraduate/bbm/putting-the-fun-back-in-to-finances/",
    "https://blog.smu.edu.sg/undergraduate/brain-hacks-learn-better-and-raise-your-gpa/",
    "https://blog.smu.edu.sg/undergraduate/bacc/experiencing-hong-kong-through-the-accounting-study-mission/",
    "https://blog.smu.edu.sg/undergraduate/bbm/finding-myself-through-project-triveria-in-vietnam/",
    "https://blog.smu.edu.sg/undergraduate/10-annoying-behaviours-to-avoid-on-linkedin/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/global-community-experience-made-in-harvard/",
    "https://blog.smu.edu.sg/undergraduate/bbm/my-smu-business-freshman-year-norman-tay/",
    "https://blog.smu.edu.sg/masters/juggling-job-part-time-masters-degree-really-do-able/",
    "https://blog.smu.edu.sg/undergraduate/interactive-pedagogy-isnt-just-for-extroverts/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/social-media-influencer-call-him-a-digital-ninja-instead/",
    "https://blog.smu.edu.sg/undergraduate/llb/my-smu-law-freshman-year-lydia-tan/",
    "https://blog.smu.edu.sg/undergraduate/bacc/smu-grads-fight-against-social-division-uk/",
    "https://blog.smu.edu.sg/doctoral/reshaping-perceptions-through-research/",
    "https://blog.smu.edu.sg/undergraduate/bbm/city-dreams-new-york/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/treat-every-meeting-like-once-lifetime-occurrence/",
    "https://blog.smu.edu.sg/undergraduate/llb/uncommon-law/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/innovative-new-major-future-leaders-real-world-problems/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smuscis/internet-things-ethically-speaking/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/when-bus-uncle-met-chatbot-lor/",
    "https://blog.smu.edu.sg/undergraduate/bbm/theres-no-such-thing-too-young-invest/",
    "https://blog.smu.edu.sg/undergraduate/bbm/interview-asnawi-jufrie-smu-business-management-student/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/unexpected-jobs-economics-major/",
    "https://blog.smu.edu.sg/doctoral/5-questions-smu-phd-information-systems-graduate-payas-gupta/",
    "https://blog.smu.edu.sg/undergraduate/bbm/4-lessons-sustaining-online-business-aloysius-refash/",
    "https://blog.smu.edu.sg/undergraduate/how-win-friends-influence-people-even-as-undergrad/",
    "https://blog.smu.edu.sg/undergraduate/bbm/artist-night-how-follow-your-dreams-singapore/",
    "https://blog.smu.edu.sg/undergraduate/common-first-job-tips-you-might-want-to-seriously-reconsider/",
    "https://blog.smu.edu.sg/undergraduate/llb/from-one-smu-parent-to-another/",
    "https://blog.smu.edu.sg/masters/mpa/mpa-voices-creating-opportunities-mpa/",
    "https://blog.smu.edu.sg/masters/mcm/rethinking-design-nordic-business-design-case-competition-2017/",
    "https://blog.smu.edu.sg/undergraduate/streamline-your-cv-supersize-your-job-offers/",
    "https://blog.smu.edu.sg/doctoral/learning-from-best-fulfil-academic-dream/",
    "https://blog.smu.edu.sg/undergraduate/dont-give-up-your-start-up-dreams-studies-vice-versa/",
    "https://blog.smu.edu.sg/undergraduate/5-telltale-signs-of-an-smu-grad/",
    "https://blog.smu.edu.sg/undergraduate/bacc/my-smu-accountancy-freshman-year-mavis-seah/",
    "https://blog.smu.edu.sg/undergraduate/the-cheat-sheet-to-finding-the-perfect-mentor-for-school-or-career-success/",
    "https://blog.smu.edu.sg/undergraduate/llb/law-undergrad-on-a-mission-to-solve-the-worlds-water-crisis/",
    "https://blog.smu.edu.sg/undergraduate/5-reasons-why-ready-for-2018/",
    "https://blog.smu.edu.sg/undergraduate/mind-your-body-language-tips-make-your-audience-listen/",
    "https://blog.smu.edu.sg/undergraduate/enrolling-multidisciplinary-programmes-widen-scope-opportunities/",
    "https://blog.smu.edu.sg/academic/singapore-need-not-fear-chinas-mammoth-belt-road-project/",
    "https://blog.smu.edu.sg/masters/llm/taming-the-machine-liability-responsibility/",
    "https://blog.smu.edu.sg/undergraduate/5-tips-to-effectively-unplug/",
    "https://blog.smu.edu.sg/undergraduate/would-you-follow-me-went-singapore/",
    "https://blog.smu.edu.sg/doctoral/your-essential-checklist-to-getting-into-the-smu-phd-programme/",
    "https://blog.smu.edu.sg/undergraduate/60-seconds-with/",
    "https://blog.smu.edu.sg/undergraduate/10-most-singaporean-things/",
    "https://blog.smu.edu.sg/undergraduate/what-learnt-after-getting-cs-and-ds-during-university/",
    "https://blog.smu.edu.sg/undergraduate/local-going-global/",
    "https://blog.smu.edu.sg/undergraduate/15-minutes-lets-debate/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smulkcsb/take-heed-the-mindfulness-matters/",
    "https://blog.smu.edu.sg/masters/5-ways-women-can-lean-in-disruptor/",
    "https://blog.smu.edu.sg/masters/mi/transforming-the-worlds-halal-dining-experience/",
    "https://blog.smu.edu.sg/undergraduate/5-storytelling-tips-need-writing-killer-cover-letters/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smuscis/entrepreneurs-wanted-singapore-silicon-valley-asia/",
    "https://blog.smu.edu.sg/undergraduate/summer-activities-give-headstart-new-semester/",
    "https://blog.smu.edu.sg/undergraduate/5-tips-picking-major-bank-account-will-love/",
    "https://blog.smu.edu.sg/undergraduate/secrets-interview-follow-ups-extra-edge/",
    "https://blog.smu.edu.sg/undergraduate/what-do-right-now-last-minute-summer-internship/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/chronicles-quanda-ong-interview-founder-gnome-bow/",
    "https://blog.smu.edu.sg/undergraduate/10-signs-entrepreneurship-not-for-you/",
    "https://blog.smu.edu.sg/undergraduate/bbm/world-opportunities-enabled-financial-assistance/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/smu-economics-on-track-for-this-fast-changing-world/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/smu-information-systems-journey-former-ite-student-smu-sis/",
    "https://blog.smu.edu.sg/doctoral/max-factor-learning-about-smu-neighbourhood-maksim-tkachenko/",
    "https://blog.smu.edu.sg/undergraduate/bbm/smu-business-meaningful-lessons-experiences-friendships-aplenty/",
    "https://blog.smu.edu.sg/undergraduate/bacc/smu-accountancy-failure-only-opportunity-discover-success/",
    "https://blog.smu.edu.sg/undergraduate/6-new-awesome-reasons-head-down-smu-open-house-2017/",
    "https://blog.smu.edu.sg/masters/mitb/next-wave-fintech-future-proofing-banks-immense-urgency/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/smu-social-sciences-hardly-mundane-day-found/",
    "https://blog.smu.edu.sg/doctoral/not-quite-business-as-usual/",
    "https://blog.smu.edu.sg/undergraduate/five-ways-your-dream-university/",
    "https://blog.smu.edu.sg/masters/mitb/bold-ambition-singapores-quest-global-fintech-hub/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/how-maximise-university-experience-interview-farah-natalya/",
    "https://blog.smu.edu.sg/academic/schools-libraries/smusoss/managing-skills-challenges-in-asean-5-key-barriers-to-economic-growth/",
    "https://blog.smu.edu.sg/academic/institutes/making-policy-uncertain-times-power-unintended-consequences/",
    "https://blog.smu.edu.sg/masters/emba/banker-executive-mba-serve-clients-even-better/",
    "https://blog.smu.edu.sg/masters/mba/how-my-mba-is-gearing-me-up-for-future-success-in-asian-banking/",
    "https://blog.smu.edu.sg/doctoral/where-smu-phd-students-live/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/social-innovation-smu-sis-students-harnessing-technology-transform-lives/",
    "https://blog.smu.edu.sg/undergraduate/llb/smu-law-hitchhikers-guide-galaxy/",
    "https://blog.smu.edu.sg/academic/smu15-a-retrospective-on-2015/",
    "https://blog.smu.edu.sg/undergraduate/technopreneurship-study-mission-beijing-2015-a-students-perspective/",
    "https://blog.smu.edu.sg/masters/mba/career-services-smu-mba/",
    "https://blog.smu.edu.sg/masters/mba/my-smu-mba-adventure-part-3/",
    "https://blog.smu.edu.sg/undergraduate/asmu-blog-13525-km/",
    "https://blog.smu.edu.sg/undergraduate/summer-stories-2015-gsp2/",
    "https://blog.smu.edu.sg/undergraduate/askasenior-im-feeling-stressed/",
    "https://blog.smu.edu.sg/masters/mba/my-smu-mba-adventure-part-2/",
    "https://blog.smu.edu.sg/undergraduate/asmu-blog-a-different-u/",
    "https://blog.smu.edu.sg/undergraduate/project-unsung-heroes-2015/",
    "https://blog.smu.edu.sg/undergraduate/10-productivity-hacks-studying-smart-working-even-smarter/",
    "https://blog.smu.edu.sg/undergraduate/bbm/shaping-next-generation-workforce-even-before-graduation/",
    "https://blog.smu.edu.sg/undergraduate/bbm/introvert-turned-ambassador-amanda/",
    "https://blog.smu.edu.sg/masters/future-jobs/",
    "https://blog.smu.edu.sg/undergraduate/growing-wiser-age-community-involvement-rachel-tan/",
    "https://blog.smu.edu.sg/undergraduate/time-play-patrons-day-2017/",
    "https://blog.smu.edu.sg/undergraduate/project-sukacita-v-the-climb-towards-better-education-in-indonesia-with-smu-tanoto-scholars/",
    "https://blog.smu.edu.sg/doctoral/insiders-tips-acing-phd-application/",
    "https://blog.smu.edu.sg/undergraduate/why-smu-its-all-about-the-360-experience/",
    "https://blog.smu.edu.sg/undergraduate/protecting-predators-sea-lkcsp-scholars/",
    "https://blog.smu.edu.sg/doctoral/5-quick-questions-to-samantha/",
    "https://blog.smu.edu.sg/undergraduate/20-things-nobody-told-you-about-uni-life/",
    "https://blog.smu.edu.sg/masters/mi/innovation-management-education/",
    "https://blog.smu.edu.sg/undergraduate/llb/making-history-at-the-icc-moot-court-competition/",
    "https://blog.smu.edu.sg/undergraduate/mum-dad-this-is-for-you/",
    "https://blog.smu.edu.sg/undergraduate/lets-get-fresh-smu-arts-festival-2016/",
    "https://blog.smu.edu.sg/masters/mi/team-flycargos-journey-to-asia-venture-challenge-2016/",
    "https://blog.smu.edu.sg/doctoral/welcome-new-phd-students/",
    "https://blog.smu.edu.sg/undergraduate/cca-go-vivace/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/stepping-up-to-help-the-needy/",
    "https://blog.smu.edu.sg/masters/mba/meet-power-couple-mba/",
    "https://blog.smu.edu.sg/undergraduate/6-reasons-global-exposure/",
    "https://blog.smu.edu.sg/undergraduate/taking-road-less-travelled-backstreet-academy/",
    "https://blog.smu.edu.sg/undergraduate/bacc/demystifying-accounting-at-smu-ey-aip/",
    "https://blog.smu.edu.sg/undergraduate/bacc/asm-manila/",
    "https://blog.smu.edu.sg/undergraduate/llb/talk-about-cultural-appropriation/",
    "https://blog.smu.edu.sg/undergraduate/10-reasons-choose-city-campus/",
    "https://blog.smu.edu.sg/undergraduate/bigger-hearts-smaller-world-air-ambers-beginnings/",
    "https://blog.smu.edu.sg/undergraduate/point-university-education/",
    "https://blog.smu.edu.sg/undergraduate/venturing-into-wanderland/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/smu-young-entrepreneur-empowers-children-regionally-with-tech-literacy/",
    "https://blog.smu.edu.sg/masters/mba/3-reasons-that-got-me-started-on-my-smu-mba-journey/",
    "https://blog.smu.edu.sg/doctoral/is-the-phd-world-for-me/",
    "https://blog.smu.edu.sg/icli/iie/moolahsense-ceo-crowdfunding-entrepreneur/",
    "https://blog.smu.edu.sg/undergraduate/bbm/fundnel-is-brainchild-of-smu-alumnus/",
    "https://blog.smu.edu.sg/undergraduate/technopreneurship-adventures-in-kimchi-land-korea-2016/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/undergraduates-tap-on-geospatial-analytics-for-business-intelligence/",
    "https://blog.smu.edu.sg/undergraduate/financial-freedom-in-your-20s-is-not-a-myth/",
    "https://blog.smu.edu.sg/undergraduate/advice-for-the-discretionarily-admitted-student/",
    "https://blog.smu.edu.sg/undergraduate/innovation-made-in-germany-reflections-on-bsm-germany-2015/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/hear-from-a-student-smu-school-of-information-systems/",
    "https://blog.smu.edu.sg/undergraduate/entrepreneurship-arts/",
    "https://blog.smu.edu.sg/undergraduate/dont-just-read-about-it-from-the-website-visit-our-open-house/",
    "https://blog.smu.edu.sg/undergraduate/choosing-a-university-how-do-i-make-the-most-of-my-open-house-trip/",
    "https://blog.smu.edu.sg/undergraduate/bbm/hear-from-a-student-6-truths-you-need-to-know-about-smu-business/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/hear-from-a-student-the-best-of-both-worlds-smu-and-economics/",
    "https://blog.smu.edu.sg/undergraduate/bacc/hear-from-a-student-why-id-choose-smu-accountancy-all-over-again/",
    "https://blog.smu.edu.sg/undergraduate/exchange-lessons-learning-to-venture-out-of-my-comfort-zone/",
    "https://blog.smu.edu.sg/undergraduate/project-vikasa-through-the-eyes-of-the-women-of-india/",
    "https://blog.smu.edu.sg/undergraduate/llb/my-law-study-mission-hong-kong-style/",
    "https://blog.smu.edu.sg/undergraduate/ways-get-personalised-university-education/",
    "https://blog.smu.edu.sg/undergraduate/bacc/qa-interview-with-kai-yang-lee-smu-accountancy-student/",
    "https://blog.smu.edu.sg/undergraduate/bbm/we-need-talk-alex-chow-breaks-silence-action-for-aids/",
    "https://blog.smu.edu.sg/undergraduate/bbm/interview-justin-bay-smu-business-management-accountancy-student/",
    "https://blog.smu.edu.sg/undergraduate/bbm/appetite-disruption-interview-smupreneurs-kaushal-raghav/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/interview-jaren-lim-smu-information-systems-student/",
    "https://blog.smu.edu.sg/masters/llm/artificial-intelligence-implications-commercial-law-asia/",
    "https://blog.smu.edu.sg/undergraduate/top-students-reveal-how-pick-university-rankings-play-small-part/",
    "https://blog.smu.edu.sg/undergraduate/5-tips-ace-your-admissions-interview/",
    "https://blog.smu.edu.sg/doctoral/training-future-professors-smu-phd-way/",
    "https://blog.smu.edu.sg/masters/mi/kopi-tiams-creative-incubators/",
    "https://blog.smu.edu.sg/undergraduate/llb/ask-a-student-why-smu-school-of-law/",
    "https://blog.smu.edu.sg/undergraduate/smu-peer-helpers-students-helping-students/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/ask-a-student-why-smu-school-of-social-sciences/",
    "https://blog.smu.edu.sg/undergraduate/im-a-globetrotter/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/ask-a-student-why-smu-school-of-information-systems/",
    "https://blog.smu.edu.sg/undergraduate/all-about-being-little-miss-librarian/",
    "https://blog.smu.edu.sg/undergraduate/bsc-econ/ask-a-student-why-smu-school-of-economics/",
    "https://blog.smu.edu.sg/undergraduate/ug-what-do-employers-look-for/",
    "https://blog.smu.edu.sg/undergraduate/everest-community-outreach/",
    "https://blog.smu.edu.sg/undergraduate/why-must-we-do-80-hours-of-community-service/",
    "https://blog.smu.edu.sg/masters/mba/gunning-for-a-career-in-consulting/",
    "https://blog.smu.edu.sg/masters/mba/mba-marketing-club-how-luxola-keeps-customers-coming/",
    "https://blog.smu.edu.sg/undergraduate/four-survival-tips-for-smu-freshies/",
    "https://blog.smu.edu.sg/undergraduate/why-is-a-cover-letter-important/",
    "https://blog.smu.edu.sg/undergraduate/upclose-with-sukanto-tanoto/",
    "https://blog.smu.edu.sg/undergraduate/volunteering-at-assisi-hospice/",
    "https://blog.smu.edu.sg/masters/a-triathletes-journey/",
    "https://blog.smu.edu.sg/undergraduate/bacc/sea-games-athletes-soa/",
    "https://blog.smu.edu.sg/undergraduate/all-in-the-family-smu-siblings-koi-foong-and-yan-yan/",
    "https://blog.smu.edu.sg/undergraduate/bsocsc/smu-alumni-jack-sai-kopi-stall/",
    "https://blog.smu.edu.sg/undergraduate/the-unofficial-back-to-school-checklist/",
    "https://blog.smu.edu.sg/undergraduate/my-photography-passion/",
    "https://blog.smu.edu.sg/masters/mba/deckie-he-dong-four/",
    "https://blog.smu.edu.sg/masters/mi/innovation-coaching/",
    "https://blog.smu.edu.sg/undergraduate/bsc-is/is480-a-rite-of-passage/",
    "https://blog.smu.edu.sg/masters/mba/deckie-he-dong-3/",
    "https://blog.smu.edu.sg/masters/mba/labhoise-part-time-smu-mba/",
    "https://blog.smu.edu.sg/undergraduate/taking-the-path-less-travelled-my-startup-internship/",
    "https://blog.smu.edu.sg/masters/mi/reflections-on-my-entrepreneurial-journey/",
    "https://blog.smu.edu.sg/undergraduate/the-5-things-you-didnt-think-youd-miss-about-smu-but-you-did/",
    "https://blog.smu.edu.sg/undergraduate/all-about-being-a-gym-instructor/",
    "https://blog.smu.edu.sg/undergraduate/llb/my-international-moot-experience-at-vis-east-2015-part-1/",
    "https://blog.smu.edu.sg/undergraduate/llb/my-international-moot-experience-at-vis-east-2015-part-2/",
    "https://blog.smu.edu.sg/undergraduate/sailing-for-singapore-terena-lam/",
    "https://blog.smu.edu.sg/undergraduate/an-empire-state-of-mind-musings-from-business-study-mission-new-york/",
    "https://blog.smu.edu.sg/undergraduate/all-that-glitters-is-blue-and-gold-university-student-life-awards-2015/",
    "https://blog.smu.edu.sg/masters/mi/playing-the-medici-trick-to-innovate/",
    "https://blog.smu.edu.sg/undergraduate/community-service-goes-underwater-project-reef-alert/",
    "https://blog.smu.edu.sg/undergraduate/a-cheat-sheet-to-smu-jargon/",
    "https://blog.smu.edu.sg/masters/mba/mba-journey-class-family/",
    "https://blog.smu.edu.sg/undergraduate/6-uber-updates-to-the-li-ka-shing-library/",
    "https://blog.smu.edu.sg/undergraduate/making-waves-chasing-the-sun/",
    "https://blog.smu.edu.sg/masters/mba/kj-mba-part-1/",
    "https://blog.smu.edu.sg/undergraduate/askasenior-project-meetings/",
    "https://blog.smu.edu.sg/undergraduate/bacc/accounting-immersion-camp-2015/",
    "https://blog.smu.edu.sg/undergraduate/bacc/sea-games-athletes-soa-ii/",
    "https://blog.smu.edu.sg/undergraduate/from-student-to-teacher/",
    "https://blog.smu.edu.sg/masters/mba/spreading-my-wings-in-singapore/",
    "https://blog.smu.edu.sg/undergraduate/summer-stories-2015-global-exposure-without-leaving-home/",
    "https://blog.smu.edu.sg/undergraduate/how-should-i-choose-ocsp/",
    "https://blog.smu.edu.sg/undergraduate/hubert-music-artiste/",
    "https://blog.smu.edu.sg/undergraduate/askasenior-internship/",
    "https://blog.smu.edu.sg/undergraduate/reflections-myanmar-accounting-study-mission/",
    "https://blog.smu.edu.sg/undergraduate/presentation-tips-young-savvy-panelist/",
    "https://blog.smu.edu.sg/undergraduate/journey-ironman-70-3-world-championship/",
    "https://blog.smu.edu.sg/undergraduate/bacc/ask-a-student-why-smu-school-of-accountancy/",
    "https://blog.smu.edu.sg/undergraduate/passionate-about-serving-why-smu-students-look-forward-to-giving-back/",
    "https://blog.smu.edu.sg/undergraduate/university-admissions-vocabulary-102/",
    "https://blog.smu.edu.sg/undergraduate/university-admissions-vocabulary-101/",
    "https://blog.smu.edu.sg/masters/mba/smu-mba-willis/",
    "https://blog.smu.edu.sg/undergraduate/student-life-at-smu-a-co-curricular-activities-cca-primer/",
    "https://blog.smu.edu.sg/undergraduate/how-to-be-a-super-intern/",
    "https://blog.smu.edu.sg/masters/team-dinggo-2015/",
    "https://blog.smu.edu.sg/undergraduate/that-beautiful-freshman-year/",
    "https://blog.smu.edu.sg/undergraduate/smu-the-inside-scoop-part-2-2/",
    "https://blog.smu.edu.sg/undergraduate/smu-the-inside-scoop-part-1/",
    "https://blog.smu.edu.sg/undergraduate/the-perks-of-studying-in-a-city-campus/",
    "https://blog.smu.edu.sg/undergraduate/keeping-fit-at-smu/",
    "https://blog.smu.edu.sg/undergraduate/bbm/ask-a-student-why-smu-lee-kong-chian-school-of-business/",
    "https://blog.smu.edu.sg/undergraduate/smu-open-house-2015-day-1-highlights/",
    "https://blog.smu.edu.sg/undergraduate/smu-labs-a-different-way-to-learn/",
    "https://blog.smu.edu.sg/undergraduate/5-types-of-project-groupmates-you-may-encounter/",
    "https://blog.smu.edu.sg/undergraduate/overseas-exchange-an-adventure-of-self-discovery/",
    "https://blog.smu.edu.sg/masters/mba/smu-mba-masaki/",
    "https://blog.smu.edu.sg/undergraduate/paying-it-forward-project-sukacita/",
    "https://blog.smu.edu.sg/undergraduate/stressbusting-strategies-for-students/",
    "https://blog.smu.edu.sg/undergraduate/how-to-choose-your-university/",
    "https://blog.smu.edu.sg/masters/mba/survival-guide-part-time-smu-mba/",
    "https://blog.smu.edu.sg/undergraduate/who-do-smu-students-hope-to-work-for/",
    "https://blog.smu.edu.sg/undergraduate/interview-tips-101-lets-talk-about-body-language/",
    "https://blog.smu.edu.sg/undergraduate/the-5-types-of-smu-students/"
  ]
}
