{
  "documents": [
    "SMU has the Co-ciricular Activity (CCA): SMU Ardiente Latin ballroom dance club specialising in cha-cha, samba, rumba, paso doble and jive.ardiente@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Artdicted Visual arts club offering experiential opportunities through workshops, art jams and an annual arts exhibition. artdicted@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Ballare Ballroom dance club specialising in quickstep, tango, foxtrot, waltz and Viennese waltz. ballare@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Broadcast & Entertainment Media centre specialising in campus radio, campus TV, artiste management, and events and backstage support. smube@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Caderas Latinas Salsa dance club specialising in competitive and recreational salsa dancing. caderaslatinas@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Chamber Choir Choral ensemble that performs competitively and at events. chamberchoir@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Chinese Orchestra Orchestral ensemble promoting the appreciation of classical and contemporary Chinese music. smuco@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Eurhythmix Hip-hop dance club promoting the passion for street dance. eurhythmix@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Funk Movement Street-style dance club specialising in signature funk moves.funkmovement@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Guitarissimo Ensemble for classical and Niibori guitar enthusiasts. guitarissimo@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU INDANCITY Contemporary dance club focused on mastery of technique and expression of the art form. indancity@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Indian Cultural Society Appreciation club promoting India’s rich culture and heritage through the arts. ics@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Ivory Keys Piano ensemble dedicated to musical technique and artistic excellence. ivorykeys@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Komunitas Indonesia Appreciation club promoting Indonesia’s diverse culture and heritage through the arts. smuki@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Literati Appreciation club promoting the literary arts. literati@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Music Interactive Club Pop music club and song-writing club.mic@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Persadamu Appreciation club promoting Malay language and culture through the arts. mlcc@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMUSAIC Photography club offering experiential opportunities through workshops, photo walks and annual exhibitions. smusaic@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Samba Masala Percussion club specialising in Brazilian samba music fused with funk, afro and local ethnic rhythms. samba@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU SoundFoundry Music club for indie bands, and jazz and rock musicians who meet for regular jam sessions. soundfoundry@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU StageIT Theatre club offering experiential opportunities through workshops and annual productions. stageit@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Stereometa Club for amateur disc jockeys on campus. stereometa@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Symphonia Symphonic club for wind and string instruments. symphonia@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Voix A capella music club specialising in singing without musical accompaniment. smuvoix@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): International Connections (ICON) A network of 12 clubs managed by SMU’s highest student political body, SMU Students’ Association. ICON celebrates SMU’s cultural diversity and caters to both local and international students. icon@sa.smu.edu.sg consisting of: Al Khaleej (Middle East),Apsara Cambodia (Cambodia),Chao Vietnam (Vietnam),Connect China (China),Francophiles (France),Japanese Cultural Club (Japan),SMU Barkada (Philippines),SMU Myanmar Community (Myanmar),SMU Roots (Singapore),Truly Malaysia (Malaysia),Woori Sayi (Korea)and Yim Siam (Thai)\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Aikido aikido@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Aquathlon Endurance sports and triathlon training club. aquathlon@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Aquatic Sharks Swimming and water-polo club. aquaticsharks@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Archery archery@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Badminton badminton@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Basketball basketball@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Bowling bowling@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Climb Team Indoor rock climbing club. climb@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Cuesports 9-ball pool club. poolclub@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Dragonboat smudragonboat@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Fencing fencing@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Floorball smufloorball@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Golf golfclub@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Handball smuhandball@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Judo judo@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Kendo kendo@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Muay Thai muaythai@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Netball netball@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Rugby rugby@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU RunTeam smu_runteam@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Sailing sailing@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Soccer (Men) smusoccer@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Soccer (Women) womensoccer@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Softball softball@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Squash squash@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Taekwondo smutkd@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Tchoukball smutchoukball@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Tennis tennis@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Touch Football (Women) touchfootball@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Track & Field tracknfield@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Ultimate Frisbee smuufc@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Volleyball volleyball@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Wakeboarding wakeboarders@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Windsurfing windsurfing@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Wushu wushu@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMUX Biking Team biking@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMUX Diving Team diving@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMUX Kayaking Team kayaking@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMUX Skating Team skating@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMUX Trekking Team trekking@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMUX Xseed Team Extreme sports club. xseed@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU AIESEC International student organisation for leadership development and volunteer exchange experiences aiesec@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Barworks Bartending and cocktail mixing club. barworks@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Conjunct Consulting Pro bono consultancy services club. smuconjunct@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Debating Society smuds@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU E-Sports Online gaming club. smuesports@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU FitnessWorks Fitness and health club. fitnessworks@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Gourmet Club Culinary appreciation club. gourmet@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU I-Sports Social table gaming club. recregaming@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Mixed Martial Arts (SMU MMA) smumma@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU People for Animal Welfare (PAW) Animal rights activist club. paw@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Real Business Student entrepreneurship club. smurealbusiness@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Recreational Fishing smurf@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Strategica Board games club. strategica@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): UN Students’ Association (UNSA-SMU) Student organisation promoting international cooperation. unsa-smu@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Toastmasters Public speaking club. smutm@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Verts Environmental activist club. smuverts@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Wine Appreciation Club smuwa@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Women's Connection Women’s networking club. swc@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU BP Mentoring Mentorship training club. smu_mentoring@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Caretalyst Social activist club. caretalyst@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Habitat for Humanity Housing and child welfare activist club. smuhabitat@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Red Cross Youth Chapter Humanitarian activist club. redcross@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Rotaract Club Youth development club. smurotaract@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Uni-Y Volunteerism and community leadership club. uniymca@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Apolitical Political association.apolitical@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Christian Fellowship smucf@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU CRU Inter-denominational Christian ministry. smucru@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Dhamma Circle Buddhist society. smudhammacircle@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Fides Catholic community. fides@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Muslim Society Parent club of SMU’s Islamic Business and Finance Society. smums@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Sikhs Inc Sikh community. sikhs.inc@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Students’ Association smusa@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Arts & Cultural Fraternity (ACF) Non-school constituent body focused on arts and culture. artsncultural@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Special Interest & Community Services Sodality (SICS) Non-school constituent body focused on special interests and community services.SICS@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Sports Union (SSU) Non-school constituent body focused on sports and adventure. ssu@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Xtremists (SMUX) Non-school constituent body focused on extreme sports. xtremists@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Accounting Society (ASOC) School of Accountancy constituent body. accsoc@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Business Society (Bondue) Lee Kong Chian School of Business constituent body. bonduer@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Economics Society (Oikos) School of Economics constituent body. economics@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU School of Information Systems Society or Ellipsis (SISS) School of Information Systems constituent body. issociety@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Law Society (The Bar) School of Law constituent body. smulawsociety@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Social Sciences Society (SOSCIETY) School of Social Sciences constituent body. ss_soc@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Ambassadorial Corp Student public relations body. asmu@sa.smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Assurance and Advisory Team Functional student body promoting compliance and financial transparency among the student clubs. saat@smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): Campus Cohesion Council Functional student body focused on nurturing a cohesive and collegial campus environment. cohesion@smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): SMU Peer Helpers Student counsellors’ community. peerhelpers@smu.edu.sg\n",
    "SMU has the Co-ciricular Activity (CCA): Student Council of Discipline Functional student body promoting SMU’s CIRCLE Values. scd@smu.edu.sg"
  ],
  "sources": [
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf",
    "https://www.smu.edu.sg/sites/default/files/smu/campus-life/%5BPDF%5D%20Clubs%20and%20Societies%20v4.pdf"
  ]
}
