{
  "documents": [
    "Do I need to pay fees if I withdraw from the school? If the withdrawal is effected within the first 2 weeks of the term, tuition fees charged would be reversed. If the withdrawal is effected from week 3 onwards, tuition fees charged would be payable and there will be no refund.The effective date for all applications will be based on the application date. Students who are granted LOA must settle all outstanding fees before going for their leave.If the withdrawal is effected from week 3 onwards, tuition fees charged would be payable and there will be no refund.",
    "Do I need to pay tuition fees if I applied for LOA after term starts? If LOA is effected from week 3 onwards, fees charged are payable and there are no refund.",
    "Do I need to pay tuition fees if I applied for LOA before term starts? If LOA is effected within the first 2 weeks of the term, tuition fees charged would be reversed.",
    "Do I need to pay tuition fees if I applied for LOA? If the LOA is effected within the first 2 weeks of the term, tuition fees charged would be reversed. If the LOA is effected from week 3 onwards, tuition fees charged would be payable and there will be no refund.The effective date for all LOA applications will be based on the application date. Students who are granted LOA must settle all outstanding fees before going for their leave.Annual Fees are still payable for Students who have successfully applied for LOA.",
    "I qualify for Tuition Fee Loan (TFL) and Study Loan (SL). However, I still require further financial assistance to pay my tuition fee/living expenses. Is there another loan scheme I can consider? If you have exhausted all means under the TFL/SL schemes (including living allowance) but still require further financial assistance for living expenses or pay the balance tuition fee, you can consider applying for the SMU Education Loan.For further information and application, please go to SMU Education Loan located on the Financial Assistance Schemes website http://www.smu.edu.sg/about/financial/smu-education-loan",
    "Is annual fees payable if I I applied for LOA?  ***Annual Fees are still payable for Students who have successfully applied for LOA.",
    "Can I ask someone else to collect the equipment on my behalf? You may authorized another student to collect the equipment on your behalf. Please do so by filling in the name of the collector on the form. However, please note that the responsibility rests with the borrower with regard to loss and damage.",
    "Do you need my student ID in order to loan OSL equipments? Yes for verification purpose.",
    "How do I know my loan of equipment is approved? You will receive an email from a staff stating if equipment is available (or not) and when you should come to sign it out. It may take about 3 days to process your request so do plan ahead and submit your loan request form in advance. If you do not receive a confirmation email, please contact studentlife@smu.edu.sg",
    "How do I loan the equipment? Please submit the completed equipment loan form into the drop box outside the OSL Office at least 3 working days in advance.",
    "I am busy. Can I book over the phone or email? Unfortunately, equipment cannot be booked over the phone or email. Email only available to SMUSA club and I am unsure why. So not sure how to answer this question. I am open to having it on the website so students can submit over the email.",
    "What day and time can I collect my equipment? Monday to Friday, 9.00am to 12.00pm, 2.00pm to 5.00pm at the Office of Student Life.",
    "What equipment is available for loan? Exhibition panels, extension cords, loud hailer, projectors, projector screens, digital and printer stopwatches, table cloth/skirting & clips, trolleys, tripod, video camera, and walkie talkies.",
    "What if I return my equipment later than the stipulated date? Equipment that is not returned on time may cause inconvenience to the next user and will result in the club being barred from future loans.",
    "What if my event is on a Saturday? You can arrange to collect the equipment on Friday and return on the following Monday.",
    "What if the equipment is spoilt or lost? All loaned equipment must be returned in good working condition. Lost or damaged equipment shall be replaced at the club’s expense. In addition, the club will be barred from future loans.",
    "Who can loan the OSL equipments? The OSL equipment loan service is primarily to support its student clubs’ events and activities. Equipment is only available for loan to SMU students with priority given to OSL student clubs’ members. Loan is subject to availability and is handled on a first come first serve basis.",
    "Who to contact for further queries regarding asset loans? Please contact the Office of Student Life at studentlife@smu.edu.sg for other queries not found in the FAQ.",
    "Why is there a need to retain my ID? Retention of ID (student, IC, driving license) is necessary during the loan period as a source of guarantee?  In case if students don’t return the equipment or spoil the equipment or something…?  Sorry, no one quite explain to me properly.",
    "Can I request for graduation certification letter if I am not on final term? Graduation certification letter would only be issued to those who filed for graduation.",
    "Can I still request for graduation certification letter if I am waiting for the official graduation? Yes, you may still request for graduation certification as long as you have not receive your Conferment Letter.",
    "Can the softcopy of my academic summary be sent to me? We do not provide softcopy of academic summary. Students are required to personally collect the academic summary.",
    "Do I need to inform the school that I have changed my personal data? Students have a responsibility to ensure that all personal information is updated and correct at all times.The information indicated below are deemed \" critical personal data \" and cannot be updated via self-service. To update such data, you are required to present to Office of Registrar the relevant original documents as follows: Official Change of Name: - New NRIC; and - Deed Poll Official Change of Citizenship: To Singapore Citizen - New NRIC/Passport; and/or - Citizenship Certificate To Singapore PR - NRIC; and - Passport; and - Re-entry Permit Renewal of Official Documents: - New Passport - New Re-entry Permit (SPR) - New Student PassYou may update the following \"non-critical personal data\" via OASIS:Demographic InfoMarital StatusAddressesPhone NumbersEmail AddressesEmergency ContactsReligion",
    "I am a foreigner and I lost my green student pass. I need a letter from SMU to be brought to ICA for a new student pass.Requests for certification letters can be made at OASIS> Finance & Admin> Certification & Personal Info. Choose letter type: Stud enroll ltr (lost ICA pass). Students are required to make a police report and bring it along with this letter to ICA for a student pass replacement.",
    "I have changed my citizenship sometime back and forgotten to update the school, what should I do? Please bring all the relevant original documents to Office of Registrar for verification:From Student Pass changed to Singapore PR - NRIC; and - Passport; and - Re-entry PermitFrom Singapore PR changed to Singapore Citizen - New NRIC/Passport; and/or - Citizenship Certificate Note: Effective date will be the date which students present their official documents to Office of Registrar. Any adjustment on the tuition fees will be made if the effective date is before the start of academic term. Otherwise, the fee adjustment will take effect from the following academic term(s).",
    "I have completed all coursework requirements but my internship and/or community service and/or exchange grades still pending. Would this reflect on the graduation certification letter? Yes, it will reflect on the letter as long as internship and/or community service and/or exchange grades still pending in the system.",
    "I have printed my unofficial transcripts and wished for it to be stamped ‘certified true copies’ can this be done? We do not stamped ‘certified true copies’ on unofficial academic summary. We would advised students to request for the official academic summary as it will be printed on SMU letterhead and is signed by one of the administrators.",
    "I need a letter by SMU stating internship is a requirement to complete the degree programme. Where can I get this letter? Requests for certification letters can be made at OASIS> Finance & Admin> Certification & Personal Info. Choose letter type: Stud enroll ltr (inc. internship Reqm).",
    "I need a letter by SMU stating that I am a student in SMU. Where can I get this letter? Requests for certification letters can be made at OASIS> Finance & Admin> Certification & Personal Info. Choose letter type: Student enrolment status.",
    "I need a letter by SMU stating the schedules of academic events (exams and vacation). Where can I get this letter? Requests for certification letters can be made at OASIS> Finance & Admin> Certification & Personal Info. Choose letter type: Stud enroll ltr (inc. acad cal).",
    "I need the transcripts to be sealed. Can this be done? Sealed envelope services are available. However, we need to know what is the need for a sealed envelope usage for.",
    "My student pass is going to expire, what should I do? Student must present the original Passport & Student Pass to the Office of Registrar, Level 8, Administration Building for student pass renewal.The Office of Registrar will submit the application and inform you of the SOLAR (Student's Pass On-Line Application and Registration) application number within 3 working days via email. Student will have to log on to the SOLAR system from the Immigration & Checkpoints Authority website with your assigned SOLAR application number. Once you have logged on to the system, you may proceed to complete the Student's Pass application form (Form 16) and submit the application online to ICA for processing.The Office of Registrar will inform you of the outcome of your application within a week. Note: Upon collection of your new student pass, please bring it to Office of Registrar for system update.",
    "Where can I obtain an official academic summary? Requests can be made for academic summary at OASIS> Academics> Examination & Results> Request for academic summary. Request made before 4pm will be available for collection after 2pm on the next working day. Requests made after 4pm will be available for collection after 2 working days. Maximum number of copies per request is three, if more than 3 copies are need, please submit multiple requests.",
    "Where do I go to request for a certification letter? Requests for certification letters can be made at OASIS> Finance & Admin> Certification & Personal Info.",
    "Where can I get FAQ on Tuition Fees and Financial Aid? Please go to:https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aidfor FAQ on Tuition Fees and Financial Aid.",
    "Can I change the photograph on my SMU student card? For any defaced or a change of photograph, a payment of $35 will have to be made.",
    "Can I submit a softcopy of my photograph? Currently, any re-taking of photograph has to be made at Office of Registrar. Once the form has been submitted, email:registrar@smu.edu.sgfor re-taking of photograph schedule.",
    "How do I enter the premises with no card? You have to make a daily exchange pass with your IC/student pass to the designated school/facilities at the security post.",
    "How long will the new card be processed? It will take three working days, from the date the form is submitted to the Office of Registrar.",
    "How to determine if the card is faulty? Bring your card to be checked by Security Command Center (SCC); further assessment is needed by Office of Registrar. A replacement fee will be charged if the card is found to have scratches, crack lines, bent/chipped, barcode label is fading, etc.",
    "Is the payment refundable? No, the fee is not refundable.",
    "What should I do if I lost my SMU student card? Report the loss to Office of Facilities Management, SMU Library and Office of Registrar to have your card blocked from any unauthorised usage. Proceed to apply for a card replacement. You are advised to wait for a few days for the return of your loss card as once payment has been made, it is not refundable.",
    "What should I do if my SMU student card is damaged? Download the Card Replacement form through OASIS > Finance & Admin > Student Cards & Passes > SMU Student Card Replacement. Payment to be made and attach the receipt to the form. Submit the form to Office of Registrar.",
    "Where can I find the Card Replacement Form? Download the form through OASIS > Finance & Admin > Student Cards & Passes > SMU Student Card Replacement.",
    "Where can I make payment for Student Card Replacement? Payment can be made at the Student Services Hub, located opposite Dental@Uni, between 10:00 am and 5:00 pm (Monday to Friday, except public holidays).",
    "After I have filed for graduation, will I be able to take additional courses in the next term? Filing for graduation is the process whereby a graduating student makes a formal \"application\" in advance to graduate. It is done in the final term of course work which, in other words, is the final term in which students are taking courses (including additional courses). No courses are to be registered after students have filed for graduation and students cannot reverse their graduation filing to take additional courses after they have filed. Therefore, please plan carefully and make a firm decision.",
    "Can I attend Commencement for the year that I graduated? Students who graduated under Term 1, Term 2, Modified Term 2 and Term 3A would be able to attend the current year of Commencement. Students who graduated under Term 3B (on current academic year) can only attend following year’s Commencement.",
    "How do I apply/file for graduation? Simply proceed to OASIS> Academic> Graduation> File for Graduation during the file for graduation window periods. Bear in mind the deadlines. Follow the instructions therein accordingly. Basically, you will be required to check the courses you have completed and are taking in the final term. After confirming and verifying your plans, you simply click a button to file for graduation.",
    "I am not taking anymore courses but have not file for graduation. What should I do if I receive billing for school fees from Finance? If you are on graduating list, you will not receive anymore billing from Office of Finance. If you do, please e-mail to Office of Registrar for verification.",
    "I have received my Conferment Letter. I need my degree scroll and official transcript urgently for interview/graduates, PR applications.As all SMU scrolls are sent to secure printer for printing, the collection date stated on the Conferment Letter is the earliest date graduands can collect from the Office of Registrar. However, graduands can submit the request for graduation certification letter and academic summary through:• Academic summary: OASIS > Finance & Admin > Enrolment Letter & Academic Summary > Certification Letter Request App• Graduation certification letter: OASIS > Finance & Admin > Enrolment Letter & Academic Summary > Certification Letter Request App (letter type: graduation status certification letter)",
    "If I intend to go on exchange in the final term, do I still file for graduation in the final term? With effect from September 2009, students are not allowed to go on exchange in their final term. For more information, please refer to OASIS > Academic > Advisement & Curriculum > Credit Transfer Policy.",
    "If I just miss the cut-off date for graduation, and my graduation is pushed to the next cycle, can I get proof that I have completed my degree? If you have completed all the degree requirements and have to wait for the next graduation exercise, you may request the Office of Registrar for a letter of certification pending the issue of the degree scroll / transcript. The letter basically certifies that you have completed the degree requirements, and is usually acceptable as evidence that a degree will be awarded.",
    "May I change/postpone my graduation term after I have filed for graduation? Once you have filed for graduation, it is irreversible. Please plan carefully and make a firm decision. So long as all the degree requirements are met, you will be on the list of graduating students for the term that you filed for.",
    "May I file for graduation only after getting my final term results and still graduate in that term? No, you must file for graduation in advance. If you decide to graduate only after getting your final term results, you can only file for graduation the next term, even though you may not be taking any course. Filing for graduation in advance allows time for verification of records. It also enables students and the schools to plan ahead, given the constraints of various resources and time.",
    "May I attend classes after I graduate? After you graduate, you may not attend classes. You are welcome to apply for admission in graduate programmes.",
    "There is a cross on my internship or/and community service on my degree progress report. However, this is my final term of coursework. Am I eligible to file for graduation? Any outstanding of internship or/and community service would not have any impact on your filing for graduation. However, any outstanding internship or/and community service would affect your graduation ultimately. Please approach Dato' Kho Hui Meng Career Centre (DKHMCC) on your outstanding internship and Centre for Social Responsibility (C4SR) regarding community service matters.",
    "What if I miss the deadline?  What if I do not file for graduation and wish to take additional courses in the next term? If you miss the deadline to file for graduation, you will have to file in the next term, even though you may not be taking any courses then. If you do not file for graduation, you will not graduate, and you will not get your degree scroll or transcript, even though you may have completed all your degree requirements.",
    "When do I file for graduation? The window periods to file for graduation tie in with the close of the final round of BOSS each term (during Week 3 to 6). You must file for graduation in advance in your final term. The deadline to file for Graduation is available in OASIS > Academics > Graduation> File for Graduation. You should file for graduation so long as you are in your final term, even though you may not have completed your community service / internship.",
    "When exactly do I become a graduate? Officially, students will graduate when they have completed all the degree requirements (including compulsory non-coursework requirements such as finishing touch, community service, internship, etc.) and their respective Deans clear them for graduation. The day the Dean clears the graduation list is the graduation date. This is the date (degree award date) reflected in the transcript and degree scroll. The expected graduation date is in the 4th / 5th week after the term. The Deans clear the graduation lists at only 4 fixed times a year, not as and when the students fulfill all their degree requirements.",
    "Will the students who have graduated still have access to their school email account?  Is there a time limit to the access? Student's mailbox is permanent which means you can still access to your school email account after you graduated. You may wish to take note of the following:• The access to facilities/buildings/library will cease 4 weeks from the official graduation date.• The access to intranet/OASIS will cease 8 weeks from the official graduation date, The function to generate unofficial transcript/degree progress report in OASIS will cease immediately upon the official graduation.",
    "What if I do not clear all my final term courses as planned in my filing for graduation? If you do not clear all the final courses as planned, you will not have fulfilled the degree requirements, hence you will not graduate. You will have to register for/clear the outstanding courses in order to complete the degree requirements. You must re-file for graduation in the next term when you take the outstanding courses and file in accordance with the next cycle deadlines.",
    "Who can I approach to discuss my degree requirements? Do consult your school manager if you have questions on your degree progression or degree requirements.",
    "How can I check for the applicable course area(s) for a course? Navigate toBOSS> BOSS Bidding > Plan & Bid > Add to Cart > Course Search to search for courses under a specific course area.You should check the course area of the class you wish to enrol in, as the course area(s) may change over time.",
    "How do I check if I have completed the requirements of the degree? You may generate your degree progress report to check that all sections (residency requirement, course area, internship, community service, etc) have been marked with a tick.",
    "How do I know which course can fulfil which course area? You can make use of the Curriculum Worksheet and Course List What-if degree progress report to work out your study plan.",
    "How does the double-counting of courses work? ​​Within each degree, the double counting of courses is only allowed between your second major and course areas such as (i) GRS, TE, GE, etc (Intake AY2014 and before) (ii) Asian Studies, Technology Studies, GE, etc (Intake AY2015 onwards), provided the courses are listed in both areas, unless otherwise indicated in your school's Student Academic Handbook. You will still need to meet the minimum CU and residency requirement (refer to your degree progress report).",
    "How does the system allocate courses taken, into my degree progress report? The allocation of courses into each course area is based on the best fit model; courses will be re-allocated once you have taken other electives.",
    "Do I need to take extra course if I managed to fulfil the course area requirements in less than the minimum course units (CU)? Yes, if you are sure that all course area(s) are marked 'tick' except for the minimum CU requirement in your degree progress report. You are advised to take another Business Option, Accounting Option, Economics Option, IS Option, Social Science Major-related or Law elective.",
    "What is the minimum course units (CU) required for a student to graduate? The minimum CU required may vary, depending on whether you are pursuing a single/double degree, and have declared major/track. You must have at least:- single degree with first major - 36 CU- single degree with first and second major - 38 CU- double degree - 41 CU",
    "What should I do if the course is not appearing under the desired course area (due to multiple cross-listings) in my degree progress report? When you take more courses, the system will automatically re-allocate the courses into the best fit model. If you still encounter this issue nearer your graduation, please email a copy of your degree progress report to registrar@smu.edu.sg.",
    "Where can I find my degree progress report? Please navigate to Policies & Self-service in OASIS to find the degree progress report app.",
    "Where can I find the curriculum worksheet? Please navigate to Policies & Self-service in OASIS to find the curriculum worksheet app.",
    "What is the tuition fees penalty for dropping a confirmed course in Round 2 of Term 3A/3B? Dropping a confirmed course in Round 2 of Term 3A/3B will incur a penalty of 40% tuition fees. Please navigate to OASIS > BOSS > Course Enrolment & Drop > Bidding in Term 3",
    "Why does my course appear in my eLearn even though it was unsuccessful in BOSS? Your bid is unsuccessful. You may confirm your BOSS Outcome via Self Service Apps > My Apps > BOSS Bidding > Bidding Results. When student bids for a course, this unconfirmed bid is reflected in eLearn to aid student in accessing the materials while waiting for the release of BOSS outcome. Once the outcome is known, this unsuccessful bid will be dropped from eLearn.",
    "Can I bid for another section of the same course and DICE the original section if my bid is successful? You cannot place bid for another section of the same course. If you want to place bid for another section, you will need to drop the original enrolled section.",
    "Why was my bid unsuccessful even though it was higher than the minimum successful bid? You have placed bid for a co-requisite course and was unsuccessful, hence the bid for the other co-requisite course would be dropped automatically.",
    "How does the maximum refund policy work? The maximun refund policy for each BOSS Round are as follows: e$50 (Round 1); e$50 (Round 1A); e$40 (Round 1B); e$30 (Round 2); and e$10 (Round 2A).",
    "When does the course bidding start? You can refer to the BOSS dates in BOSS. Alternatively, you can refer to the overall calendar via BOSS > Related Links > BOSS Dates.",
    "Why was my bid unsuccessful even though it was the same as the minimum successful bid? This is due to the tie bids. Please navigate to BOSS > All About BOSS for information on tie bids.",
    "Can I bid for courses with 0 available slots but with some reserved slots? Yes, you can. If there are students who drop the course or perform DICE, the available seat will go to the next highest bidder.",
    "What will happen to students if a class is cancelled? Usually a class is cancelled due to low enrolment, or any other unforseen circumstances. Students will be notified of the cancellation of class. After which they will have to rebid for other courses by themselves.",
    "Can I change my pre-assigned course? Changing of pre-assigned courses is not allowed.",
    "Can non-accountancy students enroll in Modified Term 2 courses? Yes, SMU undergraduate students can enroll in Modified Term 2 courses. However, please note that the maximum enroll for Term 2 + Modified Term 2 = 5.5 CUs.",
    "When are the times we can change our major? Students can declare, drop or amend their First/Second Major [and track, if applicable] on the Friday (12pm) before BOSS Round 1 starts or the Monday (2pm) after BOSS Round 2A.For details, refer to Academic > Programmes & Majors > Declare Major",
    "How do I enroll for additional course? Students who have obtained a cumulative GPA of at least 3.30 after their first year of study may choose to take one additional course. Even so, students should note their own capability and not enrol in more courses than they can comfortably cope with, and do well in them. To apply, please go to Self Service Apps > My Apps > BOSS Bidding > Term Info",
    "How does DICE work? DICE is activated when the number of your bids (in course units) exceeds the term enrolment limit. DICE value '1' is the course you wish to be dropped if all your bids are successful.",
    "How much e$ will be deducted if I change my major? The administrative charge of e$10.00 is deductible for every drop or amendment or late declaration made. Pleaes naviage to OASIS > BOSS > Course Enrolment & Drop > Declaration of Majors.",
    "How should I proceed if my internship has been approved in Term 3, and I have been enrolled in courses under Term 3? Successful applicants for internship placement in the summer term (Term 3) should obtain endorsement of internship placement and waiver of tuition fee penalty from Dato' Kho Hui Meng Career Centre. These students will then not be subjected to the tuition fee penalty and will receive a full refund of tuition fee.Please fill up this online form to request for Endorsement of Term 3 Internship Placement. For more information, please navigate to BOSS > Bidding in Term 3 > Exception for Internship",
    "When is the deadline to drop a course without getting penalty? Please refer to BOSS > All About BOSS > Dropping Course",
    "Is e$ transferrable? Please note that e$ is not transferrable. Every student is given the same amount regardless of single/double degree; single/double majors. The number of CUs each student is allowed to take in a term are the same.",
    "When will I have access to the courses I have bid for in eLearn? Regardless of whether you are successful in the bidding or merely window-shopping for a module that you are interested in, a course will be accessible to a student by next working day once you have bid for it (during the BOSS Bidding period). All unsuccessful bids or voluntarily dropping of a module during the BOSS bidding period will be reflected in eLearn by next working day as well..",
    "What should I do if I do not have sufficient e$? Additional e$ will not be allocated as all students are given the same amount of e$ and e-pt in each term throughout the years of study in SMU. Please adjust your e$ bids accordingly so that you can bid for additional courses.But if you do not have sufficient e$ to bid for courses in your final term, please proceed to bid for the required courses with all your e$ until the end of Round 1B. You might be able to get your bids. If you are still unable to have successful bids, please consult your school manager for advice.",
    "Is there a mobile site for eLearn? Yes. Navigate tohttps://elearntools.smu.edu.sgwith the browser on your mobile device. Login and you will be able to check your grades, view the classlist and class schedule, access eLearn native mobile site to view course materials, participate in Discussions, etc",
    "Where can I check on the e$25 incentive for completing the end-term course feedback? You can check your E-account by clicking on the “View details” link. This will bring you to the E-account page and you can check your E-account details in the previous term.",
    "Can I access BOSS if I am on LOA this term? Once the LOA has been updated in the system, students will not be able to access BOSS. If students have already enrolled in courses before the confirmation of LOA, the courses will be dropped with full refund (of the bid amount) once the LOA has been processed. In addition, the e$100 allocated for that term will be removed.",
    "What are the minimum and maximum course units that I can take in regular term? The minimum is 1 CU while for those on good academic standing, the maximum enrolment limit is 5.5 CUs for senior students. For freshmen, the maximum enrolment limit is 5 CU.",
    "When it comes to summer term, what is the maximum course units (CUs) I can take? The maximum is 2 Course Units, i.e. 2 CUs in Term 3A and /or 2 CUs in Term 3B.If you are matriculated under the NSMen batch, it is 1 course unit for Term 3A and 1 course unit for Term 3B.",
    "Where can I check the component grades and Final Grade? For the component grades, you can go to your eLearn course and click on “My Results” to view the results (subject to Instructor’s release). For the Final Grade, you can view via the self-service function \"View My Grades\".",
    "What do 'Available', 'Reserved' & 'Enrolled' fields in class search stand for? Enrolled: This means the number of students currently enrolled in the section. Reserved: This indicates the number of vacancies that have been reserved for the section. Fore g. vacancies for exchange students/vacancies to be released in later rounds. Available: This indicates the number of vacancies which are released for that round/window.",
    "Who can I approach to ask about eLearn? You can go to the eLearn support site:https://smu.sharepoint.com/sites/iits/eLearnSupport.On the support site, you'll find the latest news, user guides, online exam related information, etc. You can also email the eLearn team for any questions at: elearn@smu.edu.sg.",
    "I am a double degree student in LLB and BBM, so does it mean that I have law as my first major?  And hence if I declare another major, e.g. Marketing, would that be my second major? LLB students automatically have Law as their First Major. You would need to declare a First Major under your secondary degree, BBM. If you wish, you can declare another major under Law (as your second major).",
    "Is there any advantage in declaring my major (s) early? Students with declared majors have priority in the bidding of courses, hence students are encouraged to declare their majors as early as possible. This also impacts on the resources and facilities (which are planned based on students' declarations).",
    "I am a second year BAcc student who wants to declare a second major in Finance. However, I also wish to do a double degree with BBM as my secondary degree. Should I declare the Finance major now or wait till the double degree application? You can declare your 2nd major first, if you have decided on it.Alternatively, you may indicate your desired majors in the double degree application. Once you are successful in your application, the major(s) would be updated in your records.Do note that should your application is unsuccessful, you would need to declare your major via OASIS, which may be subject to an administrative charge for late declaration. For information, applications for double degree will open in May. The application outcome will only be out end June/early July.",
    "My current first and second majors are Finance and Marketing. I would like to switch them to Marketing and Finance instead. How can I do it? There is no need to swap your major as the official transcript does not distinguish between your First and Second Major.",
    "I am a second year BBM student and intend to declare Finance as my first major, but have not decided which second major to take up. Do I have to declare both first and second majors at the same time? You can declare your first and second majors separately. If you are still considering your second major, you can declare your First major earlier before the deadline. Any late declaration would incur an administrative charge of e$10.",
    "I am currently in my second year after transferring from BSocSc to BBM in my first year of studies. Do I have to follow the deadline of four regular terms to declare my major? Yes, you would still need to follow the deadline as you are considered in your 2nd year of study (based on your admission year). If you feel you need more time decide, you may declare at a later time, subject to an administrative charge of e$10.",
    "I am interested in taking up double degree. How should I go about it? Students need to meet double degree requirements. Please refer to OASIS > Academic > Programmes & Majors> Double Degree Policy.",
    "What is Leave of Absence (LOA) and how to apply? Students who need to manage a long-term health, family or personal problem may apply for leave of absence from their studies. The leave of absence is usually for duration of one term, commencing from Term 1 or Term 2.Students must familiarise themselves with the Policies on Leave of Absence before applying for leave.To apply, please complete the online form with the relevant supporting documents. You will be informed of the outcome of your application via your SMU email account. Note:Students must provide detailed and valid reasons for the leave application. Relevant supporting documents should be attached where possible. *Foreign students who are approved to go on leave due to non-academic reason (eg. personal, health, etc) may be required to surrender their Student Passes to ICA for cancellation within 7 days from the date of cessation. Foreign students need not surrender their student passes if reasons for their leave are academic-related such as internships (local or overseas), research projects (as RAs), overseas exchange programme, etc. If you are currently on scholarship, leave of absence applied will require the scholarship for the programme(s) to be refunded. Further, if your applied leave is after the start of term, you will be required to pay for the amount liable, on top of refunding the scholarship (please refer to Policies on Leave of Absence for the amount liable). Students who have completed the coursework requirements for their degree but not their internship need not pay tuition fees for the remaining term(s) while fulfilling their internship. As such, students who are in their final term of coursework OR have fulfilled their coursework requirements should not apply for LOA in future terms to complete their internship or community service. Instead, students should file for graduation in their final term of coursework to be excluded from the tuition fee billing for the next term. If they fail to meet the coursework requirements (eg failed courses) after filing for graduation, then they will be billed the tuition fees for the next term.",
    "Where can I find the course requirements for second majors? The second major requirements can be found in OASIS> Academic > Advisement & Curriculum.",
    "What if I am absent for an extended period of time without applying for LOA? If you are expected to be absent for an extended period of time for a valid reason, you must apply for Leave of Absence (please refer to Policies on Leave of Absence) in advance. If you skip classes for an extended period, and attempts by the instructor/school to contact you (eg via official email, phone) are unsuccessful, you are liable to have your student registration status terminated. Accordingly, you will be withdrawn from the university.",
    "Can I declare three majors?  If so, how can I go about declaring it? Students enrolled in a single degree can declare a maximum of two majors. Double degree students can declare a maximum of three majors, with the 2nd major tied to the primary degree.",
    "I am currently on provisional Double Degree but I wish to change my primary/secondary degree to another degree which I am interested in. Does this consider change of programme or application for double degree? Yes, this is considering change of programme and student needs to meet requirements for change of programme. Please refer to OASIS> Academics > Progamme & Majors > Apply for Transfer of Programme.",
    "I have completed all the coursework requirements, except for internship, do I apply for Leave of Absence (LOA)? Students who have completed the coursework requirements for their degree but not their internship need not pay tuition fees for the remaining term(s) while fulfilling their internship. As such, students who are their final term of coursework OR have fulfilled their coursework requirements should not apply for LOA in future terms to complete their internship or community service. Instead, students should file for graduation in their final term of coursework to be excluded from the tuition fee billing for the next term. Of course, you will be billed the tuition fees if you fail to meet the coursework requirements after filing for graduation.",
    "Can I drop or change my major after I have declared my major?  When’s the deadline? You can change/drop majors any time during non-BOSS periods via OASIS, subject to the approval from the respective School as well as an administrative charge of e$10.",
    "I have missed the online major declaration deadline of four regular terms. How can I declare my major now? You can still declare your major via OASIS during non-BOSS periods. Any late declaration to the First/Second Major or Major with Track/Concentration would require approval from the respective school, and would be subjected to an administrative charge of e$10.",
    "I have previously declared my first major without the track. I understand that there will be a penalty for changing of major, so do I need to change my first major to major with track?  If I do not make the change and have taken all modules for the track, will I still be awarded the track? You will need to change your major to major with track (with e$ penalty), in order to be eligible to be awarded the track upon graduation (if major with track requirements are met).",
    "Do I need to pay tuition fees if I applied for Leave of Absence (LOA)? If the LOA is effected within the first 2 weeks of the term, tuition fees charged would be reversed. If the LOA is effected from week 3 onwards, tuition fees charged would be payable and there will be no refund.The effective date for all LOA applications will be based on the application date. Students who are granted LOA must settle all outstanding fees before going for their leave.Annual Fees are still payable for Students who have successfully applied for LOA.",
    "I want to drop a major so that my cumulative GPA can be improved. Would it be possible? All courses taken at SMU will be counted towards overall GPA and CU. Hence dropping one major will not make a difference.",
    "Can I apply for the enrolment in the double degree programme first and then proceed to take the required courses in the following terms? Students must meet the criteria set by the Schools before applying for enrolment in a double degree programme. There is no provisional enrolment for students applying at the end of year 1 or year 2.",
    "How do I declare my major?  When is the deadline? Students can declare your major(s) [and track, if applicable] via OASIS> Academic > Programmes & Major > Declare Major during non-BOSS periods.All students MUST declare their First as well as Second (if any) Major or Major with Track/Concentration within their first 4 regular terms of study (inclusive of term on leave of absence and/or external study programme such as international exchange programme). Students must meet the criteria set by the Schools before applying for enrolment in a double degree programme. There is no provisional enrolment for students applying at the end of year 1 or year 2.Any drop, amendment or late declaration to the First/Second Major or Major with Track/Concentration (to be submitted via OASIS) would be subjected to approval from the respective school as well as an administrative charge of e$10 (an administrative hold may also be placed on students who do not declare their First Major or Major with Track/Concentration within the first 4 regular terms of study). Please note that the administrative charge of e$10 applies to instances where new majors or new tracks/concentrations under an existing major are being offered and a change of declaration to the new major or new track/concentration is being made. This is because allocations of resources and facilities are based on forward planning and such changes would have an impact on the planned resources and facilities.",
    "I wish to change my major to major with track. Can you help me change my major to Finance (ITT) without the e$10 penalty? You can change your major via OASIS.Any drop, amendment or late declaration to the First/Second Major or Major with Track/Concentration would require approval from the respective school, and would be subjected to an administrative charge of e$10. The university will always launch new majors and/or tracks from time to time. As any changes to the declared majors and/or tracks would have an impact on the resources and facilities (which are planned based on the initial declaration), we have to impose an admin charge accordingly.",
    "How to withdraw from SMU?  What is the procedure? Students who are unable or do not wish to continue with their studies at the University may withdraw from the University.A formal withdrawal must be filed with the University, failing which you will be considered to be absent for classes without reason and this may have adverse effect on your permanent academic records.Before you submit your withdrawal form, we urge you to re-consider your decision. We suggest that you seek advice from your academic counselor.The duly completed Withdrawal Form is to be reviewed by Office of Finance before submitting it to the Office of Registrar, either by hand or by registered mail. If by registered mail, then please send the form to Office of Finance and enclose the SMU Student Card. The earliest effective date of an immediate withdrawal is the date of the receipt of the duly completed withdrawal form.You are required to settle all liabilities with the University and to return all University's property to the respective offices. These include (but not limited to) :1. settle all liabilities with SMU and return all items that are classified as SMU’s property to the respective offices2. return the SMU Student Card to the Office of Registrar3. settle all library loans / fines4. remove all software provided by SMU in my notebook5. return the tertiary student EZ-link Card to TransitLink6. return the Student Pass (green card) to the Immigration and Checkpoint Authority within 7 days from the effective withdrawal date (applicable to foreign student only)The Office of Registrar will write to you on your withdrawal from the University. Please ensure that your mailing address is updated.",
    "I wish to change my second major but I am not sure if the courses taken so far can be used for the new major.You can run a Major What-If Report to see how your courses would apply to a different first and/or second major, which can be found in OASIS> Academic > Advisement & Curriculum.",
    "How will my grades and tuition fees be affected if I withdraw from SMU? A formal withdrawal must be filed with the Office of Registrar. The effective date of an immediate withdrawal is the date of the receipt of the formal withdrawal letter/form. No courses or grades for that term will appear on the record of the student, if the withdrawal takes place before the University final written examination. Grade(s) for the registered course(s) will be recorded and reflected in the transcript, if the withdrawal takes place after the University final written examination has begun. The rules for refund of tuition fees are as follows, based on the effective withdrawal date: Refund PolicyIf the withdrawal is effected within the first 2 weeks of the term, there will be 100% refund of that term tuition fees paid. If the withdrawal is effected from week 3 onwards, there will be no refund.The above refund policy applies whether you are enrolled in Term 2 or Modified Term 2 or both. Please note that the registration and penalty fees for enrolment/dropping of courses in Term 3 still applies. Detailed information can be found in BOSS Handbook.Withdrawal from a programme does not absolve students from all liabilities with the university. They must clear all debts and liabilities, including outstanding fees with the Office of Finance, upon withdrawal from the programme. The policy can be found in OASIS> Academic> Finance & Admin> Absence & Withdrawal> Withdrawal from University",
    "I am a BAcc student. Do I need to declare my first major? BSc(IS) and LLB students automatically have Information Systems Management and Law as their First Major respectively. They do not need to make a First Major declaration.BAcc and BSc(Econ) students admitted from AY2012 onwards will have Accounting and Economics defaulted as their First Major respectively. Students who wish to declare a track under their default major MUST do so within the first 4 regular terms of study.",
    "If I decided to withdraw my current secondary degree, will the major declared under my secondary degree be considered as 2nd major under my primary degree? Yes, it will be considered under 2nd major under primary degree (provided there is no 2nd major previously declared under primary degree). For more information, please refer to OASIS> Academics > Programme & Majors> Apply for Double Degree Programme.",
    "Can I drop WRIT001 Programme in Writing & Reasoning if I am assigned to take it in AY 2017-18? You are advised not to drop WRIT001 as it is a foundation course. Students are required to complete all foundation courses before graduation. Furthermore, it is a pre-requisite to COMM101: Management Communication.",
    "Do I need to bid for WRIT001 Programme in Writing & Reasoning? No, you will be automatically exempted or pre-assigned to take WRIT001 in Academic Year (AY) 2017-18.",
    "Does WRIT001 Programme in Writing & Reasoning count towards the Grade Point Average (GPA)? Yes, it counts towards your GPA. PWR carries one course unit (CU).",
    "I am an 'A' level / Polytechnic / International Baccalaureate / NUS High School student. Can I use my SAT / IELTS / TOEFL / ACT scores for exemption? No, as exemption is based on your entry category. Only students admitted under the International student category are allowed to use SAT/IELTS/TOEFL/ACT scores for exemption.",
    "I am an International student with improved SAT scores and who is only taking WRIT001 Programme in Writing & Reasoning in AY 2017-18 Term 2. Can I use this score for exemption in Term 2? Only the score that is used at the point of admission to SMU will be considered.",
    "I am automatically exempted from WRIT001 Programme in Writing & Reasoning. However, I would like to audit the module. Is this possible? A student who wishes to attend WRIT001 but not take it for credit may do so only with the permission of the CEC Director. When a student audits the course, no formal record of the course will appear in the transcript.",
    "I am automatically exempted from WRIT001 Programme in Writing & Reasoning. However, I would like to withdraw my exemption. Is this possible? You should submit your request in writing to your School Manager. Upon approval, the school will remove the exemption and inform Office of Registrar (RO). RO will then pre-assign you to take WRIT001.",
    "I do not meet your exemption criteria. However, I have an English language/writing qualification that is not listed in your exemption criteria. I would like to apply for exemption using this grade.The procedure for exemption is as follows: 1. You should email cec@smu.edu.sg. Please state your full name, IC/Passport number, school (e.g. SIS, SOA), title of the English language/ writing qualification, course outline, university/institution in which the module was completed and the final grade for the module. 2. You should submit two to three samples of your writing in this module for review by CEC Director. These samples should be academic essays of an argumentative nature. 3. You should also submit a scanned copy of your transcript and/or English language/ writing qualification. CEC’s exemption decision is final. CEC is not obliged to provide detailed feedback on your writing samples. Please also note that the writing modules offered at various universities or institutions may not be comparable in terms of emphasis and standards. A high grade attained for the writing module done at another university or institution does not automatically exempt a student from WRIT001 Programme in Writing & Reasoning.",
    "I received a grade A for my humaities subject (e.g. Literature) at 'A' levels. This subject requires a high standard of critical thinking and writing. Can I use these grades for exemption from WRIT001 Programme in Writing & Reasoning? No, the grades for ‘A’ level humanities subjects will not be considered for exemption from WRIT001 Programme in Writing & Reasoning.",
    "If I am assigned to take PWR, can I sit for an exemption test? There is no exemption test. If you do not meet the university’s criteria for exemption, you will be automatically pre-assigned to take WRIT001 in AY 2017-18 Please visit this link(https://cec.smu.edu.sg/sites/cec.smu.edu.sg/files/PWR%20Exemption%20Criteria%202017-18_0.pdf)for the exemption criteria.",
    "What is WRIT001 Programme in Writing & Reasoning? Programme in Writing & Reasoning introduces students to the thinking and writing needed to produce good term papers and reports. In this course, students are equipped with the skills to write cogently in academic, business and professional settings. Students will analyze topics from a business perspective and articulate their ideas persuasively in a clear, concise and coherent report. For more information, please click here(https://cec.smu.edu.sg/undergraduate/programme-writing-and-reasoning-pwr)",
    "Can I drop WRIT001 Programme in Writing & Reasoning if I am assigned to take it in AY 2017-18? No, the combined scores from different sittings of the SAT will not be considered.",
    "May I know why I am only exempted from two courses?  I have friends, who are of similar situation as me, but had three courses exempted.Exemptions are granted to applicants or students based on their entry academic qualifications (e.g. GCE ‘A' Levels, Polytechnic Diploma) and results of qualification tests administered by SMU (e.g. optional waiver test for Statistics).Depending on the grades attained, students holding the same qualifications may be granted different exemptions.Kindly contact your school should you have further clarifications.",
    "What is NSmen ICT? ICT refers to In-Camp Training and is applicable to male Singaporeans who are called up by the government for National Service. Those who are called up should visit OASIS> Finance & Admin> Absence & Withdrawal> Singapore NSmen ICT on information for requesting a deferment of ICT.",
    "When is the period whereby I must go for the ICT? Students who are being called up during school term can ask for deferment. Students who are called up during the ‘black-out window' (schedules can be found in OASIS) must go for ICT as ordered by MINDEF policy. School will not make an appeal for student.",
    "Can I be exempted from IS202?  I have friends who came from the same course and polytechnic but are exempted IS202.Exemption for IS202 Data Management is granted to students who have passed the waiver test.You may want to check with your School for details.",
    "How can I go for internship if I will get call up for ICT during the vacation period? If student has planned for internship during the vacation period and gets called up for ICT as per the ICT call-up schedule (refer to OASIS> Finance & Admin> Absence & Withdrawal> Singapore NSmen ICT), he is then required to go for his ICT and delay his internship.",
    "I have completed my internship/ industrial attachment during my polytechnic studies. How can I apply for internship exemption? Exemption for Internship (partial or full) may be granted to polytechnic students (only) if they have completed a relevant business attachment during their polytechnic study.Such exemptions are not automatically granted. Polytechnic students should be advised to submit a copy of their internship certificate as well as supporting documents on the job scope to the Dean's Office for evaluation. No exemption for Community Service should be granted.Note:1) SIS and SOL do not grant exemption for Internship. 2) No exemption for Community Service should be granted.",
    "I have graduated from a local polytechnic with a Diploma with Merit. However, it indicates otherwise in OASIS. How can I rectify this? You will have to submit your Merit Certificate to the Office of Undergraduate Admissions. Once your records have been updated, then your exemptions will be re-evaluated.",
    "I went for exchange last term, but the transfer credits are not appearing in my degree progress report. What should I do? You may not have confirmed your exchange worksheet.Please contact the relevant offices once you have done so:1) International Exchange – Office of Global Learning2) Local Exchange – Office of Registrar3) Other External Study (non-exchange) – Respective School Managers",
    "I would like to clarify if the maximum number of credit transfers applies for each exchange program or for the entire duration of my study at SMU.There are different limits set. For details, please refer to the credit transfer policy via OASIS> Academic> Advisement & Curriculum> Credit Transfer Policy.Do note that the policy limits apply to the cumulative credits transferred, regardless of the total number of external study programmes undertaken.",
    "I'm currently taking up Spanish at a language school. Is it possible to earn a credit for GE Arts? Credit transfers are usually allowed only for courses taken at other universities.You may want to approach your School for advice.",
    "I'm exempted from 1 SMU GE-Arts from obtaining a B in Literature, but 2 SMU GE-Arts by obtaining an A in Geography. Is there an error? The grades attained in your pre-university qualifications would affect the exemptions granted.The total number of exemptions that may be granted to any student in the area of General Education is capped at:- 2 course units (for AY2012-14 intake)- 3 course units (from AY2015-16 intake onwards)Kindly contact your school should you have further clarifications.",
    "Who is eligible to take SMU-X modules? All students are able to take SMU-X modules. Please check the course outline for pre-requisites.",
    "Who should I approach if I want to find out more about SMU-X modules? The SMU-X office is situated on Level 2 of lyf@SMU. Come talk to the friendly people there or simply e-mail your enquiries to smux@smu.edu.sg.",
    "How do I sign up for SMU-X modules? Depending on the module, students can sign up for SMU-X modules via BOSS Bidding or application. Please refer to the course outline for more information.",
    "How do SMU-X modules differ from other SMU modules? Unlike a typical module, SMU-X courses are designed such that there is a shift in emphasis from teaching to self-learning. An SMU-X course combines academic theory with experiential learning through the heavy use of real unresolved issues and projects that students work on. Faculty members partner with the industry, non-profit and government-sector organisations to develop and teach the courses and projects, and are actively involved in mentoring students.",
    "How much time and effort is needed for SMU-X modules? Students, who have taken SMU-X modules, typically spend 10 out-of-classroom hours (3 hours of self-study and 7 hours of project work), on top of the 3-hour class session every week. A large proportion of the time (and effort) was spent on meeting with project mates, mentors and clients.",
    "What are the benefits of studying SMU-X modules? Through taking SMU-X courses, students will be able to: - be aware of the connections and differences across disciplines and to integrate knowledge to explore real-life business issues and challenges; - adapt to new or unfamiliar environments and exercise leadership; - think creatively and critically when solving problems; - make sound decisions while managing complex situations and; - work collaboratively and productively as a team. This could also be an added advantage for students when they profile themselves to future employers for internship/ employment opportunities – letting employers know that they helped the company and their key learning experiences through the projects.",
    "What are the SMU-X modules being offered? The list of SMU-X modules offered varies every term. You can keep a look out for SMU-X e-mails, visit the website (https://x.smu.edu.sg/courses) or enquire at smux@smu.edu.sg for list of SMU-X modules on offer.",
    "What is SMU-X all about? SMU-X focuses on learning as opposed to teaching, and its curriculum is based on an experiential approach that is inter-disciplinary and hands-ons. All SMU-X courses are characterised by four core principles: a. inter-disciplinary content and activities; b. experiential learning via an actual problem or issue faced by an organisation; c. active student-mentoring by faculty and industry and; d. a tripartite learning loop for faculty, students and industry. Every SMU-X course will challenge and inspire students to use their disciplinary knowledge and skills in tackling complex, real issues faced by the partner organisations.",
    "What skills are required for SMU-X modules? Time management is important: Students will need to manage their time well to do in-depth research, to discuss and meet up with their team members, course instructor and clients so as to come up with an innovative and pragmatic solutions for clients. Over the course of the 15 weeks, there will also be countless adjustments to proposals and reports in response to feedback from the clients, their customers and the course instructors. Be prepared to do extensive research and analysing work to develop creative and pragmatic solutions. Client management: Dealing with clients is part and parcel of a SMU-X project. Managing clients’ expectations is a critical skill in delivering quality work that the client is satisfied with. Group conflict and resolution: Conflicts are inevitable in project work. It is important for students to address the conflict before it becomes unhealthy or destructive. Ambiguity: Business problems from clients can be complex and students should have an open and positive mind-set as they may experience success, failure, uncertainties and unexpected changes during the course.",
    "Which companies are collaborating with SMU-X? SMU-X collaborates with more than 200 industry partners, which includes 3M, Singtel, LVMH, Singapore Airlines, DBS, DFS Singapore, The Ascott Limited, Asia Europe Foundation… and many others!",
    "Which course area(s) can SMU-X modules be mapped under? Please check the course catalogue for more information –https://inet.smu.edu.sg/sites/courses.",
    "The volunteer opportunity on OnTRAC II indicated the number of hours. Does that mean that it will be the total number of hours I will be awarded from participating too? The number of hours indicated on the OnTRAC II postings are an estimation. We will need your Community Service Timesheet and Performance Appraisal at the end of your community service project, to determine the actual number of hours you have fulfilled. Activities that do not comprise any interaction with the beneficiaries may be subjected to moderation. If you do not meet the project requirements and/or receive an overall ‘unsatisfactory’ performance appraisal, you may be required to re-do your community service project.",
    "How many organisations can I volunteer with for Pro-Bono? For students in the Bachelor of Laws programme, all Pro Bono attachments will be considered as under one organisation. Please refer to the SMU Pro Bono Centre’s website, or email probonocentre@smu.edu.sg for more information.",
    "Can I get Community Service Hours by participating in any Office of Student Life (OSL) school-wide programmes? Only Arts Festival, Academic Year Opening Ceremony (AYOC), Freshmen Orientation, Patron’s Day, and VIVACE are considered. Irrespective of the number of these programmes that you volunteer with, only 30 – 50 hours in total will be recognised towards the first 80 hours of your community service graduation requirement. Please liaise with the officer-in-charge at OSL to clarify if you sign-up for these programmes.",
    "What are Community Service Units (CSUs)? Only for AY 19 cohort onwards: The CSUs are mandatory learning units that all students must complete and pass before starting on their Community Service graduate requirement. The CSUs will introduce you to guiding principles and tools such as service learning, needs analysis and asset mapping. These units will help you to better understand and apply your learning so as to provide more impactful and sustainable service to the community",
    "I have found a local/overseas Community Service Project. Can I propose it on OnTRAC II, and start immediatelyFor local community service projects, please submit your self-proposal on OnTRAC II at least 7 working days before you start for C4SR’s approval first. For overseas community service projects, as it would require more preparation and documentation, please submit your self-proposal on OnTRAC II at least 6 months in advance.",
    "I have forgotten to apply on OnTRAC. Can I apply later and have my participation in the community service project count towards my graduation requirement? No, please note that we do not backdate projects. For your participation to be considered towards your graduation requirement, you must apply on OnTRAC and gain approval from C4SR before commencing on your community service project. The record of your community service project will commence based on the start date approved by C4SR on OnTRAC.",
    "Why is my application to the Overseas Community Service Project (OCSP) on OnTRAC II not approved? OCSP postings on OnTRAC II are applicable for selected participants only. Recruitments for OCSPs often occur between 3 to 6 months in advance of the actual trip. Contact the Project Leaders directly for more information and to indicate your interest to participate. If you are already a participant of the OCSP team and your OnTRAC II application is not approved, please check with your Project Leader.",
    "How many hours will I be awarded for my Community Service Project? The number of hours awarded is based on your Community Service Timesheet that you submit at the end of your project. Activities that do not comprise any interaction with the beneficiaries may be subjected to moderation. If you do not meet the project requirements and/or receive an overall ‘unsatisfactory’ performance appraisal, you may be required to re-do your community service project.",
    "Why is my Community Service application on OnTRAC II not approved yet? If you have applied for a group-based local project, please check in with your Project Leader or Host Organisation. If you have submitted a self-proposal, please wait 7 working days for C4SR’s response.",
    "What documents must I submit at the end of my Community Service Project? At the end of your Community Service project, please submit your endorsed Community Service Timesheet to C4SR. An email will subsequently be sent to your Supervisor as indicated on OnTRAC II, for him/her to access your e-appraisal. Please help to remind your Supervisor from the Organisation or Project Leader to submit your e-appraisal.",
    "Can I end my Community Service after completing 80 hours? Do note that your hours will only be recognised once you have met the minimum commitment of your project, regardless of the balance community service hours you have to fulfil. If you have fulfilled the project’s minimum commitment, please ensure that you have submitted your endorsed Community Service Timesheet to C4SR at the end of your Community Service Project.",
    "What is the passing mark for the Community Service Units (CSUs) quiz? Only for AY 19 cohort onwards: To achieve a pass, you will need to score 80% or higher. Once you have successfully completed all the three learning units and final quiz, you will receive an acknowledgement from eLearn’s system generated email. Do note that you will not be able to apply or self-propose any community service project on OnTRAC II if you have not completed and passed the CSUs and final quiz.",
    "How many hours do I need to complete as part of the Community Service graduation requirement? All undergraduates are required to complete a minimum of 80 hours of community service.",
    "When do I submit the timesheet for my Community Service Project? Please submit your endorsed Community Service Timesheet to C4SR at the end of your Community Service Project. Before submitting the timesheet, do ensure that you have met the commitment required for the project, regardless of whether you have already completed your required community service hours.",
    "Can I start my Community Service Project before passing the online learning units (RPU & CSUs)? Only for AY 19 cohort onwards: Before you start your community service project, you must complete and pass the four mandatory online units (RPU & CSUs) on eLearn first. The RPU will equip you with skills for deeper and more meaningful reflection, while the CSUs will introduce you to guiding principles and tools such as service learning, needs analysis and asset mapping. These units will help you better understand and apply your learning so as to provide more impactful and sustainable service to the community.",
    "What is the passing mark for the Community Service e-Briefing Quiz? Only for AY 18 & earlier cohorts: To achieve a pass, you will need to score 80% or higher. You are allowed three attempts to achieve a pass, failing which you will have to meet with C4SR on the next course of action.",
    "How do I keep track of my Community Service hours? Keep track of your Community Service hours using the Community Service timesheet form (download from OnTRAC II > Community Service > Resources > Document Library) and submit your endorsed timesheet to C4SR at the end of the project.",
    "Why do we need to contact the Organisation or Project Leader before applying for opportunities listed on OnTRAC? Some of the volunteer opportunities listed on OnTRAC II require interested participants to go through an interview, and/or training prior to selection. Vacancies may have already been fully subscribed too. Thus, you should be proactive and contact the Organisation or Project Leader (for student-led initiatives) for more information, and to confirm your participation before applying on OnTRAC II.",
    "What should I do if I applied for a Community Service Project on OnTRAC II, but did not embark on it? If you have applied for a group-based project, please inform your Project Leader or Host Organisation. If you have submitted a self-proposal, please inform C4SR at commsvcs@smu.edu.sg with your reasons.",
    "Why can I only volunteer with 3 organisations? You can only volunteer with a maximum of 3 organisation for the first 80 hours. This is to ensure that you have sufficient engagement to learn more about the social cause, and provide a more impactful service for the beneficiary community you are serving. For students in the Bachelor of Laws programme, all Pro Bono attachments will be considered as under one organisation.",
    "Can I extend my Community Service Project period? For changes in start and end date due to extenuating reasons, please email commsvcs@smu.edu.sg to inform us accordingly about the change in advance, before the current proposed end date.",
    "Can I still volunteer in other Community Service Projects after completing the 80-hour requirement? Of course! If you will like your additional hours to be reflected in your records, then please follow the procedures in the Community Service e-Guidebook on eLearn.",
    "What is the Community Service e-Briefing? Only for AY 18 & earlier cohorts: The e-Briefing is a mandatory briefing that all SMU students must pass before starting on their Community Service graduate requirement.",
    "Why are my Community Service hours not updated yet? Your Community Service hours will only be updated, after we have received and reviewed your Community Service Timesheet and Performance Appraisal forms. If you have already submitted your forms, please wait for C4SR to do the necessary updates. Please also ensure you have met the commitment required for the project before you submit your timesheet and appraisal forms, regardless of whether you have already completed your required community service hours before the end of the project. You can continue to track your community service hours’ update on OASIS > Self-Service Apps > Participation and Grading.",
    "Am I allowed to do an internship using tourist visa? Generally, you are not allowed to do an internship while on a tourist visa. Some countries allow such an arrangement and some do not. Hong Kong, for example, offers a Training Visa for internships. Hence, all internships in Hong Kong will require a visa unless the purpose is a short three- to seven-day business visit. Some countries do not require a visa for Singaporeans to work for 90 days or less. Please consult with the DKHMCC Overseas Desk before you commit to the overseas internship.",
    "Can I apply for an overseas internship while abroad? Yes, we understand that many students while abroad (e.g. on international exchange) may want to embark on an internship following the end of their exchange programme in the same or different country. Wonderful idea! However, prior to submission of an application, you must email the DKHMCC Overseas Desk to discuss an alternative interview arrangement (e.g. phone or Skype) with the prospective employer. Without prior arrangement, your application may be at a disadvantage. Remember to submit a self-proposal on OnTRAC II for the internship to count towards your graduation requirement.",
    "Do I need to buy travel insurance for overseas internship? Students embarking on an overseas internship must purchase adequate travel insurance before the internship commences. This includes international students going back to their home countries for internship. A medical insurance or group insurance provided by the host company is not the same as travel insurance. Therefore, you still need to buy a travel insurance even if the hiring company provides its interns with medical or group insurance. Please note that your preferred travel insurance policy must cover at least S$150,000 for life and S$250,000 for emergency evacuation.",
    "Do I need to know a foreign language to apply for overseas internships? There should be no language barrier if you intern in an English-speaking country. For other internships, especially those solicited by the DKHMCC Overseas Desk and offered via OnTRAC II, foreign language ability is usually not required, unless otherwise stated. Consult the DKHMCC Overseas Desk for the foreign language eligibility requirements if you plan to take up an internship overseas.",
    "Does going back to my own home country constitute overseas internship? All internships that take place outside Singapore are considered overseas internships. This is because you are considered an SMU student from Singapore regardless of your nationality.So if you go on exchange, and you return back to your home country, you may want to find or have found an internship there, it will still be considered overseas internship.So for these two types of overseas internships (11a: those which you found while on exchange or 11b: when you are back in your home countries), we envisage an issue concerning the travel insurance protection. This issue is critical because, without a travel insurance protection, your self-proposed internships will not be approved and recognized. We therefore strongly advise that these students consult the DKHMCC Overseas Desk prior to departure for exchange/home country.",
    "How do I apply for an overseas internship? The application procedure for overseas internships is the same as that for local internships in Singapore.",
    "How do I know which country the overseas internship position is located in? Overseas internship positions posted on OnTRAC II are often identified by the city name in brackets, e.g., Market Intern (Shanghai), Finance Intern (Hong Kong), IS Intern (Bangalore), etc.",
    "How long are the overseas internships? The actual duration of the overseas internships varies across countries, companies and internships. For example, most summer internships in mainland China and Hong Kong are three months in duration, typically during the summer from May to July. In fact, many Chinese employers prefer longer internships of up to six months. On the other hand, most summer internships in India and the Middle East usually last for 10 to 12 weeks.",
    "How many days/hours a week will I work when on internship? Interns must abide by the staff and work policies of their host companies. The work week of most internships is five days, and/or up to 40 hours per week. The actual work week may vary across companies, involving over-time work as well.",
    "How much is the cost of interning in an overseas country? There is no blanket answer as it depends on the length of the overseas internship, the country, and the city. For example, the housing costs vary tremendously between Hong Kong and Chongqing. Overall, it is a good idea that you budget about S$5,000 to S$6,000 in order to intern and live comfortably for a three-month long summer in an overseas country, or more if the internship is longer and in an ‘expensive’ country.",
    "I am a Student Pass Holder. Can I apply for overseas internships? Yes, in-principle. However, many countries do not grant foreigners (i.e. non-Singapore citizens) a visa for internship purposes through their embassies in Singapore. These students should consult with the DKHMCC Overseas Desk if this restriction applies to them.",
    "If I am an international student going back to my home country for internship, do I need to buy insurance? Travel insurance is compulsory for all students when embarking on a recognised overseas internship, regardless of whether the country they are interning in is their home country or not. Failure to purchase (and show proof of) travel insurance before you depart Singapore will render your internship void. A medical insurance or group insurance provided by the host company is not the same as travel insurance. Therefore, you are still required to buy travel insurance even if the hiring company provides its interns with medical or group insurance. Please note that your preferred travel insurance policy must cover at least S$150,000 for life and S$250,000 for emergency evacuation.",
    "What should I do before applying for an overseas internship? We advise that you take the following steps prior to the application: - Consult the DKHMCC Overseas Desk (by appointment), especially if you have questions or concerns about working and living in an overseas country. - Seek parental consent, especially if you need their financial support. - Pass the e-internship briefing requirement and also attend the overseas internship information session.",
    "When are the overseas internships posted on OnTRAC II ? For summer internships, most internship openings are posted on OnTRAC II from January to March. For semester internships, such openings are usually posted on OnTRAC II about two-three months before the commencement of the next semester. Students who plan to go overseas for internships are strongly advised to seek consultation with the DKHMCC Overseas Desk to discuss their country interests, internship needs, preparations (e.g., budget), and for some, their readiness, as early as possible. The DKHMCC Overseas Desk may have some internship positions to recommend to you, often resulting in your direct placement to the company/country.",
    "When do overseas internships start? For summer internships, the actual start date of the overseas internships varies across countries, companies and internships. For example, most summer internships in mainland China and Hong Kong typicsally start in the first week of May, immediately after the Labour Day holiday. For India and the Middle East, most summer internships often start in the first week of June. For term-time internship in Term 1, the actual start date usually starts in early December or immediately after the New Year in January. For term-time internships in Term 2, the start date is usually sometime in June. The start dates of all overseas postings are stated on OnTRAC II.",
    "Which countries will the overseas interns be posted to? In line with SMU and the Singapore Government strategies of internationalization and regionalization, DKHMCC Overseas Desk has put the focus on the emerging markets in the Greater China, India, the Middle East, and the ASEAN regions. However, we do encourage and support overseas internships in any country of the world.Note that the overseas internship positions posted on OnTRAC II are often identified by the city name in brackets, e.g., Market Intern (Shanghai), Finance Intern (Hong Kong), IS Intern (Bangalore), etc",
    "CareersCommService_OIS_WhichCompaniesProvideOverseasInternshipExperiencesThe host companies represent both MNCs and SMEs in a wide variety of trades and industries. Regardless of the size of company, a majority of them are international companies.",
    "Why do I need to buy travel insurance for an overseas intership? This prerequisite is critical because without travel insurance protection, your self-proposed internship will not be approved and recognised.",
    "Will I be paid for an overseas internship? Most overseas internships are paid but the amount varies depending on many factors: legal requirements, local ‘internship culture’ and the ‘norm’ of pay for local and overseas interns. For example, in China and Mexico, it is illegal for companies to pay a salary to a foreign intern as he is not legally hired as an expatriate employee. In Hong Kong, an internship is widely accepted as company-supported training and both students and universities do not ask for a salary. However, most companies do provide a modest stipend (like an allowance for transport and meal) in local currency (e.g., RMB1,500 per month in Shanghai, HK$2,000 per month in Hong Kong and Rs 5000 per month in Bangalore) to help you defray transportation and food expenses. You can check out the actual amount of stipend, if any, in the Job Description posted on OnTRAC II.",
    "Will I meet my employer before starting the overseas internship? Most companies interview their prospective interns via phone, Skype or sometimes on-site in the Singapore Office or even in DKHMCC. The interview is an ideal platform for you to enquire further details on the role or work environment . However, you may not meet the supervisor or manager prior to your first day of work at the company in the overseas country.",
    "Will I receive any financial grant or subsidy for overseas internships? The International Enterprise (IE) Singapore operates a Young Talents Programme (YTP). Co-funded by IE and SMU, the YTP scheme provides financial subsidy to help you partially defray living expenses. For some countries, the scheme covers up to 75% of the airfare. YTP is applicable to Singaporean citizens and permanent residents only, and is subject to terms and conditions. Consult the Overseas Desk of DKHMCC for more details about the YTP.",
    "When will my Pro Bono Placement record be updated? Your Pro Bono Placement records will only be updated, after we have received and reviewed the PBC Performance Appraisal and PBC Timesheet.",
    "Where can I check the number of Pro Bono hours which I have completed? Please log on to OASIS, click on \"Career and Jobs\" tab followed by the \"Participation and Grading\" link to check the total number of Pro Bono hours.",
    "How do I find a Pro Bono Placement? You can refer to recruitment emailers from SMU Pro Bono Centre on Pro Bono Placement opportunities.",
    "Why can’t I access the google forms to indicate my interest for Pro Bono Placement? Kindly log-in using your SMU student username, dropping the “law” domain (i.e. username@smu.edu.sg), clearing your cache after logging out of your personal google drive beforehand, in order to access the google form and complete it online.",
    "Why is my application to the Pro Bono Placement on OnTRAC II not approved? Pro Bono Placement postings on OnTRAC II are only applicable for students who have been successfully recruited via ballot or first-come-first-serve recruitments.",
    "Will all Pro Bono Placement opportunities be considered towards my graduation requirement? Pro Bono Placement must be SILE-approved and recruited via SMU Pro Bono Centre. Students must also apply for the successfully balloted Pro Bono Placement on OnTRAC in order for participation record to be created and for Pro Bono hours to be recognised.",
    "How many Pro Bono hours do I need? As part of the graduating requirement, students (both LLB and JD) are required to complete the mandatory 20 hours of pro bono volunteer work.",
    "I have completed more than one Pro Bono Placements. Must I submit a Community Service Report for each of the Pro Bono Placement? You are only required to submit ONE report. If you have completed multiple Pro Bono Placements/Community Service projects, you may write the report based on the single placement that you have completed the most number of hours for, or based on all the placements that you have participated in/experienced throughout your course of study at SMU.",
    "I have forgotten to apply on OnTRAC II before the deadline. Can I apply later and have my participation in the Pro Bono Placement count towards my graduation requirement? No, please note that we do not backdate Pro Bono Placement. For your participation to be considered towards your graduation requirement, you must apply on OnTRAC II before commencing on your pro bono placement.If the posting is still available on OnTRAC II, please apply immediately. We would require time to respond and approve your application. The record of your pro bono placement will commence according to the minimum timeline following your OnTRAC II submission date (at least 7 working days).",
    "I have just completed my Pro Bono Placement. Where can I go to complete my Community Service Report? You will need to submit the PBC Performance Appraisal and PBC Timesheet to SMU PBC Dropbox located at SOL, level 4 – outside General Office. Kindly note that you are only required to submit ONE Community Service Report via OASIS. You should submit the report within one month of you completing the first 80 Pro Bono/Community Service hours of your degree requirement.",
    "Can I complete the university graduating requirement for 80 hours of Community Service (50 hours for JD students) by doing solely Pro Bono? Yes, you may. Please keep a lookout for recruitment emailers from SMU Pro Bono Centre on Pro Bono Placement opportunities.",
    "Can I do a mutual swop with my peers for the Pro Bono Placement? No swopping of slots is allowed. Please ensure that you are able to attend all sessions before signing up. Students who are unsure of their schedules should refrain from signing up.",
    "Can I withdraw from the Pro Bono Placement after I have been successfully balloted? Withdrawal is only allowed based on a case-by-case basis (e.g. medical reasons, extenuating family circumstances), and must be supported by documentary evidence such as a Medical Certificate or Certificate of Death). If you decide to pull out from the Pro Bono opportunity after you have been successfully balloted without a valid reason, you will be blacklisted. Students who are blacklisted will be denied applications for two months and be denied priority in the last year of graduation against non-graduating students.",
    "Does the Community Service condition which limits placements to 3 organisations for Community Service of 80 hours (50 hours for JD students) apply to Pro Bono Placement? No, you are not restricted to the number of organisations for Pro Bono Placements.",
    "The Pro Bono Placement opportunity on OnTRAC II indicated the number of hours. Does that mean that it will be the total number of hours I will be awarded from participating too? The number of hours indicated on the OnTRAC II postings are an estimation. We will need your Performance Appraisal and Pro Bono Timesheet at the end of your Pro Bono Placement, to determine the actual number of Pro Bono hours you have fulfilled. Please refer to the results emailer which was sent to you upon successful ballot for the documents required.",
    "Can I start my Pro Bono placement before passing the Community Service e-Briefing quiz? No. In order for you to start fulfilling your Pro Bono graduation requirement, you must pass the Community Service e-Briefing quiz first. The e-Briefing sets the tone on how you can engage with the community. It will also guide you on the pro bono and community service administrative procedures.",
    "What documents must I submit at the end of my Pro Bono Placement, and where do I submit the documents? At the end of your Pro Bono Placement, please submit the completed and endorsed PBC Performance Appraisal and PBC Timesheet to SMU Pro Bono Centre dropbox located at School of Law, Level 4, outside General Office. Please refer to the results emailer which was sent to you upon successful ballot for the documents required. Both PBC Performance Appraisal and PBC Timesheet are available on OnTRAC II > Resources > Document Library.",
    "When can I commence on Pro Bono? You can commence Pro Bono at the end of your Year One Term Two exams. You will also receive recruitment emailers from SMU Pro Bono Centre when you are eligible to apply Pro Bono Placement.",
    "When do Pro Bono Placements come out on OnTRAC II? Recruitments for Pro Bono Placement often occur between 1 to 2 months in advance of the actual Pro Bono Placement. Please keep a look out for recruitment emailers from SMU Pro Bono Centre (PBC) to sign-up for the Pro Bono Placement via SMU PBC Google forms.",
    "When will my Pro Bono Placement record be updated? Your Pro Bono Placement records will only be updated, after we have received and reviewed the PBC Performance Appraisal and PBC Timesheet.",
    "Where can I check the number of Pro Bono hours which I have completed? Please log on to OASIS, click on \"Career and Jobs\" tab followed by the \"Participation and Grading\" link to check the total number of Pro Bono hours.",
    "How do I find a Pro Bono Placement? You can refer to recruitment emailers from SMU Pro Bono Centre on Pro Bono Placement opportunities.",
    "Why can’t I access the google forms to indicate my interest for Pro Bono Placement? Kindly log-in using your SMU student username, dropping the “law” domain (i.e. username@smu.edu.sg), clearing your cache after logging out of your personal google drive beforehand, in order to access the google form and complete it online.",
    "Why is my application to the Pro Bono Placement on OnTRAC II not approved? Pro Bono Placement postings on OnTRAC II are only applicable for students who have been successfully recruited via ballot or first-come-first-serve recruitments.",
    "Will all Pro Bono Placement opportunities be considered towards my graduation requirement? Pro Bono Placement must be SILE-approved and recruited via SMU Pro Bono Centre. Students must also apply for the successfully balloted Pro Bono Placement on OnTRAC in order for participation record to be created and for Pro Bono hours to be recognised.",
    "How many Pro Bono hours do I need? As part of the graduating requirement, students (both LLB and JD) are required to complete the mandatory 20 hours of pro bono volunteer work.",
    "I have completed more than one Pro Bono Placements. Must I submit a Community Service Report for each of the Pro Bono Placement? You are only required to submit ONE report. If you have completed multiple Pro Bono Placements/Community Service projects, you may write the report based on the single placement that you have completed the most number of hours for, or based on all the placements that you have participated in/experienced throughout your course of study at SMU.",
    "I have forgotten to apply on OnTRAC II before the deadline. Can I apply later and have my participation in the Pro Bono Placement count towards my graduation requirement? No, please note that we do not backdate Pro Bono Placement. For your participation to be considered towards your graduation requirement, you must apply on OnTRAC II before commencing on your pro bono placement.If the posting is still available on OnTRAC II, please apply immediately. We would require time to respond and approve your application. The record of your pro bono placement will commence according to the minimum timeline following your OnTRAC II submission date (at least 7 working days).",
    "I have just completed my Pro Bono Placement. Where can I go to complete my Community Service Report? You will need to submit the PBC Performance Appraisal and PBC Timesheet to SMU PBC Dropbox located at SOL, level 4 – outside General Office. Kindly note that you are only required to submit ONE Community Service Report via OASIS. You should submit the report within one month of you completing the first 80 Pro Bono/Community Service hours of your degree requirement.",
    "Can I complete the university graduating requirement for 80 hours of Community Service (50 hours for JD students) by doing solely Pro Bono? Yes, you may. Please keep a lookout for recruitment emailers from SMU Pro Bono Centre on Pro Bono Placement opportunities.",
    "Can I do a mutual swop with my peers for the Pro Bono Placement? No swopping of slots is allowed. Please ensure that you are able to attend all sessions before signing up. Students who are unsure of their schedules should refrain from signing up.",
    "Can I withdraw from the Pro Bono Placement after I have been successfully balloted? Withdrawal is only allowed based on a case-by-case basis (e.g. medical reasons, extenuating family circumstances), and must be supported by documentary evidence such as a Medical Certificate or Certificate of Death). If you decide to pull out from the Pro Bono opportunity after you have been successfully balloted without a valid reason, you will be blacklisted. Students who are blacklisted will be denied applications for two months and be denied priority in the last year of graduation against non-graduating students.",
    "Does the Community Service condition which limits placements to 3 organisations for Community Service of 80 hours (50 hours for JD students) apply to Pro Bono Placement? No, you are not restricted to the number of organisations for Pro Bono Placements.",
    "The Pro Bono Placement opportunity on OnTRAC II indicated the number of hours. Does that mean that it will be the total number of hours I will be awarded from participating too? The number of hours indicated on the OnTRAC II postings are an estimation. We will need your Performance Appraisal and Pro Bono Timesheet at the end of your Pro Bono Placement, to determine the actual number of Pro Bono hours you have fulfilled. Please refer to the results emailer which was sent to you upon successful ballot for the documents required.",
    "Can I start my Pro Bono placement before passing the Community Service e-Briefing quiz? No. In order for you to start fulfilling your Pro Bono graduation requirement, you must pass the Community Service e-Briefing quiz first. The e-Briefing sets the tone on how you can engage with the community. It will also guide you on the pro bono and community service administrative procedures.",
    "What documents must I submit at the end of my Pro Bono Placement, and where do I submit the documents? At the end of your Pro Bono Placement, please submit the completed and endorsed PBC Performance Appraisal and PBC Timesheet to SMU Pro Bono Centre dropbox located at School of Law, Level 4, outside General Office. Please refer to the results emailer which was sent to you upon successful ballot for the documents required. Both PBC Performance Appraisal and PBC Timesheet are available on OnTRAC II > Resources > Document Library.",
    "When can I commence on Pro Bono? You can commence Pro Bono at the end of your Year One Term Two exams. You will also receive recruitment emailers from SMU Pro Bono Centre when you are eligible to apply Pro Bono Placement.",
    "When do Pro Bono Placements come out on OnTRAC II? Recruitments for Pro Bono Placement often occur between 1 to 2 months in advance of the actual Pro Bono Placement. Please keep a look out for recruitment emailers from SMU Pro Bono Centre (PBC) to sign-up for the Pro Bono Placement via SMU PBC Google forms.",
    "Am I able to enroll for FTW100 series and FTW200 series within the same term? The completion of FTW100 series (both components inclusive) is a pre-requisite for the enrolment for FTW200 series. FTW100 components are not to be undertaken in the same term as FTW200 series. Similarly, the five components for FTW200 series should be taken within the same term for consistency reasons.",
    "How can I find out the schedule of FT workshops and more information about the instructors teaching the FT workshops? Information about the FT programme (including the schedule and instructor profile) is housed under OASIS> Careers & Comm Services> The Finishing Touch.",
    "How do I find out about the Assessment Criteria for the FT workshops? Information about the FT programme (including Assessment Criteria) is housed under OASIS> Careers & Comm Services> The Finishing Touch> Assessment Criteria.In order to complete the series within one term, it is crucial for students undertaking the series to understand the assessment criteria and expected workload for the enrolled FT workshops. Each workshop comes with its set of assignments. Please visit the information before your Term starts.",
    "How do I know my results of the FT series? Each term, FT Instructors will inform DKHMCC when the grading is completed.DKHMCC (Finishing Touch) will send out an announcement email to students when it is ready for students to view your results in Week 15 of the term.The results are viewed via eLearn and if you have discrepancies about your awarded grade, please contactfinishingtouch@smu.edu.sg immediately. The results verification process will lapse when the term closes. Your degree progress report will reflect the completion of the FT degree requirement at the end of the term after you complete your FTW200 series successfully. Your degree progress report will not reflect the completion of your FTW100 series.",
    "How do I register for the FT workshops? You may enroll for your FT workshops via BOSS. Students will be given 20 e-points per term to facilitate your necessary bidding for workshops. Please make reference to the BOSS Bidding Calendar to stay informed about the bidding rounds and timings available. Unused e-points will be accumulated to the next term.",
    "Is it compulsory to do the FT workshops? It is compulsory for SMU students matriculated in AY2011 onwards to complete three degree requirements namely, Community Service, Finishing Touch and Internship. As a degree requirement, FT will be for a \"Pass/Fail\" grade. The FTW100 and FTW200 series count towards the mandatory FT programme to complete in order to fulfill the FT degree requirement. Undergraduates are required to complete and achieve a PASS grade for all the seven compulsory workshops during your SMU candidature before filing for graduation.",
    "What if I am late or miss my workshop? You are expected to be punctual for your FT workshops. Instructors may turn you away if you are late and you may end up having to repeat the workshops in the subsequent term.Once students are successfully enrolled for the FT workshops, it is expected that you attend the assigned dates and times at the correct venue. Please do not gate-crash other classes without permission granted.If you miss your workshop, please contact DKHMCC at finishingtouch@smu.edu.sg within 48 hours, providing your reason for absence. Only students with valid reasons (MC or compassionate reasons) will be allowed to attend a substitute or cater for alternative arrangement available at the point in time under mutual agreement between the instructor and DKHMCC.",
    "What if I am unable to get a seat in the FT workshops? Please monitor the various bidding rounds for available seats or drop-outs that may create a vacancy. FTW100 and FTW200 workshops are offered in Term 1 and Term 2. Term 1 usually has a higher tendency for vacancies to run out in the earlier bidding rounds and windows.Please plan along your course workload at the same time and you may consider taking the FT workshops in Term 2 if you are unable to get a seat in any of the bidding rounds for Term 1 workshops.",
    "What if I fail a workshop? Students who fail any of the workshops will be notified in the same announcement email regarding your necessary follow-up actions. You are expected to repeat the component workshops for which you have not passed.Students requiring completing any FTW100 workshops would be advised to bid for FTW100 SG sessions in the next term in order to complete FTW100 series. As the SG sessions denoting the respective components will be determined at the end of the term, please check back the announcement email which will provide you with directions accordingly. Students requiring completing any FTW200 workshops will be pre-assigned by DKHMCC to FTW200 SG sessions that would take place in the next immediate term. FTW200 SG sessions are held on Saturdays to avoid clashes with academic coursework.",
    "What is the timeline for me to complete my FT workshops? The FT workshops are offered in Term 1 and Term 2 to cater to the cohort size. We highly recommend all Year 1 students to complete your FTW100 series within your 1st year and the FTW200 series within your 2nd year. This frees up your 3rd and 4th year for all prospects like internship, exchange programmes and other projects / commitments that you could undertake in your junior and senior years. If you are unable to complete the FTW100 and FTW200 series, you would need to cater for clearing these in your 3rd and 4th year. Any further delays to complete it may potentially delay your graduation period.The FTW100 series comprises of two components:FTW101: Self Discovery and AwarenessFTW102: Career PlanningThe FTW200 series comprises of five components:FTW201: Job Search StrategiesFTW202: Resume and Cover Letter writingFTW203: Social Etiquette and Groom for SuccessFTW204: Personal Branding and Networking SkillsFTW205: Interviewing Skills When you enroll for the FT series, take note that these are bundle workshops ie. you will be enrolling for a class for FTW100 series (consisting of two components), or a class for FTW200 series (consisting of five components), unless otherwise advised.",
    "Who do I contact for help and advice needed for the FT programme? Please contact DKHMCC at finishingtouch@smu.edu.sg if you have any further queries related to the FT programme.",
    "Why are there FTW300 workshops even though the mandatory requirement is to complete FTW100 and FTW200 series for the FT degree requirement? The FTW300 workshops are offered as electives covering specific topics at the advance level and do not form part of the mandatory FT requirement. FTW300 elective workshops are non-assignment based and participating students will not be graded. These electives are offered to prepare students in the junior and senior years with the skills crucial in the job application process. Information for the FTW300 electives will be sent to students who have cleared the FT degree requirement and voluntary sign-up is via OnTRAC II's Events Page. The EDM will be sent out in the first two weeks of each term.",
    "How do I obtain the e-quiz result? The e-quiz’s result is available on OnTRACII > My Account > Personal; ‘Attended e-Internship Briefing’ will be marked as ‘Yes’ once you have passed the e-quiz.",
    "What will my internship grade reflect on OASIS? Your unofficial transcript will reflect “Complete” or “Incomplete” for your internship graduation milestone.",
    "How do I submit my self-proposed internship on OnTRAC II ? Go to “Self-proposed Internship” on the left menu bar to submit your self-proposal for DKHMCC’s review / approval after you have received and accepted the offer.",
    "What shall I do if I am unsure whether the job scope fulfils SOA’s internship requirements? You may contact your career coach to verify the job scope for non-traditional accounting roles that meets the BAcc requirements. The job scope may be reviewed by SOA Associate Dean (Curriculum and Teaching), if necessary.",
    "Does DKHMCC share my internship report with my supervisor? DKHMCC does not share your internship report with your supervisor/employer. Your supervisor/employer has to request for the report from you directly",
    "What shall I do if I am unsure whether the job scope fulfils SIS’s internship requirements? You may contact your career coach to verify the job scope that meets the BSc (IS) requirements",
    "How do I verify the number of weeks completed or outstanding for my internship? You can verify the number of completed or outstanding weeks through your progress report via OASIS after the designated grading days.",
    "When can I do my first internship? All students, except law students, can embark on internships after completing two terms of coursework. Law students may do so after four terms of coursework for the internship to be recognised for graduation purposes.",
    "How long do I have to accept the internship role on OnTRAC II? You will need to “accept” the role on OnTRAC II within 72 hours.",
    "When is the online employer evaluation form due? Your supervisor should complete the online employer evaluation form within one month from the internship end date.",
    "You will need to “accept” the role on OnTRAC II within 72 hours.The e-quiz compries of 10-12 multiple choiced questions.",
    "When is the SMU Internship period? SMU has two internship periods per year for all schools: - Winter internship: December to early January - Summer internship: late April to mid August Internships can take place anytime during these two periods. There are also: Part-time internship: During term-time (capped at 16 hours per week for Student Pass Holders) Six-month internship: Students are required to apply for Leave of Absence (LOA). Restrictions apply to Student Pass Holders",
    "How many times can I attempt the internship e-quiz? Students may attempt the e-quiz as many times as needed to attain a passing score of 80%.",
    "When will my internship be graded? Subject to the receipt of your internship report and the employer evaluation form, your internship will be graded during the designated Grading Days in the last week of March and October. The update of your milestone status will be reflected in OASIS at the end of March and October. Grading priority will be given to graduating students. Email enquiries pertaining to this matter before Grading Days will not be entertained.",
    "When will my internship grade be reflected in OASIS? Your internship grade will be reflected in OASIS at the end of March and October.",
    "How to apply for Leave of Absence (LOA)? To apply for LOA: 1) Log into OASIS 2) Go to \"Academics\" 3) Go to \"Enrolments & Withdrawals\" 4) Complete Online Form SOL does not grant LOA approval for Internship. You are to submit your LOA application by the second Friday after the new academic term starts to avoid school fees penalty. Please familiarise yourself with the LOA policies before applying(https://oasis.smu.edu.sg/Pages/RO/Leave-of-Absence.aspx)",
    "Am I eligible for internship exemptions? Exemption for internship (partial or full) may be granted to polytechnic students (only) if they have completed a relevant business attachment during their polytechnic study. Exemptions are not automatically granted. Note: SIS and SOL do not grant exemptions for Internship.",
    "How will I be informed of the outcome of my self-proposal? You will receive an email informing of the outcome of your self-proposal application from the DKHMCC approving officer.",
    "When will the online employer evaluation form be emailed to my supervisor? The online employer evaluation form will be sent to your supervisor on a standardized date. However if you wish to have the appraisal link sent to your supervisor early, it can be manually triggered. Please inform your DKHMCC approving officer of your request with your supervisor’s contact.",
    "Am I entitled to annual leave during my internship stint? Annual leave entitlement is subject to the terms of the internship offered by the employer.",
    "How will part-time internship hours be accounted for? A time-sheet(https://docs.google.com/spreadsheets/d/1Oqd9_xeJpEglBxTKh73wcM9AZsl0XtR36Eabkbhtiug/edit#gid=1312322944), stating the date/time worked and signed by your supervisor, must be submitted to DKHMCC at the end of your internship for review.",
    "Where can I attempt the internship e-quiz? The e-quiz is available on the eLearn platform, 24/7.",
    "Am I subjected to tuition fee penalty for Term 3 if I am going on an internship in the Summer? For students who have successfully applied for or self-sourced an internship on OnTRACII in the Summer Term (Term 3), there is no tuition fee penalty, i.e. 100% refund of tuition fee when Term 3A/B courses are dropped during BOSS 2. Note: Students who drop Term 3A/B courses after BOSS 2 will get a \"W\", but not the tuition fee penalty",
    "I forgot to submit my internship self-proposal for a previously performed internship; can I still get it recognised? DKHMCC does not recognise backdated internships or approve internships in retrospect. This policy safeguards the programme's integrity and ensures that the internship you have sourced for is related to your course of study for graduation requirement. Your internship is not recognised without an approval from DKHMCC via OnTRACII.A self-proposal submitted after the start of the internship will only be recognised from the date of submission onwards.",
    "Where can I check my assigned career coach on OnTRAC II? Where can I check my assigned career coach on OnTRAC II? ",
    "Can I accept an internship offer that is less than a 10-week duration? For SIS students, they must intern in a full-time, IS-related job scope for a minimum of 10 continuous weeks to fulfil graduation requirements.",
    "I have already fulfilled the 10-week mandatory internship requirement. Do I still have to submit an internship report for my subsequent internships?  Does my supervisor need to submit an employer evaluation form? Though not compulsory, you are encouraged to journal your experiences in your internship report for subsequent, non-mandatory internships. However, the employer evaluation form is still required for all internships performed.",
    "How and when do I verify the number of weeks completed or outstanding for my internship? You can verify the number of completed or outstanding weeks through your progress report via OASIS after the designated grading days",
    "What shall I do if I am unsure whether the job scope fulfils SOA’s internship requirements? You may contact your career coach to verify the job scope for non-traditional accounting roles that meets the BAcc requirements. The job scope may be reviewed by SOA Associate Dean (Curriculum and Teaching), if necessary.",
    "Can I accept an internship offer that is less than a 10-week duration? For Accountancy students, a combination of internships accumulating to 10 weeks of accountancy-related job scope is permitted.",
    "I have been offered an internship but my application status is not updated on OnTRACIIFor internship applications submitted through OnTRACII, please inform DKHMCC immediately after you have been offered an internship and forward the email notification/offer letter from the company for updating of your internship application status. Email DKHMCC at placement@smu.edu.sg.The approving officer from DKHMCC will send an internship confirmation email to you and the host organisation. Login OnTRACII to “accept” the role within 72 hours",
    "Where can I check the e-internship briefing status on OnTRAC II? Login tohttps://ontrac.smu.edu.sg.Go to My Account > Personal on the left menu bar to view your Internship Briefing Record. ‘Attended e-Internship Briefing’ will be marked as ‘Yes’ once you have passed the e-quiz.",
    "Can I embark on a part-time internship to fulfil my degree requirement? Yes, you may. However, it is recommended to embark on a full-time internship for maximum exposure and experience at a company as the job requirements will be more intense as compared to part-time internships. Students who have difficulty committing to a full-time internship may discuss their options with their career coaches.",
    "I have uploaded a wrong resume / cover letter for my internship application.You can delete your current application and submit a fresh application with the new resume and cover letter.Always ensure that you have submitted the correct resume and cover letter. Documents that are incorrect will not be submitted to employers.",
    "Where can I download the time-sheet? The time-sheet form can be found via OnTRACII > Resources > Document Library",
    "Can I embark on an internship during term-time? You are required to apply for Leave of Absence (LOA) if you are embarking on full-time internships during term-time. Approval is at the sole discretion of your respective schools. Student Pass Holders are only permitted to embark on a term-time local internship if they have yet to fulfil their mandatory 10-week internship requirement. Please refer to the LOA policies before applying: LOA Policy: Log in OASIS > Academics > Internship/Community Service > MOM Rules on Local Internships During Term-Time (for Student Pass Holders Only) Refer the MOM website for the latest policies on employment of foreign students:<http://www.mom.gov.sg/passes-and-permits/work-pass-exemption-for-foreign-students",
    "If a public holiday falls within the duration of my internship of 10 weeks, do I have to extend my internship to fulfil the mandatory duration of 10 weeks? As per MOM’s guidelines(http://www.mom.gov.sg/employment-practices/public-holidays-entitlement-and-pay),DKHMCC encourages employers to provide the same staff benefits to interns as that provided to full-time staff. If off-in-lieu is provided, you will not need to extend your internship to make up the off days taken.",
    "Where can I find the e-Internship Guide? The e-Internship Guide can be found via OnTRACII > Resources > Document Library or on eLearn for your reading before attempting the e-quiz",
    "Can I get ICT deferment during my internship? The Academic Calendar(https://inet.smu.edu.sg/sites/courses/Documents/Current+or+Future+Academic+Calendar/2016-2017/2016-17.pdf)indicates the blackout periods (labelled as ‘1st Yr ICT’, ‘2nd Yr ICT’ and ‘3rd ICT’) identified for ICT within each academic year. DKHMCC does not issue any supporting letters for ICT deferment during the blackout periods. Students are recommended to declare their ICT commitments to the host organisation during the internship interview. Please check your ICT dates before applying for internships to prevent a clash between these two commitments. If you are called up for ICT after being offered the internship, please check with your employer on the possibility of extending the internship and update DKHMCC on the final confirmed duration.",
    "If I have already fulfilled the 10-week mandatory internship requirement, does my supervisor need to submit an employer evaluation form, for my subsequent internships? The employer evaluation form is required for all internships performed.",
    "Can I intern in my own company? Interning in your own company will not fulfil your graduation requirement for internship except for SIS students. Your immediate supervisor cannot be a family member and/or a part of your family business as well.",
    "Is the e-internship briefing compulsory? Students must complete the e-internship briefing by reading the e-Internship Guide and pass the e-quiz (comprising 10-12 multiple choice questions) as an internship prerequisite. Upon passing the e-quiz, you will be able to view and apply for internship opportunities and/or submit a self-proposal for a self-sourced internship on OnTRACII. The e-internship briefing and the Freshmen Orientation Camp’s presentations by DKHMCC career coaches are separate activities",
    "Where can I see my confirmed internship details on OnTRAC II? Go to My Account > Internship/Community Service to view the details of the internship. If you want to edit the internship details like start date or end date of the internship, please email your Account Manager of the company that you are interning with.",
    "Can I still apply for internships even though I am exempted? Yes, you may apply for internships even with an exemption granted. However, you will need to complete the e-internship briefing and pass the e-quiz before being able to submit an internship application or self-proposal.You may also consider lifting the exemption; otherwise, your transcript will reflect your internship status as exempted. Your transcript will indicate PASS on completing your internship graduation requirement. Students who wish to lift their exemption may approach their respective schools. By lifting your exemption, you are now subject to the graduation requirements for internship and must duly submit the internship report and employer evaluation form one month from the internship end date. Please inform DKHMCC when the exemption is lifted so you can submit your report via OnTRAC II",
    "Is undertaking an internship compulsory? You are required to complete a minimum 10-week approved internship (equivalent to 400 hours) during your course of study to fulfil your graduation requirement. The Schools of Accountancy, Information System and Law students have additional school-specific requirements for internships. Double degree students are to ensure that the internship criteria set for both primary and secondary degree programmes are satisfied. An internship that fulfils school-specific requirements stipulated by SOA, SOL and SIS would usually fulfil the internship requirements of LKCSB, SOE and SOSS. Double degree students with primary and secondary degree programmes from SOA, SOL and SIS would need to complete two relevant 10-week internships",
    "Where can I upload my resume on OnTRAC II? Go to Documents > Resumes on the left menu bar to upload the documents.",
    "Can I submit a self-proposal application for an internship that I have already completed? DKHMCC does not recognise backdated internships or approve internships in retrospect. Your internship is not recognised without an approval from DKHMCC via OnTRACII. A self-proposal submitted after the start of the internship will only be recognised from the date of submission onwards.",
    "School of Accountancy (SOA) i) Can I accept an internship offer that is less than a 10-week duration?  ii) What kinds of internship will satisfy SOA’s internship requirements?  iii) What shall I do if I am unsure whether the job scope fulfils SOA’s internship requirements? A combination of internships accumulating to 10 weeks of accountancy-related job scope is permitted.All roles offered by the Big Four professional firms will satisfy the BAcc internship requirements. For other accounting and non-accounting firms, the nature of work must be accounting -related. Please refer to the SOA internship guidelines.You may contact your career coach to verify the job scope for non-traditional accounting roles that meets the BAcc requirements. The job scope may be reviewed by SOA Associate Dean (Curriculum and Teaching), if necessary.",
    "Why am I unable to upload more documents on OnTRAC II? You are allowed a maximum of 20 documents in the document library. Please delete older documents to make way for new documents.",
    "Can I switch to another organisation in the midst of my term-time internship under LOA? You may do so provided a self-proposal for the subsequent internship is submitted for review / approval by DKHMCC. The original internship should also be professionally concluded with your supervisor with ample notice given and internal procedures observed.",
    "School of Information Systems (SIS) i) What are the internship requirements for SIS students?  ii) Can I accept an internship offer that is less than a 10-week duration?  iii) How do I find out more about SIS internships?  iv) What shall I do if I am unsure whether the job scope fulfils SIS’s internship requirements? Please refer to the SIS internship guidelines for these requirements.SIS students must intern in a full-time, IS-related job scope for a minimum of 10 continuous weeks to fulfil graduation requirements.You can find out more about the industry sectors, internship roles, internships by industries and internship experience posters at the SIS website.You may contact your career coach to verify the job scope that meets the BSc (IS) requirements.",
    "Why can't internships be backdated? DKHMCC does not recognise backdated internships or approve internships in retrospect, to safeguard the programme's integrity and ensure that the internship sourced for is related to your course of study as part of your graduation requirement.",
    "Can I use my scholarship obligations to fulfil the graduation requirement for internship? Serving the sponsoring company to fulfil your scholarship obligations during the summer/winter breaks does not automatically count towards your internship graduation requirement. You will still need to submit a self-proposal via OnTRAC II for DKHMCC’s approval before commencing the stint.",
    "School of Law (SOL) i) What are the internship requirements for SOL students?  ii) Can I intern in a non-approved law organisation?  iii) How do I go about applying for internships not posted on OnTRACII ? Please refer to the SOL internship guidelines for these requirements.You are required to email to llbinternships@smu.edu.sg to seek approval, on a case-by-case basis, from Associate Dean (External Relations) before the start of your internship. Your self-proposal should include this approval email and the law organisation’s offer letter/email for approval by DKHMCC.Click here for the list of approved law organisations for SOL’s internship programme.Please refer to these procedures",
    "Why does my internship application indicate a Pending by system status? This status could be due to: i) Submission of internships to the employer after the application closing date; ii) Download of students’ resumes by employers, without update to the application status field.",
    "Do I have to extend my internship to make up the shortfall due to medical leave taken during my 10-week internship? DKHMCC encourages employers to provide the same staff benefits to interns as that provided to full-time staff. If medical leave is provided, interns will not need to extend their internship to make up the shortfall of up to three days of medical leave.. For medical leave exceeding three days, you are to inform the approving officer from DKHMCC for review of your actual internship duration",
    "What are the internship requirements for SIS students? You can refer to the SIS internship guidelines(https://sis.smu.edu.sg/sites/default/files/sis/faq_on_sis_internships.pdf)for the requirements.",
    "Why I am unable apply for the internship/job on OnTRAC II? Please check the Screening Criteria for each position. You will normally need to complete the e-internship briefing before you can apply. A maximum of 20 applications are allowed per term.",
    "How can I fulfil my graduation requirement for internship? All students must complete a minimum 10-week approved internship comprising 400 hours during your course of study",
    "Do I still have to submit an internship report for my subsequent internships, if I have already fulfilled the 10-week mandatory internship requirement? Though not compulsory, you are encouraged to journal your experiences in your internship report for subsequent, non-mandatory internships.",
    "What are the internship requirements for SOL students? Please refer to the SOL internship guidelines(https://docs.google.com/document/d/14NzkFx-4AUI8OBbF5Odjk6CkYbKbwaz4Ui083gyQUns/edit)for these requirements.",
    "Why I am unable see my internship self-proposal on OnTRAC II? The “Self-proposed Internship” on the left menu bar is only visible after completion of the e-Internship Briefing.",
    "What are the internship requirements? A minimum 10-week approved internship (equivalent to 400 hours) during your course of study is required to fulfil your graduation requirement. The Schools of Accountancy, Information System and Law students have additional school-specific requirements for internships. An internship that fulfils school-specific requirements stipulated by SOA, SOL and SIS would usually fulfil the internship requirements of LKCSB, SOE and SOSS. Double degree students from SOA, SOL and SIS would need to complete two relevant 10-week internships.",
    "Why I am unable to book an appointment with my career coach on OnTRAC II? Only available appointment slots with your career coach are visible. You can email your career coach if you need to see your career coach urgently.",
    "What do I do if there is a change in my direct supervisor? Please inform your DKHMCC approving officer on the change in supervisor details - name, designation, contact number and email address.",
    "Why I cannot see the accept button for internships offered to me on OnTRAC II? You must login into DKHMCC’s portal onhttps://singapore-management-csm.symplicity.com/students/index.phpto accept internship offers.",
    "What do I do should issues arise amid the internship? The approving officer from DKHMCC or your assigned career coach should be informed of any matters that may arise during an internship. If you are unsure who your career coach is, log into OnTRACII, > My Account > Personal for the details.",
    "Why I still cannot see the internship job posting after I completed my e-Internship briefing on e-Learn? E-internship Briefing status is only updated once a week and it may take up to one week before the status is updated.",
    "What happens if I lift my internship exemption? By lifting your exemption, you are now subject to the graduation requirements for internship and must duly submit the internship report and employer evaluation form one month from the internship end date.",
    "What I should do when the document that I tried to upload exceeds the maximum size allowed on OnTRAC II? You can save the document in pdf format. You can also try to reduce the size by compressing the pdf.",
    "What if my local internship requires me to travel overseas for work? Please furnish the approving officer from DKHMCC with details of the overseas travel. You will need to complete and submit the Acknowledgement of Risk & Undertaking form (insert R&UF) to DKHMCC prior to the overseas travel. Where travel insurance is not provided by the employer, you will need to purchase your own travel insurance. In such a scenario, submit the proof of insurance coverage with the completed Acknowledgement of Risk & Undertaking form to the approving officer of DKHMCC before your overseas travel. Please note that the recommended travel insurance coverage is S$150,000 for life and S$250,000 for emergency evacuation.* Please note that coverage provided by the travel insurance is not the same as the medical insurance provided by the host organisation",
    "What information do I need to create a self-proposal? Please attach your offer letter/email in your self-proposal submission and ensure the following information is submitted: Name of Organisation Address Department/Division Detailed Job Scope Internship Start and End Date Allowance (if any) Supervisor’s Details (Name, Designation, Telephone number, Email) If your internship host organisation is not an existing employer, a representative would need to first register the company on OnTRAC II.",
    "What is the maximum number of internship applications that a student can submit on OnTRACII? Each student can submit up to 20 internship applications per summer on OnTRACII. The cap is intended to prevent students from applying to a position without thoughtful consideration.Please arrange to meet your career coach / Career Champion should you require advice on writing a good cover letter and/or resume",
    "What is the number of hours allowed for Student Pass holders to work part-time in Singapore? The number of hours for Student Pass Holders to work part-time during the term is capped at 16 hours per week.",
    "How can I intern in a non-approved law organisation? You are required to email llbinternships@smu.edu.sg, to seek approval from the Associate Dean (External Relations) before the start of your internship. Your self-proposal should include this approval email and the law organisation’s offer letter/email for approval by DKHMCC. Click here for the list of approved law organisations for SOL’s internship programme(https://law.smu.edu.sg/programmes/bachelor-laws/internship-law).",
    "What should I do if I have been offered an internship but my application status is not updated on OnTRAC II? For internship applications submitted through OnTRAC II, please forward the email notification/offer letter from the company, to your career coach, immediately after you have been offered an internship. The approving officer from DKHMCC will then send an internship confirmation email to you and the host organisation. Career coach: OnTRAC II > My account > Personal",
    "What is the passing score for the internship e-quiz? The passing score for the e-quiz is 80%.",
    "What is the process to seek endorsement from DKHMCC for internship participation and waiver of Term 3 tuition fee penalty? Students need to accept the internship offer or have their self-proposal for internship approved on OnTRAC II, before completing the Term 3 waiver request form to seek DKHMCC’s endorsement of internship participation and waiver of the tuition fee penalty. The waiver request form can be found online at:https://docs.google.com/forms/d/e/1FAIpQLSfktdYAmDgi16SGOmjfz0MPrpDQdldtrZKN18v09rFMBky0Vw/viewformDKHMCC will then notify the BOSS Team regarding the internship status to support the tuition fee penalty waiver.",
    "What is the recommended travel insurance coverage for overseas work travel? Please note that the recommended travel insurance coverage is S$150,000 for life and S$250,000 for emergency evacuation. The coverage provided by the travel insurance is not the same as the medical insurance provided by the host organisation.",
    "What kinds of internship will satisfy SOA’s internship requirements? All roles offered by the Big Four professional firms will satisfy the BAcc internship requirements. For other accounting and non-accounting firms, the nature of work must be accounting -related. Please refer to the SOA internship guidelines (https://docs.google.com/document/d/1zDGrypnZ8-bxW3WEtEjjJ9iZC5s-GeqoponVWlY1Gd8/edit).",
    "What overall grade must I receive for my employer evaluation in order to pass my mandatory internship? You must receive an overall grading of “Average”, “Good” or “Excellent”. You will be required to undertake another internship if you receive an overall grading of “Below Average” or “Poor”.",
    "How do I apply for internship exemption? Exemption for internship (partial or full) may be granted to polytechnic students (only) if they have completed a relevant business attachment during their polytechnic study. Exemptions are not automatically granted. Polytechnic students should submit a copy of their internship certificate and other supporting documents on the job scope to their respective Dean's Office for evaluation. Note: SIS and SOL do not grant exemption for Internship",
    "What should I do if I have uploaded a wrong cover letter for my internship application? You can delete your current application and submit a fresh application with the new resume and cover letter. Always ensure that you have submitted the correct resume and cover letter. Documents that are incorrect will not be submitted to employers.",
    "How do I complete the e-internship briefing? The e-Internship briefing can be completed by reading the e-Internship Guide, and passing the e-quiz before being able to view and apply for internship oportunities and/or submit a proposal for a self-sourced internship on OnTRAC II. The e-internship briefing and the Freshmen Orientation Camp’s presentations by DKHMCC career coaches are separate activities.",
    "What should I do if I would like to lift my internship exemption? Students who wish to lift their exemption may approach their respective schools, and inform DKHMCC when the exemption is lifted.",
    "How do I create a self-proposal for my self-sourced internship? Create and submit your internship self-proposal via OnTRAC II for DKHMCC’s review / approval after you have received and accepted the offer. You should attach your offer letter/email as a supporting document to facilitate processing and approval. Law students should also upload SOL’s approval email as a supporting document for non-approved law organisations.",
    "What should I do if my local internship requires me to travel overseas for work? You will need to: 1) Inform the DKHMCC approving officer with details of the overseas travel 2) Complete and submit the Acknowledgement of Risk & Undertaking form (insert R&UF) to your DKHMCC approving officer before your overseas travel 3) Purchase your own travel insurance if it is not provided by your employer, and submit the proof of insurance coverage with the completed Acknowledgement of Risk & Undertaking form before your overseas travel.",
    "How do I find out more about SIS internships? You can find out more about the industry sectors, internship roles, internships by industries and internship experience posters at the SIS website(https://sis.smu.edu.sg/bsc-information-systems/learning/curriculum/internships).",
    "What should I do if there has been a change in my internship dates? You are recommended to consult with the approving officer from DKHMCC before proposing any changes to your company. Please inform DKHMCC once your change in dates with the company has been confirmed, together with the official documents endorsed by your supervisor or HR indicating the change in dates. The revised dates will be reflected in your OASIS record within two weeks.",
    "How do I go about applying for internships not posted on OnTRAC II? Please refer to these procedures(https://law.smu.edu.sg/programmes/bachelor-laws/why-smu-law/internships-career/procedure-internships-not-posted-ontrac).",
    "What should I take note of when my internship ends? You are required to submit your internship report via OASIS within one month from your end date. An internship report submitted by mistake can be rejected by the approving officer from DKHMCC and then re-written and re-submitted.The online employer evaluation form will be sent to your supervisor and you are required to remind your supervisor to complete the form at the end of your internship. If the hardcopy version is used, please ensure that the form is endorsed with your supervisor's signature and company stamp. You can download a copy of the employer evaluation form from the document library on OnTRAC II",
    "How do I register for courses? Students register for courses only via the BOSS Bidding system. Students will be given a sum of e$ to bid for the courses they want. The cost of a course and a particular group/timing will differ depending on the demand among SMU students. Exchange students will go through one round of BOSS bidding before the term starts (Round 1C), and two more rounds when term starts (Round 2 and 2A). Each round has 3 windows, which spans 1-2 days each. BOSS Round 1C is exclusive to exchange students only.BOSS Round 2 and 2A are for all students (SMU and exchange).",
    "Are there penalties for the dropping of courses? There is no e$ penalty for dropping courses during the BOSS bidding; however, there are different refund policies between Round 1C, 2 and 2A. There are grade penalties (‘W’ and ‘F’ grade) for dropping courses after the add/drop period.",
    "What courses are available for the academic year? Please go to Course Offerings (https://inet.smu.edu.sg/sites/courses/Pages/Course-Offerings.aspx) for a list of SMU courses available for each school during each academic year.",
    "What do the numbers \"0\", \"1\", \"7\" mean in the course catalogue? If you see \"0\" next to a course, it means that it will not be held during that term. If you see \"1\" next to a course, it means that 1 session (class) will be held during the term. If you see \"7\" next to a course, it means that 7 sessions (classes) will be open during the term. When you make your course selection, you have to indicate which session you'd like to attend. Different sessions have different time-slots and/or instructors.",
    "What does it mean by Modified Term 2? In addition to the regular spring term, SMU offers courses in Modified Term 2. 80% of the courses offered during the Modified Term are from the School of Accountancy.",
    "What does it mean if a course has G1(1) and G1(2) in the class timetable? These groups are given numbers to represent the different time slots in which they will be held. For instance, G1 means Group 1, and G1 (1) and G1 (2) are two halves of the G1 course. You must attend both sessions. You will need to ensure that the schedules of both sessions do not clash with your other selected courses.",
    "What is the difference between course description and course outline? A course description is a summary of what the course is about, while a course outline is the detailed plan of what the course entails.",
    "What is the minimum and maximum number of courses an exchange student can enrol in? Students should enrol in a minimum of one and a maximum of four* courses. *Only students who are required by their university to do five courses can be permitted to do so (with written request from their home university, if applicable).",
    "What should I do if I would like to take courses in Modified Term 2 during my SMU exchange? Please inform your SMU Incoming Advisor, if you are choosing courses from the Modified Term. The necessary will have to be done to ensure that your student pass sufficiently covers you till the end of your studies, as the Modified Term ends in June, rather than April. You will also need to be enrolled for Term 2 in order to enrol for Modified Term courses.",
    "How many credits may I clear in summer? You may clear up to 2 SMU CUs in Term 3A, and up to 2 SMU CUs in Term 3B.",
    "When will the term’s final course list be out? The preliminary list will be given to you approximately two months before the term starts and the final list will be given to you before BOSS Bidding starts.",
    "Where can I find a course description? You can browse the Course Catalogue (https://publiceservices.smu.edu.sg/psp/ps/EMPLOYEE/HRMS/c/SIS_CR.SIS_CLASS_SEARCH.GBL) for course descriptions. You will be able to view the course description by clicking on the course name.",
    "Are exchange students allowed to take courses in the Modified Term? Exchange students are permitted to take courses in the Regular Term as well as in the Modified Term, as long as there are NO class & examination timetable clashes.",
    "Can I change courses offline or outside of the BOSS system? No. All changes to courses have to be done on the BOSS system during the BOSS bidding period.",
    "Where can I find more information on courses? You can browse the Course Catalogue (https://publiceservices.smu.edu.sg/psp/ps/EMPLOYEE/HRMS/c/SIS_CR.SIS_CLASS_SEARCH.GBL) for detailed information on the courses offered at SMU.",
    "Where can I obtain the course outlines to submit to my home university for credit transfer? Students can go to SMU Course Catalogue. Look for the course you are keen to enrol in; determine which Term, then click on 'View Class Sections' and then click on the book icon beside the 'Course Outline'. Check carefully the course details and professor selected for the particular class section.",
    "Which courses are open to exchange students? A list of courses open to exchange students will be sent via email 6-8 weeks before the start of the semester.",
    "Will the credits and grades obtained during International Student Exchange Programme (ISEP) summer exchange or Summer Study Programme (SSP) be reflected on my SMU official transcript? Only credits for external courses awarded passing grades will be reflected on the SMU official transcript.The grades will NOT affect your cumulative GPA.",
    "What should I do if the course outline for a course next term is still unavailable? If you require a course outline urgently, you may wish to check the previous year/current term's course list on the Course Catalogue ((https://publiceservices.smu.edu.sg/psp/ps/EMPLOYEE/HRMS/c/SIS_CR.SIS_CLASS_SEARCH.GBL) for that particular course. If found, you may use the course outline as a benchmark.",
    "Can I make changes to my courses which I obtained in BOSS Round 1C? Yes, as Round 1C takes place before term starts, students can make changes in Round 2 and 2A after term starts. Do note that Round 1C is solely for exchange students, so do try to secure most of your courses in this round. However, Round 2 and 2A becomes more competitive as this round is open to all students, which includes full-time and exchange students.",
    "Do I have to fulfil the listed pre-requisites of courses? Exchange students will need to ensure that they meet the necessary pre-requisites of SMU courses they wish to enrol in. Students can refer to the course list or the detailed course outlines via SMU Course Catalogue.While exchange students are not expected to have completed the exact SMU pre-requisites, they need to ensure that they have completed a similar pre-requisite in their home university. A way to determine this is to compare the course outlines of the SMU pre-requisite and the similar completed course in their home university. If in doubt, students should consult the professors of the courses they wish to enrol in. The contact details of the professors are available in the course outlines too.",
    "How do I know which courses are being offered in Modified Term 2? The Accounting courses which are offered in the Modified Term are marked with a (*) in the course list under the School of Accountancy. These courses will NOT be offered in the regular Term 2.",
    "Are there any course pre-requisites? None of the courses require any pre-requisites. If you are unsure if you qualify for any course, please send us an email at smusummer@smu.edu.sg",
    "What happens if I dislike the hostel I've chosen? Should you dislike your hostel and wish to leave before the end of the period of stay, do note that refunds are not possible for some hostels. Therefore, we advise students to read very carefully all fine print when booking their accommodation, especially regarding deposits & refunds.",
    "When will I receive the transcript from SMU? Two copies of your SMU transcript will be mailed to the International Office of your home university approximately two months after the official exam results are released. Please note that examination results will be released online via OASIS (the SMU student portal) two weeks after the last day of the examination period.",
    "May I transfer credits back to my home institution? This will be determined by your home institution. You should consult your home institution on credit transferability before coming to Singapore.",
    "May I choose my own accommodation, or do I have to choose the hostels recommended by SMU? You are permitted to secure your own accommodation in Singapore for the duration of the SMU Global Summer Programme. Note that should you opt to find your own accommodation, IO will not settle any disputes, problems or complications arising from the accommodation provider and yourself.",
    "May I change my course selection after application? Yes, but these will only be entertained on a case-by-case basis. Email us at smusummer@smu.edu.sg.",
    "May I apply for summer programmes in both terms 3A & 3B? Yes you may, provided that there is no clash in dates between both programmes.",
    "May I apply for a summer programme as a final-year student? Final-year students may only apply for non-credit bearing summer programmes.",
    "If I have been on an International Student Exchange Programme (ISEP) summer exchange, can I also apply for ISEP regular term exchange in the future? Yes, you may apply for ISEP in Term 1 or Term 2.However, your ISEP summer exchange will not be taken into account in the selection process for ISEP (regular term exchange).",
    "If I go for the Summer Study Programme (SSP), can I apply for International Student Exchange Programme (ISEP) in the regular term in the future? Yes, you may apply for ISEP in Term 1 or Term 2.However, your time at SSP will not be taken into account in the selection process for ISEP (regular term exchange).",
    "I would like to set up a bank account and the bank told me I should get a letter from SMU. How do I go about doing this? Please approach your IO programme managers for assistance. Do bring your tenancy agreement and passport with you.Students staying at Prinsep or YoHa@Pearl’s Hill, please write to Leasing Business Unit (leasing@smu.edu.sg) requesting a document stating the following details: • Name• Passport No. • Unit No. / Address in Singapore",
    "I lost my student pass that was issued by Immigration & Checkpoints Authority of Singapore (ICA). What should I do? Please make a police report immediately. After that, come to IO to report it. We will issue you a letter and you have to apply for a new student pass with ICA. Take note that ICA charges a fee for a new student pass.",
    "I lost my SMU student card. What should I do? Please go to the Office of Registrar to apply for a new SMU student card. Take note that there are charges for a new SMU student card.",
    "I have problems with my housing in Singapore. What should I do? If you are staying at Prinsep or YoHA@Pearl’s Hill, you may contact the SMU's Leasing Business Unit for help. If not, please approach IO for advice.",
    "I have problems with my courses at SMU. Who can I look for at SMU? Please approach IO for assistance, or you may email us at isep.inbound@smu.edu.sg",
    "I have finished my exchange programme with SMU. When will I receive my results and transcripts? Students will usually be notified by the Office of Registrar on the release of their examination results. If students would like to appeal, please refer to OASIS for more information. Please take note of the deadline. Students will be able to receive their transcripts about two months after the official release of their examination results. Two hardcopies of your official transcripts will be sent to your home university exchange coordinators.",
    "How do I transfer credit for my SMU studies back to my home university? A transcript for your academic record will be sent to your home university at the completion of your exchange. Transfer of exchange credits is entirely at the discretion of your home university. It is strongly recommended that you check with your home university with regards to credit transferability of your courses whilst applying to SMU via the exchange programme. It is recommended that you check with your home university if you are required to transfer your SMU grades to your home programme before you leave your home country.",
    "Do I need to pay any miscellaneous fee? All matriculated students attending SMU will be required to pay administrative fees which covers activities, IT fees, sports facilities, student matriculation card (SMU ID card), medical and health insurance.",
    "Do I have to pay tuition fees for International Student Exchange Programme (ISEP) summer exchange? Yes, you will pay SMU's special term tuition fees for each SMU CU – you need not pay tuition fees to the partner university.However, the partner university may charge administrative or miscellaneous fees.",
    "Can I work part-time or embark on an internship during my summer programme? No, summer students are NOT allowed to work part-time or participate in internships, whether they are remunerated or not. The information reflected on the government website is intended for full-time international students admitted into the undergraduate degree programme at SMU. As such, this does not apply to summer students.",
    "Can I still access my SMU email account after I finish my SMU exchange? You will not be able to access your email account after your exchange. Should you wish to retrieve your emails or any other information from the account, please write to helpdesk@smu.edu.sg",
    "Can I apply for a summer or short-term programme that is not administered by IO? Yes, you may. However, you are to approach your respective schools for approval before applying.You will have to submit your own application.",
    "Are there any exams for the Global Summer Programme? None of the course have any exams held after the Global Summer Programme, although some courses will have in-class final exams/tests that will be held during the final lesson itself",
    "Will I obtain a transcript? Students who have completed the Global Summer Programme will receive an official transcript, as well as a certificate.",
    "What are the minimum eligibility criteria for International Student Exchange Programme (ISEP)You can apply for ISEP if you:- are a full-time undergraduate student at SMU;- have completed 2 regular terms of study at SMU with a minimum GPA of 2.0*- are not in your final term of coursework when the international exchange take place;- are prepared to represent SMU as an ambassador in the host country *Please note:BAcc, BBM, BSc (Econ) and BSocSc students must have completed 2 regular terms of study in SMU and have attained a minimum cumulative GPA of 2.0BSc (IS) students must have completed 4 regular terms of study in SMU and have attained a minimum cumulative GPA of 2.0LLB students must have completed 4 regular terms of study in SMU and have attained a minimum cumulative GPA of 3.0JD students must have completed 2 regular terms of study in SMU and have attained a minimum cumulative GPA of 3.0",
    "What are the cost components if I go on an International Student Exchange Programme (ISEP)? The following are cost considerations whilst on exchange:- Accommodation- Insurance- Study Materials- Airfare and Transport- Living Expenses- Visa application and/ or Residence Permit- Partner University miscellaneous fees You may also refer to the partner universities’ websites and SMU Programme @ a Glance.",
    "Can I apply for International Student Exchange Programme (ISEP) again if I have been on one before? Yes, you may. While we do not restrict students from applying for a second ISEP, priority will be given to applicants who have yet to have any international exchange exposure.For re-applicants, you will have to submit a new application and worksheet.",
    "Is it compulsory to attend the briefing sessions held by IO? While the briefing sessions are not compulsory, they will contain very important information such as the announcement of application deadlines, partner universities that are open for exchange for that particular semester as well as guiding students through the application procedures. If you are unable to attend any of the briefing sessions, please read the briefing materials which will be uploaded on OASIS > Campus Life & Exchange>International Exchange>Useful Materials>For Application>Exchange Programme Briefing Slides",
    "In the absence of a current course catalogue, how do I find information about course availability at a partner university? You may refer to the partner university course catalogue for the corresponding term in the previous year. E.g. if you are going on an exchange in Fall Term 2016 , refer to the course catalogue for Fall Term 2015.Please note that course availability is subject to change without prior notice.",
    "If the academic term of the partner university runs into the next SMU academic term, what are my options? Option 1: Apply for Leave of Absence (LOA) for the respective academic term with the school of your primary degree programme. You may wish to undertake internship/ community service during the respective term since you would not be attending any classes at SMU.Option 2: Seek approval from the professors at the partner university (after course enrollment) to allow you to(i) take examinations earlier so that you can return to Singapore on time, or(ii) return to Singapore earlier to take your examinations at SMU instead.This is subject to approval from partner universities and please contact IO for information on exam invigilation.",
    "If my cumulative GPA is 2.9 but the partner university has a GPA requirement of 3.0, can I still apply? No",
    "How do I research the suitability and availability of courses offered by the partner universities? Students should research the partner university and the courses available through the following ways:1. Partner university's website2. Partner university's course catalogue3. Credit Transfer Handbook - For regular term exchange:OASIS >Campus Life & Exchange>International Exchange>Credit Transfer HandbookFor summer term exchange: OASIS >Campus Life & Exchange>International Exchange>Credit Transfer Handbook4. Previously approved course mappings on OASIS (Note that this is not an exhaustive list)5. Programme @ a Glance (PAG) - For regular term exchange:OASIS >Campus Life & Exchange>International Exchange>Programme at a GlanceFor summer term exchange: OASIS>Campus Life & Exchange>International Exchange> Planning & Choosing the Right Programme>ISEP (Summer Term)",
    "How do I apply for International Student Exchange Programme (ISEP)? Announcements will be made via email to invite students to apply for ISEP on OASIS >Campus Life & Exchange>International Exchange>Apply for ISEP",
    "For International Student Exchange Programme (ISEP) to non-English-speaking countries, will there be a required proficiency in the native language? No, unless required by the partner university.",
    "Can I transfer grades for the courses I read on International Student Exchange Programme (ISEP)? No. Only credits for external courses awarded passing grades may be transferred to SMU.Grades from exchange will NOT affect your cumulative GPA.",
    "Will the credits obtained at the partner university be counted towards the credits required for graduation from SMU? Credits obtained at the partner university can be transferred for SMU credits provided that they are approved by SMU via the online exchange worksheet.For regular term exchange:OASIS > Campus Life & Exchange>International Exchange>Credit Transfer HandbookFor summer term exchange: OASIS > Campus Life & Exchange>International Exchange>Credit Transfer Handbook",
    "Will the courses taken on International Student Exchange Programme (ISEP) be reflected on my SMU official transcript? Grades of external courses will not be shown in both the SMU Official Transcript and SMU Unofficial Transcript as they do not belong to the SMU's Grading System.It will only bear the name of the Partner University and the total SMU CUs transferred. As such, students are encouraged to retain the Official Transcript issued by the Partner University for future academic or employment purposes.",
    "Where can I learn more about the International Student Exchange Programme (ISEP)? For regular term exchange:OASIS>Campus Life & Exchange>International ExchangeFor summer term exchange: TBC",
    "Where can I go on exchange? Please see the list of partner universities which will only only be uploaded (after the briefing sessions are over)For regular term exchange:OASIS>Campus Life & Exchange>International Exchange>Useful Materials>For Application>Partner Universities Overview ListFor summer term exchange: TBC",
    "When will application results be released? All students will be informed of the outcome via email, approximately 1-2 months after the application deadline closes.",
    "When can I apply for International Student Exchange Programme (ISEP)? Applications are conducted twice a year. You need to apply at least 6 months before your intended term for exchange. The schedule is as follows: - Exchange in Term 1 (Fall Term) – Apply in January of the same calendar year - Exchange in Term 2 (Spring Term) – Apply in May of the previous calendar year.",
    "What is required on the online International Student Exchange Programme (ISEP) application? You will have to submit an online exchange application via OASIS. Before choosing your universities, please ensure that you have already researched the partner universities course suitability and availability. No changes are allowed after the submission of an application. Late applications will not be entertained.In the online exchange application, you need to indicate your preference of universities (in ranking order, maximum seven choices) and submit a study plan (e.g. your motivation for participating in an exchange programme, rationale on university choices, etc.).As CCA participation is one of the selection criteria, you are required to update your CCA records on Student Life Mgmt Sys (SLiMS) during the application period. You must get the relevant student leaders of the CCA clubs or events to endorse your CCA records.Every online exchange application will be reviewed and the exchange offers will be released in due course.",
    "What external courses may be taken on International Student Exchange Programme (ISEP)? Please refer to OASIS > Campus Life & Exchange>International Exchange> Credit Transfer Handbook for guidelines on credit transfer. All courses must be approved via the Online Exchange Worksheet before they can be transferred for credit.",
    "What happens if I dislike the hostel or hotel I choose for the Global Summer Programme (GSP)? Do note that refunds are not possible for some hostels and hotels, if you wish to leave before the end of the period of stay. You are advised to read all fine prints very carefully when booking your accommodation, especially regarding deposits & refunds.",
    "What if I would like to find my own accommodation in Singapore for the Global Summer Programme (GSP)? You are permitted to secure your own accommodation in Singapore for the duration of the SMU Global Summer Programme. However, we cannot guarantee your safety should you opt to find your own accommodation, and will not settle any disputes, problems or complications arising from the accommodation provider and yourself.",
    "Are there any course pre-requisites for the Global Summer Programme (GSP)? None of the GSP courses require any pre-requisites. If you are unsure if you qualify for any course, please send us an email at smusummer@smu.edu.sg.",
    "What if I would like to occupy a double-room by myself for the Global Summer Programme (GSP)? You may be permitted to do so, depending on the room availability. Do note that this means that you are purchasing two beds in order to occupy the double-room by yourself, which means the cost of the room is doubled.",
    "What type of rooms are available for the Global Summer Programme (GSP)? We can recommend a few hostels for accomodation, drop us an email at smusummer@smu.edu.sg",
    "Will I receive a transcript upon completion of the Global Summer Programme? Students who have completed the Global Summer Programme will receive an official academic transcript, as well as a certificate.",
    "Are there any exams for courses under the Global Summer Programme (GSP)? Some courses will have in-class final exams/tests that will be held during the final lesson. However, no exams will be held after the Global Summer Programme ends.",
    "Can I change my Global Summer Programme (GSP) courses after registering online? Yes, but these will only be entertained on a case-by-case basis. Email us at smusummer@smu.edu.sg.",
    "Can I choose my roommate(s) for the Global Summer Programme (GSP)? You can indicate your roommate preference on the accommodations application form, and your preference will be considered during room allocation. If there are no preferences, roommates will be allocated on a random basis. Do note that room-mate allocation is done by the hostels themselves, and outside of SMU's control.",
    "Can I take three courses under the Global Summer Programme (GSP)? No. You can take a maximum of two courses.",
    "Can I transfer credits from the Global Summer Programme (GSP) to my home institution? This will be determined by your home institution. You should consult the credit transferability from your home institution before coming to Singapore.",
    "Can I work in Singapore or embark on an internship when participating in the SMU Global Summer Programme? Students who need a student visa to study in Singapore are NOT permitted to partake in any paid or unpaid, part-time or full-time employment or internship during the period of your study.",
    "Do I need to apply for a student visa? Students without a Singaporean Identity Card (IC), MUST obtain a student visa to study in Singapore.",
    "What does the miscellaneous fee include? All matriculated students attending SMU will be required to pay administrative fees which covers student activities, IT fees, sports facilities, SMU Student Card (SMU ID card), medical and health insurance.",
    "How do I get a copy of my transcript? Students should check with their host exchange coordinator if they have any outstanding items (fines/payments), and to ensure that their hardcopy transcripts or softcopy transcripts should be addressed to SMU IO.Students should request the partner university to courier two copies (English translated, if necessary) of the official transcript to IO.Mailing address:SMU International OfficeSingapore Management University81 Victoria StreetAdministration Building (Level 10)Singapore 188065Tel: +65 6828 0400 However, for partner universities that do not issue hard copies, students should request an electronic copy (E-copy) of the official transcript – to be sent to isep.outbound@smu.edu.sg",
    "How do I get a hard copy of the partner university transcript? Some universities only issue soft copies of the transcript.If you wish to have a hard copy of the transcript, contact the partner university coordinators and request a hard copy to be sent to you. A fee might be charged.",
    "How will I know if I passed my courses taken on exchange? Students are responsible for the checking of their grades obtained for the external courses taken at the Partner Universities. In the event that students did not receive a passing grade (i.e., the equivalence of a FAIL grade as per the Grading System at the Partner University) for their external courses for credit transfer, they should review their study plan, and if necessary, they are to enrol more courses in the next immediate academic term during the next bidding window (i.e., BOSS Round 2 or Round 2A) at SMU.",
    "I intend to file for graduation; can I do so if my credits are not transferred yet? Yes, you do not need your exchange transcript and credits transferred before the graduation deadline. You must file for graduation BEFORE the deadline. However your graduation is subject to you passing all courses you wish to transfer.",
    "What should I do if I cannot collect my transcript in person? Complete the Authorization Form and elect a proxy to collect on your behalf. You can download the form via OASIS>Campus Life & Exchange>International Exchange>Useful Materials>For Returning Home",
    "When can I collect my transcripts? You will be able to collect your hardcopy transcripts from IO once credit transfer is completed towards the end of the term. Students must complete the International Student Exchange Programme (ISEP) Outbound Survey when they return in order to pick up their transcripts. An email will be sent, informing students to come down to IO at Administration Building, Level 10 on Thursdays and Fridays only. - 9:30am to 12:00pm - 2:30pm to 5:00pm",
    "When will credit transfer be completed? Credit transfer will be completed towards the end of the subsequent term.",
    "Will my ranking for International Student Exchange Programme (ISEP) be affected if I had gone for a Singapore Universities Student Exchange Programme (SUSEP)? No. For more information on SUSEP, please approach Office of Registrar.",
    "How does the ranking of my preferred university affect the outcome? Students will be ranked based on merits. You will be offered a university based on the ranking of your university selection and availability.You have seven choices but you do not need to use all of them should you have fewer preferred universities.",
    "How many SMU CUs can I clear on International Student Exchange Programme (ISEP)? Students are allowed to transfer up to the equivalence of 5.0 SMU Credits (Course Units – CUs) per international exchange through ISEP in Term 1 or 2.* *Subject to the total course load allowed by Partner University.",
    "Can I appeal to my choice of university? No",
    "Can I change my offer of exchange placement to another university? No. You can decline the offer.",
    "Can I decline my International Student Exchange Programme (ISEP) offer? Yes, but you will be accorded a lower ranking in all subsequent rounds in the current ISEP application as well as all future ISEP applications.",
    "Can International Student Exchange Programme (ISEP) be longer than a term? No.",
    "How should I pay for the application fee? You will be billed directly by the Office of Finance. Do not pay any application fee at the AXS machine.",
    "I accepted my offer but due to personal reasons, I am unable to go on International Student Exchange Programme (ISEP) now. What are the procedures for declining the offer? Please inform OGL and we will change the status of your application to 'Decline'.Do note that you will be accorded a lower ranking in future ISEP applications.",
    "I can't seem to accept my offer of OASIS, what do I do? Follow the instructions in your offer email.",
    "I know of a friend who wants to go to my University and I wish to go my friend's University, can we swop places? No.",
    "What are my chances of being selected for a particular university? This will depend on the pool of applicants for a particular semester; the same selection criteria will be applied.",
    "What are my chances of getting into the same university with my friend? Each application is considered independently based on the selection criteria.",
    "What are the selection criteria? #NAME? ",
    "Am I an Alumnus of Singapore Management University? Yes. This is an important communications link between you and your staff in-charge. The frequency and nature of updates will be decided by the respective offices in-charge as the nature of your overseas engagement differs from office to office.",
    "Are there any special permits / approvals needed if my event involves tentages / setting up of temporary structures? Yes there is. These requirements and approval process is stipulated within the GO PREPARED document. You can download the GO PREPARED document at this link(https://studentlife.smu.edu.sg/student-life/safety-resources).",
    "Are there recommended medical service providers by SMU for our student events? SMU has appointed Ambulance Medical Services (AMS) Pte Ltd as the preferred provider for medical standby coverage during SMU events. Do approach SEP for advice should another provider be shortlisted",
    "Are there any guidelines or a list of Dos & Don’ts for event organisers? As events requirements vary, please approach any of our staff at the Safety Centre for a consultation.",
    "Can I engage you to train my club members? Yes, you can. Prior to the training, a consultation session will be conducted to first have a clear understanding of the Club's training needs.",
    "Where can find Automated External Defibrillators (AED) on campus?  Where can find Automated External Defibrillators (AED) on campus? We currently have 36 units of the AEDs located all over SMU Campus. Please refer to the following url for a better understanding of their locations :https://studentlife.smu.edu.sg/sites/studentlife.smu.edu.sg/files/SMU%20AED%20Locations%20%28updated%20Sep%202016%29_0.pdf",
    "Where can I direct my safety related feedback / enquiries? You may get in touch with the Safety & Emergency Preparedness team via safetycentre@smu.edu.sg or drop by our office located at SMU Basement Concourse, #B1-64 (next to the Centre for Social Responsibility).",
    "Would I get any certifications from attending the various safety & emergency preparedness-related workshops & courses? Participants are awarded certifications for bizSAFE Level 2, CPR+AED, BCLS & after meeting the necessary requirements stipulated.",
    "When and how do I report about injury / incident on campus / whilst engaging in an activity / event? It is essential to report all incidents, injuries and near miss incidents to SEP. If it happens during an event, inform the event organizer/ trainer/ Student leaders. For non-events, do report these incidents requiring emergency assistance by calling campus security at 68280343. Submit an incident notification through SMU online incident reporting.",
    "What happens after an incident is reported? SEP will review the quality of information reported, applying consistent incident classification criteria and follow up according to the investigation process. In the event that there is an investigation, you are to assist in investigation if required.",
    "What are the various safety & emergency preparedness-related workshops & courses that are available for me as a student? There are two broad categories of Safety & Emergency Preparedness-related workshops, namely, Risk Management & Life-Saving. Risk Management includes the Risk Assessment & Management Systems (RAMS), bizSAFE Level 2 & the Basic Emergency Workshops. Life-Saving includes the Cardio Pulmonary Resuscitation + Automated External Defibrillator (CPR+AED), Basic Cardiac Life Support (BCLS) certification / re-certification courses. We do co-ordinate Standard First Aid (SFA) certification courses which is conducted by our appointed training provider, Health Management International Institute of Health Sciences (HMI-HIS).",
    "I understand that SMU requires all students embarking on official overseas travel to utilise the Global Assistance Programme by International SOS. How do I go about registering myself on this service? You can find all necessary information on this ISOS’s Global Assistance Programme via the urlhttps://smu.sharepoint.com/sites/admin/SEP/global-assistance-programme.To assist you in this onboarding process, please read through the content as well as the materials provided.",
    "I have heard about the GO PREPARED document, is it a requirement for all events? The Go PREPARED document is not required for all events. However, being prepared is essential to ensuring safety in all your activities. The SEP Team has developed the GO PREPARED model for which organisers can refer to during the planning and preparation stages of events. The document compiles the key safety templates into one document to facilitate the submission of these information to the SEP Team.",
    "I am planning to embark on an overseas trip soon. Are there any safety-related protocols / resources that I can refer to? Yes, there are safety processes in place to better prepare you for your overseas engagement. You can gain access to these safety resources via.",
    "How do I know when a particular workshop / course will be organised? An Electronic Direct Mail (EDM) is sent to the SMU community regularly so do keep a lookout for these workshops / courses regularly.",
    "How do I go about organising an event / student activities for my club / student body? For safety and risk and assessments concerns in planning your event, you can download the GO PREPARED document here(https://smu.sharepoint.com/sites/admin/SEP/Documents/Safety%20Resources/SEP%20GO%20PREPARED%20Document%20%28Updated%20March%202016%29.xlsx)for you use. Should you require further assistance or need guidance in planning an event in its entirety, you can approach any of the staff from the Safety Centre for a personal consultation. More information can be found at:https://studentlife.smu.edu.sg/student-life/safety-resources",
    "How do I get assistance for any emergencies whilst I am on campus? Do contact our Campus Security hotline at 68280343 (24-hour) immediately should you require immediate assistance.",
    "How do I go about conducting a Risk Assessment? You can use the Risk Assessment template found in the GO PREPARED document. At the same time, the Safety Centre also organizes ‘bizSAFE Level 2’ courses regularly to educate both staff and students in the areas of Risk Assessment. The course comes with a certification that is recognised by the Workplace Safety and Health Council (WSHC). Do look out for our periodic EDMs sent to your school email.",
    "How do I get access to an Incident Report Form & what is the timeline for its submission (Local & Overseas event)? You can submit the incident report throughhttps://tinyurl.com/smuincidentreportingThe submission timeline for: Local Incidents – 12pm the next working day Overseas Incidents – 1 working day upon arrival back into Singapore",
    "How can I get access to first aid kit on campus? First aid kits are available in the guard rooms located on the street level of each school building.",
    "How can I contribute to SMU with the newly acquired skills & competencies from the various safety & emergency preparedness-related workshops & courses? The skills & competencies acquired provide opportunities for students to serve either as a Safety in-charge, First Aider or a SMU First Responder.",
    "Do I require medical support (E.g. Ambulance service provider, First Aiders) to support my event and activities? You may refer to the SOP on Medical Support for the requirements of any form of medical standby coverage for your event.",
    "What should I do if I am wrongly accused? Every complaint made against a respondent will be handled seriously and a full investigation will be carried out before charges are made.",
    "What should I do if I am not satisfied with the outcome of a Student Conduct or Academic Integrity complaint? For minor violation, you may appeal to the Dean of the school. For major violation, you may appeal to the Provost. An Appeals Officer will be appointed to review the case. The decision of the Appeals Officer shall be final and binding and there shall be no further right of appeal.",
    "What are the kinds of disciplinary sanctions in SMU? Students found in violation of the Code of Student Conduct or Code of Academic Conduct shall face disciplinary proceedings by the University and the following possible sanctions; Letter of Warning, Letter of Reprimand, Fine, Resitution, Corrective Work Programme, Disciplinary Probation, Term Suspension, Indefinite Suspension, Expulsion.",
    "Is there a permanent record if I am sanctioned by UCSC? Depending on the outcome of the case, the sanction may be reflected into the Student's internal University record.",
    "Is it possible to make an anonymous complaint to the University Council of Student Conduct (UCSC) about a student conduct or Academic Integrity violation? Depending on the circumstances, we might require the identity of the complainant in order to investigate the matter. However, the complainants' identity will be kept strictly confidential within UCSC. In the event of complaints made by a totally anonymous party, UCSC may reserve the right to close the complaint if investigations cannot proceed without identification.",
    "I might have committed a violation of SMU rules or the Code of Conduct, what is going to happen? If a complaint had been lodged against you for an alleged violation, you will be asked to meet with an authorised staff to discuss the incident. In the event that investigations have found you responsible for the violation, you may be subject to disciplinary proceedings, which may result in sanctions imposed upon you.",
    "How is UCSC connected to SCD? UCSC and SCD are independent bodies. The former is a University body that oversees the management and enforcement of student conduct and academic integrity. SCD is a representative student body that engages with the student population to promote CIRCLE Values, good moral values and academic honesty.",
    "Will sanctions affect my Scholarship, Exchange or Internship programmes? It might affect your application for Awards or Scholarship and you are required to declare if you had been the subject of disciplinary action.",
    "Will my parents be informed if I am subjected to disciplinary action? Each and every SMU student is a responsible adult and should be held fully responsible for his/her actions. Following Singapore's law, the school will not inform the parents unless he/she is a minor (under 21 years old) or assessed to be at risk of self-harm.",
    "Will my disciplinary record be displayed on my academic transcript? Disciplinary records are kept private and confidential by the University. The information will not be divulged, except to authorized individuals or when compelled by law to do so. For cases of sexual misconduct, the University can impose a range of disciplinary sanctions which may include a record of offence on the Student's unofficial transcript, academic summary and academic transcript for a maximum period of three years following graduation or after leaving the University.",
    "What should I do if I witnessed a violation by a fellow student? It is in the interest of the offender, and the general student population, that you report this matter to the UCSC. The matter will then be investigated. Please note that UCSC reserves the right to uphold the confidentiality of the final outcome.",
    "What should I do if I wish to make a complaint about a Student Conduct or Academic Integrity violation? You may make a formal complaint to the University Council of Student Conduct by emailing to studentconduct@smu.edu.sg. For harassment or violence cases, you may write to voices@smu.edu.sg. Voices@SMU, a unit that resides within Student Services Hub (SSH), assists and supports students (regardless of gender) affected by harassment, bullying or discrimination- including cases of sexual harassment or sexual assault.",
    "Can I bring in external non-SMU personnel into the SMU Gym? No, you may not.",
    "How much does it cost to print at the Library? Printing Charges are as follows: • A4 black & white printing - 3 cents per page • A3 black & white printing - 6 cents per page • A4 color printing, it costs 30 cents per page • A3 color printing, it costs 60 cents per page",
    "Is binding service available at the Library? Binding service is not available at the Library. The service is available at the stationery shop, Unimax located at the Concourse.",
    "Can I bring in external non-SMU personnel into the Swimming Pool? No, but arrangements can be made for OSL endorsed events.",
    "Can I still use the Library resources after I have graduated or left SMU? SMU alumni with SMUAA Membership have walk-in access to the Library, where they can browse/read library books and utilize the library spaces that are not restricted. Only members under SMUAA Membership with the Library Add-on, have borrowing privileges, and access to selected databases by using the Library PCs (except Investment Studio PCs).",
    "What are the library opening hours? The library opening hours differ term to term. For more details, check out this link to the library opening hours(https://library.smu.edu.sg/opening-hours).",
    "What are the photocopying and printing charges and how do I pay? Photocopying Charges • A4 photocopying costs 2.5 cents per page. You could pay by EZlink Card or Nets CashCard. Printing Charges • A4 black & white printing - 3 cents per page • A3 black & white printing - 6 cents per page • A4 color printing, it costs 30 cents per page • A3 color printing, it costs 60 cents per page You could pay by EZlink Card or Nets Flashpay.",
    "What do I do if I have lost valuables in library premises? You should first check if your item was found with the Security personnel at the Library entrance, or approach the Security Command Centre at Level 1 of the Library building. If you suspect that it is due to theft, a police report has to be made at any police station (or online under E-Services atwww.spf.gov.sg)ss.The CCTV footage will then be released to the Investigating Officer (IO) who will handle the case.",
    "What is lyf@SMU about? lyf (which means ‘live your freedom’) is a new brand, launched by the Ascott Limited, targeting millennials. lyf@SMU is a testbed to try out various co-living concepts and community building activities.",
    "What is SMU Labs? SMU-X, as a space, supports the SMU-X mind-set and curriculum by facilitating the coming together of individuals and groups around an identified project and issue, and acts as a test bed for ideas. SMU Labs, the first SMU-X facility, is a co-working learning hub that is opened 24/7 to allow ‘after-work hours’ meetings, bonding and hanging out. It is open strictly to SMU students only. The environment aims to foster collaboration and active learning through: - Co-working, co-living, community, togetherness - Curiosity - Flexbility to create, freedom - Mobility - Social spaces - Feedback, research, prototyping",
    "What is the Multi-Purpose Sports Hall (MPSH) operating hours? Daily 8am to 10pm Closed on Public Holidays and as and when notified via email",
    "What is the SMU Gym operating hours? Weekdays 7am to 10pm (last entry 9pm) Saturday 7am to 6pm (last entry 5pm) Closed on Sundays, Public Holidays and as and when notified via email",
    "What is the Swimming Pool operating hours? Weekdays 7am to 6pm Closed on Weekends, Public Holidays and as and when notified via email",
    "Where are the printers and photocopiers located in the library? Li Ka Shing Library: Printing rooms are available on Level 2, 3, and 4 of the library. Scanner is only available at Level 3 of the printing room. Kwa Geok Choo Law Library: Printer and Photocopiers (black and white), are available at Level 4 of the library.",
    "Where can I scan my document in the library? Scanning is free in the Library. There is a colour flat-bed scanner available at the Printing Room on Level 3 of the Li Ka Shing Library. Please bring a thumb drive to save your scanned document.",
    "Does the library provide fax service? The library does not provide fax service. However, you can go to Home & Office (UNIMAX) located at #B1-22/23, Li Ka Shing Library, for local fax service.",
    "Where can I top-up my EZLink card and pay for my print outs? Your EZLink card can be topped up at any MRT station. The nearest MRT station is the Bras Basah MRT station and is accessible via the Concourse / Basement 1 of SMU.",
    "Where do I go if I need help on getting reports, articles, and newspapers for my assignment? Contact the friendly librarians at library@smu.edu.sg",
    "How can I donate books to the library? Please drop books for donation at the Library Desk or you can place them directly on the 'Take One Leave One (TOLO) shelves', located in the Learning Commons. You may also write to library@smu.edu.sg if you have queries or special requirements (such as a dedication/acknowledgement, or if you would like the books returned to you if they are not included into the library's collections).",
    "How can I pay for photocopying charges? You can pay by EZlink Card or Nets CashCard",
    "Can I book any of the Arts Venue Spaces [Arts & Culture Centre, Gym Studio, Level 7 Studios, Basement Studio? Only arts clubs under ACF and OSL are allowed to book the Arts & Culture Centre, Gym Studio, Level 7 Studios and Basement Studio.",
    "How can I pay for printing charges? You can pay by EZlink Card or Nets Flashpay",
    "Can I book the Multi-Purpose Sports Hall (MPSH) for exclusive use? Most of its operating hours have already been booked by our existing sports clubs. SMU staff, faculty and students can use the hall freely when it’s not in use, but SMU sports clubs’ training will take priority. The MPSH may also be closed for exams, events as and when notified via email.",
    "How do I book campus / library facilities? Campus/ Library facilities can be booked using the Resource Booking System The Resource Booking System allows you to search for available facilities by building and facility name. The system has a ‘Multiple Facilities with One Booking’ feature that allows you to book more than one facility for a given time slot using just one booking form. The “Recurrent Booking” feature within the system allows you to Block-book the facilities you want. You can also save the recurrence patterns like start times, end times, recurrence frequencies etc, and use them as templates for future bookings. Click here (https://fbs.intranet.smu.edu.sg/FacilitiesBookingHelp.htm) to view help. Click here (https://fbs.intranet.smu.edu.sg/mainmenu.aspx) to use Resource Booking System.",
    "Can I book the SMU Gym for exclusive use? No, the gym is a common space shared by all.",
    "How is Ascott involved in SMU Labs? Ascott is collaborating with SMU Labs to create co-working space and programmes such as industry talks and networking events, internships and applied research. If you would like to get involved as well email us at smux@smu.edu.sg.",
    "Can I book the Swimming Pool for exclusive use? Can only be booked for Aquathlon and Aquatic Sharks evening training only. Student Constituency Bodies (CBD – SMUSA, SSU, SMUX, SICS, ACF) are also allowed to book the swimming pool for events and camps.",
    "How much does Home & Office (UNIMAX) charge for fax service? Local fax is charged at $2.00 for the 1st A4 page • $1.00 per sheet subsequently ** Please refer to the provider for the latest charges.",
    "Can I bring in external non-SMU personnel into the Multi-Purpose Sports Hall (MPSH)? No, but arrangements can be made for OSL endorsed events.",
    "How much does it cost to photocopy at the Library? A4 photocopying costs 2.5 cents per page",
    "What is Vivace? SMU Vivace is the university's largest CCA fair as more than 100 student clubs gather to showcase the best of Student Life at SMU.",
    "What is the difference between Freshmen Experience (FE) Day and Vivace? FE Day features the Schools and CCA Constituency Bodies (CBds) like ACF, SICS, SMUX, SSU whereas Vivace features the clubs within SMU.",
    "What kind of ‘External Activity’ (events) is allowed to be keyed in SLiMS? If your participation in any 'External Activity' is in representation of SMU, you may then request to have your participation to be recorded here. All requests are subjected to staff approval.Example1: You as an individual or your club represented SMU at the National Cheerleading Championship organized by SSC or 22nd Singapore Ballroom Dancing Championship. Example 2: Your club co-organized an event with another external organizer at the inter-tertiary, national, regional or international level such as the HPAIR 2010 Asia Conference.",
    "What is SLiMS? SLiMS is the acronym for Student Life Management System. It is a portal, which replaced the old CCA Records system in OASIS since 2011. SLiMS will be a record of all your co-curriculum activities throughout your undergraduate studies at SMU.",
    "What if I need immediate endorsement? Kindly email the student exco and the staff advisor to get an immediate endorsement.",
    "What happens to those records which are still pending endorsements? All entries that are verified in SLiMS by your club's student leaders, but yet to be endorsed by staff-in-charge will be captured in the 'Interim CCA Record'.",
    "What happens if I missed the endorsement period? A two-month window period is given for CCA records endorsement. Any records that are not endorsed by 31 December of each year will not be entertained.",
    "What can I do in SLiMS? You may log into SLiMS to do the following (For students only) (i) Sign up as a member of a club/interest (ii) Download a copy of your Interim CCA record (For student administrators only) (i) Create/ maintain activities for club/ interest group events (ii) Update information in pre-existing club account (iii)Generate Interim CCA records.",
    "Is joining a CCA compulsory? No, it is not compulsory.",
    "How will my contributions as an organiser or participant in a University-wide event be recognized in my CCA record? The staff advisor will created the activity and subsequently chairperson/secretariat of the Organizing Committee will have to update and verify the list of all their Exco members and participants in SLiMS.",
    "How do I start a new CCA club? Refer to SMUSA Website (https://www.home.smusa.sg/faq) for details. Each Student Constituency Bodies (CBD) has its unique set of criteria for accepting new clubs. Depending on the nature of the activity of this proposed new club, you may write to the following to seek information and approval: 1. Arts and Cultural Fraternity (ACF) - artsandcultural@sa.smu.edu.sg 2. SMU Xtremists (SMUX) - xtremists@sa.smu.edu.sg 3. SMU Sports Union (SSU) - ssu@sac.smu.edu.sg 4. Special Interest and Community Service Sodality (SICS) - sics@sac.smu.edu.sg",
    "How do I key in my CCA club records? The records should be keyed by committee members that were given access rights to manage the club's account. In the event if it is not updated, you will need to email the secretariat of the club.",
    "How do I join a CCA club? There are 2 ways in which this can be done: (i) You may click the 'Join' button of a particular club/group that interests you and follow up with an email to the club.(ii) Alternatively, you could sign up as a member via other channel [eg. during VIVACE – CCA recruitment day or through direct contact with the club's executive committee (Exco) etc.",
    "How can I sign up to be an organizing committee and/or facilitators? You can look out for EDMs via your school email account.",
    "How can I sign up for camps? You can sign up during FE Day and look out for EDMs via your school email account.",
    "How can I run for SMUSA? You can look out for EDMs via your school email account or check out https://www.home.smusa.sg/",
    "Can postgraduates apply for the University Student Life Awards (USLA)?  (Seasonal Dec - Mar)No, USLA is open only to undergraduates.",
    "Can post-graduate students join club activities? Yes, but they do not enjoy subsidies on fees.",
    "Can members of the public take part in events or use the facilities? No, although special arrangements can be made for OSL-endorsed events.",
    "Can I print out my current CCA records for my scholarship application? Yes, you can print out a PDF copy of your 'Interim CCA Record'.",
    "Can I print out my current CCA records for my internship application? Yes, you can print out a PDF copy of your 'Interim CCA Record'.",
    "Why is there a disclaimer stated on the ‘Interim CCA Record'? This is because once a student clicks to ‘Join’ a club, with the club’s student leader’s verification, his/her membership will already be captured in the ‘Interim CCA Record. Without a staff’s endorsement, records on this Interim CCA Record is not deemed as finalized, hence a disclaimer helps to inform the reader of the Interim CCA Record of this difference.",
    "Can I print out my current CCA records for my exchange application? Yes, you can print out a PDF copy of your 'Interim CCA Record'.",
    "Can I include my participation for an external club in the CCA Records? No. The CCA Records is only for activities relating to SMU student life. This includes school CCAs, school events and participation/representation of the school at the inter-tertiary, national, regional or international level in seminars/conferences/competitions etc.",
    "Can Alumni take part in events or use the facilities? Refer to https://www.smuaa.org.sg/membership-benefits/ for use of facilities. For events, Alumni members will enjoy insurance coverage from SMUAA. Non-members will be required to purchase personal accident coverage each time they take part in SMU events.",
    "How do I key in my participation in ‘External Activity’? Upon approval by the staff, the staff will have to create the activity with the student. All 'External Activity' creation will be done by SMU staff only. For Academic-related 'External Activity', please consult your School Administrators for approvals. For CCA-related 'External Activity', please consult your CCA Manager-in-charge/Staff Advisor for approvals.",
    "Who is the staff in-charge of endorsing CCAs? Different clubs/interest groups/events are overseen or taken care of by different SMU staff. You can find the name of the staff-in-charge under the ‘Staff Advisor’ field in each club’s information.",
    "How many hours of community service do i have to fulfil? All SMU students give back through at least 80 hours of community service before graduation.",
    "Who can I contact if I am having problems with my CCA records? You can go through the FAQ on SLiMS. Alternatively, you may drop us an email at slimsadministrator@smu.edu.sg.",
    "Can i go overseas? Yes, all SMU students will acquire global exposure before graduation. Please click here for more information on global exposure related questions.",
    "Where can I get an ‘Official CCA Record'? Currently, SLiMS does not provide an official CCA record. Should you require a copy of your CCA record, kindly retrieve a copy of your ‘Interim CCA Record’.",
    "When is the CCA endorsement period? The CCA endorsement period will be kept to the final 2 months of the year, from 1 November to 31 December of each calendar year.",
    "When can I sign up for Freshmen Orientation?  (Seasonal May - Jul)Upon matriculation the Freshmen Orientation Organising Committee will contact you via your school email account to register for the orientation.",
    "What is ‘External Activity’? External activity refers to non-SMU related events, mainly by other external organizers. Eg. Youth Olympics Games (YOG), Singapore Arts Festival by National Arts Council, etc.",
    "Where is Student Wellness Centre? Mrs Wong Kwok Leong Student Wellness Centre, Li Ka Shing Library Concourse, #B1-44 (next to OCBC FRANK), 70 Stamford Road, Singapore 178901",
    "Is my counselling session confidential? Yes! Confidentiality of information is very important to us at Mrs Wong Kwok Leong Student Wellness Centre. All information is kept strictly confidential. We will not disclose information to your parents, professors, administrative staff or any other outside parties unless you have given us written permission to release and communicate that information as requested. Counselling information or contacts from students seeking counselling will also not appear on their student academic record. However, there are some exceptions when the information involves legal matters or poses serious safety risks to the student/others. If you would like to learn more about these, please contact the Centre for more information.",
    "What to expect in a counselling session? Our counsellors will listen without judgement and strive to help you by: • Finding the cause of the problem • Exploring solutions and methods of coping • Referring resource and additional services (if required)",
    "What are issues that I can get counselled on? • Expectations on school results • Adapting and coping university life • Loneliness, anxiety, stress and depression • Socialisation, relationship or family issues • Feelings of negativity and suicidal tendencies • Substance addiction or abuse • Support in helping others/friend No issue is considered too minor or excessive for the counsellors.",
    "Can I include my participation for an external club in the CCA Records? No. The CCA Records is only for activities relating to SMU student life. This includes school CCAs, school events and participation/representation of the school at the inter-tertiary, national, regional or international level in seminars/conferences/competitions etc.",
    "How do I join a SLiMS club? There are three ways in which this can be done: (i) You may click the ‘Join’ button on SLiMS of a particular club/group that interests you, and follow up with an email to the club. (ii) During VIVACE – CCA recruitment day or through direct contact with the club’s Executive Committee (iii) You can write to the specific club to find out more information. Each club’s email address can be found athttps://studentlife.smu.edu.sg/student-life/smu-student-clubs",
    "Why is there a disclaimer stated on the ‘Interim CCA Record? When a student clicks to ‘Join’ a club, his/her membership would be captured in the Interim CCA Record, after verification by the club’s student leader’s. However, without a staff’s endorsement, records on the Interim CCA Record is not deemed as final, and a disclaimer is used to inform the reader of this.",
    "Who is the staff in-charge of endorsing CCA? Different clubs/interest groups/events are overseen or taken care of by different SMU staff. You can find the name of the staff-in-charge under the ‘Staff Advisor’ field in each club’s information.",
    "Where can I get an Official CCA Record? Currently, SLiMS does not provide an official CCA record. Should you require a copy of your CCA record, kindly retrieve a copy of your ‘Interim CCA Record’.",
    "When is the CCA endorsement period? The CCA endorsement period will be kept to the final 2 months of the year, from 1 November to 31 December of each calendar year. However, Staff can also choose to process their endorsements earlier than the stated period if the records are ready.",
    "What kind of ‘External Activity’ (events) is allowed to be keyed in SLiMS? If your participation in any ‘External Activity’ is in representation of SMU, you may then request to have your participation to be recorded here. All requests are subjected to staff approval. Example1: You as an individual or your club represented SMU at the 22nd Singapore Ballroom Dancing Championship. Example 2: Your club co-organized an event with another external organizer at the inter-tertiary, national, regional or international level such as the HPAIR 2010 Asia Conference.",
    "What is ‘External Activity’? External activity refers to non-SMU related events, mainly by other external organizers. Eg. Youth Olympics Games (YOG), Singapore Arts Festival by National Arts Council, etc.",
    "What is SLiMS? SLiMS is the acronym for Student Life Management System. It is a portal, which replaced the old CCA Records system in OASIS since 2011. SLiMS will be a record of all your co-curriculum activities throughout your undergraduate studies at SMU.",
    "What if I need immediate endorsement? Kindly email the student exco and the staff advisor to get an immediate endorsement.",
    "What happens to those records which are still pending endorsements? All entries that are verified in SLiMS by your club’s student leaders, but yet to be endorsed by staff-in-charge will be captured in the ‘Interim CCA Record’.",
    "What happens if I missed the endorsement period? A two-month window period (Nov-Dec) is given for CCA records endorsement. Any records that are not endorsed by 31 December of each year will not be entertained.",
    "What can we do in SLiMS? You may log into SLiMS to do the following: For students only (i) Sign up as a member of a club/interest (ii) Download a copy of your Interim CCA record For student administrators only (i) Create/ maintain activities for club/ interest group events (ii) Update information in pre-existing club account (iii) Generate Interim CCA records",
    "How will my contributions as an organiser or participant in a University-wide event be recognized in my CCA record? The staff advisor will create the activity, and the chairperson/secretariat of the Organizing Committee will then have to update and verify the list of all committee members and participants in SLiMS.",
    "How do I key in my participation in ‘External Activity’? Upon approval by the staff, the staff will have to create the activity with the student. All ‘External Activity’ creation will be done by SMU staff only. § For Academic-related ‘External Activity’, please consult your School Administrators for approvals. § For CCA-related ‘External Activity’, please consult your CCA Manager-in-charge/Staff Advisor for approvals.",
    "How do I key in my CCA club records? The records should be keyed in by committee members that were given access rights to manage the club’s account. You will need to email the club, in the event that your record is not updated.",
    null
  ],
  "sources": [
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx",
    "https://oasis.smu.edu.sg/Pages/faq.aspx"
  ]
}
