{
  "documents": [
    "How many intakes are there per year? There is only 1 intake per year, starting in August.",
    "I have completed my GCE O-levels. Does SMU offer foundation programmes? SMU does not offer foundation programmes.",
    "Does SMU offer any diploma programmes at undergraduate level? SMU does not offer any diploma programmes at undergraduate level.",
    "Does SMU offer any part-time programmes? Our undergraduate programmes are conducted on a full-time basis. We do not offer any part-time programmes.",
    "Does SMU offer degree programmes via distance learning or online learning mode? Our undergraduate programmes are conducted on campus at SMU. We do not offer programmes on a distance-learning or online learning mode.",
    "What is SMU's undergraduate degree award system? CUM LAUDE & MERIT AWARDSSMU uses the cumulative GPA (Grade Point Average) criteria to recognise students with academic excellence and it is based on a 4.0 system.Cumulative Grade Point Average (GPA)3.8+ / 4.0              -  Summa Cum Laude (Highest Distinction)3.60 to 3.79 / 4.0  -  Magna Cum Laude (Higher Distinction)3.40 to 3.59 / 4.0  -  Cum Laude (Distinction)3.20 to 3.39 / 4.0  -  High Merit3.00 to 3.19 / 4.0  -  MeritSumma Cum Laude, Magna Cum Laude and Cum Laude are latin awards adopted from the US system, and can be translated as with Highest Distinction, with High Distinction, and with Distinction respectively.All cum laude awards are highly selective. They do not equate to the various classes of degree honours conferred by universities that follow the British system of academic honours. For more information on the SMU degree certificate, please clickhere.",
    "Are all SMU degrees four years in duration or less? Can I complete the programme in less than 4 years? Non-Law single degree students may be able to complete the programme in 3 years or 3.5 years or 4 years, through the granting of credits or course exemptions (up to 6 credits/course exemptions may be given) or fast-tracking by taking more courses during the regular terms or summer terms (subject to approval from the Deans).Students who intend to fast-track are advised to plan their course time-table wisely in order to maximise learning opportunities. Most SMU students see the value of spending 4 years at SMU to broaden their knowledge base and real-life skills through internships and global exposure opportunities.The duration of the law programme for single degree students is 4 years while those enrolled in the double degree programme (DDP) with the School of Law complete the DDP in 5 years.",
    "What is the medium of instruction for SMU courses? The medium of instruction is English.",
    "What are the undergraduate degrees offered in SMU? SMU currently offers the following undergraduate degree programmes:Bachelor of AccountancyBachelor of Business ManagementBachelor of LawsBachelor of Science (Economics)Bachelor of Science (Information Systems)Bachelor of Science (Computer Science)Bachelor of Science (Computing & Law)Bachelor of Science (Software Engineering) SkillsFuture Work-Study DegreeBachelor of Social Science",
    "What is the academic calendar like? The academic calendar is a listing of the start and end dates for Term 1, Term 2, Term 3 (Special Term), end-of-term examinations and vacation periods.Clickherefor more information.",
    "What is the number of course places in SMU in each year? Entry into SMU's undergraduate programmes is highly competitive and places are limited. You may refer to theIndicative Grade Profileas a guideline on the number of places taken up in the previous year.",
    "Is there an early intake for returning NSmen? Yes, there is an early intake for NSmen that is held during the Special Term that commences in April. NSmen who have reserved their places in SMU are eligible to enroll in this Special Term provided that they have matriculated prior to the start of the Special Term.",
    "I am currently serving my National Service (NS). May I still apply? Yes, you should apply for admission. If your application is successful and you intend to accept SMU offer, a place will be reserved for you until you have completed your National Service.",
    "I wish to disrupt my NS and join the school term in August. What should I do? Please provide the documentary evidence from your unit that you are able to disrupt your NS. You may submit your supporting documents via email toadmissions@smu.edu.sg.",
    "Can I change programme during my NS? Please kindly email toadmissions@smu.edu.sgwith the following details :(i)                 Your full name(ii)                Application No.(iii)               Programme you intend to change to(iv)               Reasons for change of programme (a write-up is preferred ; 1000-word limit)We will inform you on the outcome of your appeal. Please check the status of your appeal online via Applicant’s Self Service. If your appeal for course change is not successful, you will still keep your place in the degree programme that you have previously accepted.",
    "I have accepted an offer from SMU. As I will be serving my NS, what should I do next? No further action is required from you until the completion of your NS. SMU will contact you (via email/letter) in your year of admission on matriculation/enrolment procedures.",
    "I will soon be enlisted into NS. How do I check if I have accepted the offer and a place in SMU has been reserved for me? You may check if you have accepted the SMU offer via theApplicant's Self Serviceplatform. We will not send any confirmation letter or email.",
    "How many years can NSmen be reserved a place at SMU? NSmen are reserved a place for the period of their national service stint. Offers that are not accepted upon completion of national service will be deemed to have lapsed.",
    "Will returning NSmen attending the Special Term classes be able to graduate one semester earlier? This depends on the number of modules taken per semester. There is no guarantee that you can graduate early.",
    "Where can I view a sample of the online application form? Please clickherefor a sample of the online application form.",
    "Can students from the A-Level Science / Arts stream and non-business Polytechnic diplomas apply for admission? Yes, you are welcome to apply for admission.",
    "What happens if my interview at SMU clashes with another commitment? Interviews play an important role in the admissions process and as such, it is in your interest to attend the interview as scheduled. There is a very tight schedule for these interviews. Law interviews for shortlisted candidates are conducted in end Mar/April. Clickherefor more information on law interviews and writing tests.",
    "What are the important dates that I should take note of? Please clickherefor information on the important dates that you should take note of.",
    "When will applicants be notified for interviews? When will applicants be informed of their application outcome? Only shortlisted applicants will be called up for interviews.Please clickherefor more information on the important dates relating to admissions.",
    "Will my chances of gaining admission into my second, third, fourth and fifth choice be lower if I am not selected for my first choice? We will consider an applicant's choices in the order of his/her preference. If you are not successful in your first choice, you will still be considered for your other choices in competition with other eligible applicants and subject to the number of places available. For those interested in law, you must indicate law as your first choice in your application.",
    "What are the admissions requirements? Please clickherefor more information on admissions requirements.",
    "Can I make amendment to my application form after submission online? You can update your personal particulars (mailing address, telephone contact, mobile contact and email address) by logon toApplicant's Self Service. For other matters, please email toadmissions@smu.edu.sgfor assistance.",
    "How many degree programmes can I select in the online application? You may select up to 5 degree programmes, in order of preference.",
    "When can I apply for admission? When do applications close? How do I apply for admission? For the Academic Year 2023-24, applications opened on 17 October 2022 and will close on 19 March 2023*, 11.59pm Singapore Time.Please clickherefor more information.*Now extended to 22 March 2023, 11.59pm, Singapore Standard Time.",
    "How much is the application fees and what are the payment modes? Our application fee is only SGD $15.00 (inclusive of GST). The following payment modes are available:Credit / Debit Card payment via theApplicant’s Self Service. (Preferred mode).NETS at theStudent Services Hub, located at SMU Campus Basement Concourse.PayNow at theStudent Services HubCheques/Cashier order issued by banks in Singapore in Singapore currency. Applicants must address the cheque/cashier order toSingapore Management Universityand provide their name and application number at the back of the cheque.",
    "How do I know if my application fee payment and supporting documents have been received? You can check if your application fee payment and supporting documents have been received by logon atApplicant's Self Service.",
    "My qualification does not fall within the recognised international high school qualifications. Can I still apply? Yes, you may still apply under the 'International/Other qualifications' category.",
    "I have forgotten my User ID and Password. Where can I retrieve the information? You may retrieve your User ID and Password by logging onApplicant's Self Serviceand double-click Forgot User ID and Password on the left hand column.",
    "Can I apply with diploma qualifications awarded by a foreign or private institution? For the purpose of admission to SMU's undergraduate degree programmes, diplomas awarded by foreign or private institutions will be considered on a case-by-case basis.",
    "How do I check the status of my application? You can check the status of your application online atApplicant's Self Service. You must have a User ID and Password that are both available at the time of making an online application for admission.",
    "How do I submit the supporting documents? After applying online, please upload the relevant supporting documents (for example, NRIC/Passport details, academic results, school testimonials, CCA records, etc) using the online upload function at Applicant's Self Service. If you wish to submit other documents on top of the online submission, you may send the hardcopy documents to SMU either by mail or by hand via the Drop box:By Mail:Office of Undergraduate Admissions & Financial AssistanceSingapore Management UniversityLevel 3, Administration Building81 Victoria StreetSingapore 188065By Hand:The Drop box (8am-9pm daily) is located outside Office of Undergraduate Admissions & Financial AssistanceNote:Pleasedo not submitoriginal transcripts/ certificates.",
    "Is there a separate application for aptitude-based admissions? There is no separate application for aptitude-based admissions.",
    "What are the supporting documents which I need to submit? Click the links below for information on the typical supporting documents to be submitted.Singapore-Cambridge GCE A-LevelPolytechnic Diplomas from SingaporeIB DiplomaNUS High School DiplomaInternational/Other Qualifications",
    "Does SMU practice aptitude-based admissions? At SMU, we are committed to a holistic and aptitude-based admissions approach, where we look for students who have not only been successful academically but who possess qualities that we value. In addition to academic grades, we will look for evidence of these qualities such as aptitude, positive attitude, intellectual curiosity, critical thinking and communication skills, as demonstrated through leadership in co-curricular activities; impactful involvement in community service and volunteer programmes; significant awards and achievements in areas relevant to the course applied for; noteworthy involvement in work/internships relevant to the course applied for; as well as other relevant factors.",
    "Can I print the online application form from the website and submit it by hand/post? Applications must be submitted online. There are no hardcopy or downloadable application forms. Applications submitted from forms that are downloaded and printed from the website will not be accepted.",
    "Can I apply for admission now and defer my studies for one year? Currently, full-time National Servicemen or regulars in the SAF or Singapore Police Force are allowed deferment of studies due to military obligations. If your application for admission is successful and you wish to request for deferment for another reason, please email us atadmissions@smu.edu.sgfor consideration.",
    "My application was unsuccessful in last year's admission exercise. Will I be penalised in any way if I apply again this year with the same results? You will not be penalised. We will treat it as a fresh application each time you apply. You compete with a new pool of applicants in each admission exercise.",
    "I have already graduated with a Bachelor's degree. Can I apply for a second degree? Yes, you may. However, as the number of places for undergraduate degrees is very limited, priority for admission will be given to those without a first degree. You may wish to consider pursuing postgraduate degree programmes.",
    "I have submitted an online application for admission. I would like to cancel my application. How do I go about doing this? Please email us atadmissions@smu.edu.sgon your decision to cancel or withdraw your application. Kindly indicate your full name and application number in your email.",
    "Will all applicants get a chance to be interviewed for admission? Only shortlisted applicants will be interviewed.",
    "For UK A-Level qualifications, what subject combinations are accepted? We do not have any subject pre-requisites, except for applicants to the Bachelor of Science (Economics) programme, where a good pass in A-Level Mathematics is required.",
    "My final high school results will be released after the admissions application deadline on 19 March 2023. Can I still apply? If your final results are not available at the time of application, you must still submit an application for admissions by 19 March 2023*. Please submit your predicted high school results, as attested by your school teacher/counsellor. The predicted results must be submitted by 31 March 2023. You must send in your actual high school results immediately when available.*Now extended to 22 March 2023, 11.59pm, Singapore Standard Time.",
    "Is SAT/ACT/IELTS/TOEFL/C1 Advanced compulsory for IB applicants? SAT/ACT/IELTS/TOEFL/C1 Advanced is not compulsory for IB applicants.",
    "I will be sitting for my IB Diploma examinations in May 2023. Can I still apply for admission, even though applications have closed? Yes, you may apply by submitting your IB predicted scores, as attested by your school. Self-declared predicted scores will not be accepted.  The predicted scores must reach SMU by 31 March 2023 for prospective students applying in the Academic Year 2023-24. Please apply for admission and submit the predicted scores early.",
    "I do not have GCE O-Level qualifications prior to my Diploma from the local Polytechnics. Can I apply for admission? Yes, you can apply for admission, even if you do not have any GCE O-Level qualifications.",
    "Does SMU accept any type of Polytechnic Diploma for the purpose of admission? For the purpose of admission, SMU will consider acceptable polytechnic diplomas (except Advanced Diplomas/Specialist Diplomas/Certificate Courses) from the 5 Polytechnic institutions in Singapore (Nanyang Polytechnic, Ngee Ann Polyechnic, Singapore Polytechnic, Republic Polytechnic and Temasek Polytechnic). Such diplomas are typically done on a full-time basis over three years.",
    "Will applicants applying with a full set of Polytechnic results have an advantage over the final semester Poly students who apply using their five semester results? Both groups will not be disadvantaged. Final year students are required to submit their final semester results immediately when available.",
    "I am a Polytechnic graduate. Do I need to have a Certificate of Merit to apply? You do not need to have a Certificate of Merit to apply for admission. You are welcome to apply as long as you satisfy the basic entry requirements.",
    "I did not pass my Mother Tongue Language at the A-Levels. Can I qualify for admission? If you meet the other admissions requirements, you will be offered Conditional Admission into SMU. You must fulfill the Mother Tongue requirements before graduating from SMU.",
    "I am a private candidate who has taken the Singapore-Cambridge GCE A-Level examination in 2004 or earlier and do not have project work (PW). Will I be at a disadvantage when I apply for admission? No, you will not be at a disadvantage.",
    "Can I use my GCE A level results which were based on the “old A-Level syllabus” to apply for admission? Yes. You can apply for admission with results taken under the old syllabus.",
    "Can I gain admission if I fail the General Paper? If you did not pass your GP, you can still apply. We will take into consideration your performance in the other A-Level subjects on a competitive and selective basis.",
    "Can I combine my A-Level results from different sittings for the purpose of application for admission? I wish to retake my A-Levels. Do I have to take all my H2 and H1 subjects again? SMU will consider your grades for three H2 content-based subjects and General Paper (GP) / Knowledge and Inquiry (KI)taken at the same sitting of the A-level examination. The H1 content-based subject and H1 Project Work (PW) subject can be of a different sitting.If you wish to retake your A-Level exams, you will need to take all H2 content-based subjects and GP/KI again in one sitting.As for the H1 content-based subject and  H1 PW, you can choose not to retake and use the grades attained at the earlier sitting of the A-level examination.However, if you decide to retake one or all of the H1 content-based subjects and H1 PW subject, thebestH1 content-based subject and H1 PW grade will be taken into consideration.",
    "What is the difference between Tuition Fee Loan (TFL) and Study Loan (SL)? The Tuition Fee Loan (TFL) finances up to 90% of the subsidised tuition fee payable by a Singaporean student.Subject to eligibility, the Study Loan (SL) finances the balance of the subsidised tuition fee payable by a Singaporean student. In addition, a loan of up to $3,600 (maximum) per annum to help students meet their daily living expenses is available under the SL scheme.Both TFL and SL however, do not cover the annual fees which need to be paid by the student. If the annual fees remain unpaid, the living allowance (LA) will used to offset against the annual fees before the net amount is disbursed to the student.For further information and application, please go toFinancial Assistance Schemes website",
    "I have applied for Financial Aid(s) (e.g. Mendaki, CPF Loan, Tuition Fee Loan, Study Loan, Post Secondary Education Account) and/or Scholarship(s) before the start of term. Why is it not shown in my statement of Account? The approved Financial Aid(s) and/or Scholarship(s) payments will be posted to your online Statement of Account in due course depending on the approval date. If the Financial Aid(s) and/or Scholarship(s) do not cover 100% of your Tuition Fees, please arrange for the remaining balance to be paid by the other available payment modes. Please take note that you are still required to pay the mandatory Annual Fees if it is not covered by any of your Approved Financial Aid(s) and/or Scholarship(s).You do not need to pay on due date if your subsidized tuition fees is covered by Financial Aid(s).",
    "Does the Tuition Fee Loan (TFL)/Study Loan (SL) finance the Term 3 tuition fees? Yes, the TFL/SL cover the tuition fee for all the terms including summer term (ie, Term 3). The financing also include regular terms where a student went on leave of absence but failed to apply for it within the stipulated deadline.",
    "Can Mendaki/CPF/TFL/SL/PSEA pay for my summer term? Mendaki – NoPSEA – YesCPF – YesTuition Fee Loan – YesStudent Loan – Yes",
    "I am not on the student loan financing but I have exceeded the 8 terms of study at SMU. Am I eligible to apply for student loan financing? If you are already on the Tuition Fee Loan (TFL) and/or Study Loan (SL) Schemes, you will continue to receive the same quantum of student loan financing, which is pegged to the subsidised tuition fee payable by a Singaporean student, until you graduate. Please write in to (studentloans@smu.edu.sg) to inform Student Loans Team of your extended study so that the loan tenure can be extended accordingly.If however, you are an International Student who was not on student loan financing schemes, you would not be eligible to apply for the financing as International Students are not eligible to apply for student loan financing if they are paying non-subsidised tuition fees.",
    "Are the annual fees covered under the student loans? The student loans only cover subsidised tuition fees. Annual fees are not covered under these loans and would need to be paid separately to the University.",
    "The banks that I approached to enquire about student loans for undergraduates, have asked me to get a Letter of Offer (LOO) from SMU. Which Office do I approach to request for the LOO? Unlike the other Institutes of Higher Learning (IHLs) where the student loans for undergraduates are administered by external agents (ie, banks), SMU insourced the loan administration function since January 2014 as part of the University’s strategic direction to create a more direct link with the students and to provide a one-stop service on SMU’s campus for the students. As such, you are not required to get a LOO from SMU in order to apply for student loans for undergraduates.The loan application is done via your student portalOASIS > Self-Service Apps – Financial Aid Application(under “Policies and Self-Service Apps”)or> Finance & Admin > Fee Matters & Financial Assistance Schemes > Schemes & Obligations > Apply for Finance Aid(located at the end of the page)Financial Aid Type: LoanFinancial Aid Form: Select as appropriate – (a) Tuition Fee Loan and Study Loan; (b) SMU Education Loan and/or (c) SMU Student Computer Loan",
    "Why do I need to pay for the Annual Miscellaneous Fees? All students are charged the mandatory miscellaneous fees regardless whether you are on Leave of Absence (LOA) for a term. These fees help defray the costs of student activity, registration, information technology, library services, group insurance and any other academic-related services.",
    "Why do I still receive outstanding fee reminders from the Office of Finance when I am on Tuition Fee Loan (TFL) and Study Loan (SL) financing? The Tuition Fee Loan (TFL) and Study Loan (SL) finance only up to 90% and balance 10% (subject to eligibility) respectively of the subsidised tuition fee payable by a Singaporean student. Both TFL and SL however, do not cover the annual fees which need to be paid by you.Thus, if you are a Singapore Citizen paying subsidised tuition fee and has not applied for Living Allowance (LA) under the SL scheme, the reminder is to prompt you that you have not paid the annual fees which are not covered by the TFL and SL schemes.If you are a Singapore Citizen paying full fees due to studies (excluding Leave of Absence terms without fee obligations) beyond normal candidature of 8 terms, the reminder is to prompt you that there are partial tuition fee and/or annual fees which remain outstanding and have not been paid.If you are a Singapore Permanent Resident (SPR) or International Student (IS), the maximum loan quantum of 100% and LA are unable to cover your full tuition fee. The reminder is consequently a notice to prompt you that you have outstanding tuition fee and/or annual fees not paid.Should you have unpaid annual fees and/or remaining tuition fee not financed by TFL, SL and LA, you would need to settle them by the various payment modes available.If you are still unsure of the balance tuition tee to pay after taking into account your approved loans, you may like to make use of the onlineTuition Fee Calculatorto simulate the Net Tuition Fee Payable Amount (ie, net amount payable after approved loans financing).",
    "Why are my financial aids not reflected in my online Statement of Account? If you have been approved of financial aids prior to the start of the term, the financial aids will be reflected in your online Statement of Account after verification, by Week 3 of the term. You would need to settle the balance outstanding (including annual fees, where applicable) not financed by the financial aids before the payment due date which is 30 days from billing date. If you are still unsure of the balance tuition fee to pay after taking into account your approved financial aids, you may like to make use of the onlineTuition Fee Calculatorto simulate the Net Tuition Fee Payable Amount (ie, net amount payable after approved loans financing).If however, you have been approved of your financial aids only after term starts, the financial aids will be reflected in your online Statement of Account within 4 to 6 weeks after the financial aids have been awarded to you.Should there be insufficient funds in your PSEA account or the CPF account, please do note that your online Statement of Account will be adjusted accordingly subsequently after confirmation with MOE and CPF Board.",
    "Why is there a Finance Hold on my account? Please check your account for outstanding fees. Upon successful payment updates, your account would be lifted within 48 Hours",
    "How do I update my contact details for my loan matters? You may update your contact details by writing in to Student Loans Team atstudentloans@smu.edu.sg.",
    "I am already on the student loan financing but I have exceeded the 8 terms of study at SMU. Am I still eligible for student loan financing? If you are already on the Tuition Fee Loan (TFL) and/or Study Loan (SL) Schemes, you will continue to receive the same quantum of student loan financing, which is pegged to the subsidised tuition fee payable by a Singaporean student, until you graduate.You would however, need to write in to (studentloans@smu.edu.sg) to inform Student Loans Team of your extended study so that the loan tenure can be extended accordingly.",
    "What are the available payment modes? Online Credit Card payment via Student Self-Service.Singapore dollar bank draft/cashier's order from any Singapore bank.ChequeAll cheque/Cashier’s order payments shall be made payable to SMU and in Singapore Dollars only.Credit Card -At SSH office (Opp Dental@Uni)(5) NETS - At SSH office (Opp Dental@Uni)",
    "When I write to enquire on my Student loan matters, what information must I furnish to facilitate a reply? Please provide your Campus ID and/or Loan Account number.",
    "Where can I view my invoices? Please be informed that no invoice will be issued. Instead, all charges will be posted to your online Statement of Account.To view your online Statement of Account, please login to Account Inquiry App.",
    "If I am already covered under my personal insurance, can I opt out of the insurance coverage that is part of the Annual Miscellaneous Fees? This is a group insurance purchased on behalf of all students studying in SMU; as such it is mandatory that all students pay for the miscellaneous fees.The insurance is to cover you for Hospitalisation, Medical and Personal Accident for emergencies that may occur when carrying out student activities.",
    "What type of miscellaneous fees do I need to pay? There are 4 components to Annual Fees- Student Activities- Insurance- Hospitalisation & Medical- Insurance- Personal Accident- IT Facilities",
    "What is the penalty imposed for late payment? Penalty charge of up to S$10 (if any) may be imposed if students fail to settle all outstanding fees after due date and will be put on Finance Hold.A notification email will be sent to inform students who are on Finance Hold.Students will NOT be allowed to view their examination results and bid for courses in BOSS.",
    "How do I retrieve the breakdown of invoices that makes up the opening balances? Login toOASIS> Self Service > Campus Finances > Account Inquiry.",
    "How much will I be refunded if I drop a Term 3A course? If a student drops a course for Term 3A within the first 3 days of Term 3A, there will be 60% refund of the tuition fee paid/Charged for Term 3A. Thereafter, there will be no refund.Students who have opted to pay their tuition fee by education loans will have to clear the fees due for the term and outstanding loans with CPF Board.",
    "Why is my Online Payment declined? Possible reasons for declined transaction:Expired card or wrong expiry date.General decline of the card. No other information was provided by the issuing bank.Insufficient funds in the account.Inactive card or card not authorized for card-not-present transactions.The card has reached the credit limit.Invalid CVN. Please ensure you have entered the credit card details correctly.Alternatively, you may try using another card. If you wish to find out the reason of declined transaction, please check with your issuing bank.",
    "My account is on admin hold and I am unable to do BOSS bidding. Do I have to inform Student Loans or Office of Finance about this? it is not necessary for you to write in to Student Loans (studentloans@smu.edu.sg) to enquire or inform on the admin hold on your account if you have already settled the balance of the tuition fees and annual fees (if applicable) not financed by student loans.Notwithstanding that your loan application may be under processing (ie, loan application status not showed as \"Awarded\" yet) when the BOSS bidding exercise starts, you will not be affected and will still be able to do bidding if the outstanding balance in your account is pending the disbursement of the student loans.",
    "Is cash accepted? Please note that cash payment is not accepted in SMU.",
    "Can PSEA pay for my study trip? Yes, if the programme or study trip is approved by SMU as an enrichment programme (summer course).",
    "Where can I pay my bills? Students may pay the bills by logging in toOASIS> Campus Finance> Make a Payment.",
    "I have applied for Term 3A/3B courses and approved for internship during Term 3, will I be refunded if I decide to drop Term 3A/3B courses? For students who have applied and are successful in the application for internship placement in the summer term (Term 3), 100% of the tuition fee will be refunded if you drop Term 3A/3B courses during BOSS 2.For students who drop Term 3A/3B courses after BOSS 2, there will be no refund and the grade of “W” will be recorded.",
    "What is the proper channel to communicate with Office of Finance with regards to tuition fees and financial aid matters? You may communicate with Office of Finance on the following:1) Student loans related matters -studentloans@smu.edu.sg2) PSEA, CPF, Mendaki, SkillsFuture and tuition fees-related mattersa) OASIS -https://oasis.smu.edu.sg/Pages/OFN/Contact-Us-OFN-CSFA.aspxb) SMU Main page -https://ofnsupport.smu.edu.sg/hc/en-us/requests/new",
    "What is the study candidature for single & double degree course? The normal candidature period* (single and double degree) is 4 years. Students should attempt to graduate within the normal candidature period. The candidature period includes time taken to fulfill the internship and community service requirements, as well as time taken to undertake external study programmes (such as international exchange programme).Leave of absence that has been approved will not be counted within the candidature period.During the period of candidature, generally, a student must enroll for at least 1 course unit and not more than 5.5 course units of study per term.*Government funding for undergraduate education in which every undergraduate student admitted is only funded up to the normal candidature of four (4) years.If a student has yet to graduate after the 4th year of study, there will be no further Tuition Grant from the government to fund this student. Full tuition fee will then apply, as stipulated inOASIS(please refer to Home>Academic>Advisement & Curriculum>Period of Candidature for more information)",
    "What is the annual fees make up off? There are 4 components to Annual Fees- Student Activities- Insurance- Hospitalisation & Medical- Insurance- Personal Accident- IT Facilities",
    "How much will I be refunded if I drop a Term 3B course? If a student drops a course for Term 3B within the first 3 days of Term 3B, there will be 60% refund of the tuition fee paid/Charged for Term 3B. Thereafter, there will be no refund.Students who have opted to pay their tuition fee by education loans will have to clear the fees due for the term and outstanding loans with CPF Board.",
    "How do I update my receiving bank account information to receive payment from the University? Payments from the University to the students are managed via interbank giro. You must, therefore, register your receiving bank account information with the University.A bank account registered and not belonging to you (singly or you not being a joint account holder) will not be accepted.Please login to OASIS > Self Service > Campus Finance > Maintain Bank Accounts > Receiving Bank Account Details",
    "How much are the annual fees? Annual Fees are subjected to vary yearly review. For the latest annual fees payable, please visithttps://admissions.smu.edu.sg/financial-matters/tuition-fees-grant",
    "Where can I view my Online Statement of Account? Students will be notified via email of any charges (and its payment due date) posted to their online Statement of Account.Students may view their online Statement of Account by logging in to OASIS > Campus Finance> Account Inquiry.",
    "Why is my Online Payment in error? Access denied, page not found or internal server error.Please contact IT Help Centre at Tel: 6828 0123 or email:helpdesk@smu.edu.sg",
    "How do I terminate my GIRO Debit (deduction of fees) Bank Account? Complete the GIRO Bank Account Termination Form at OASIS > Self-Service > Maintain Bank Accounts > Add Paying Bank Account, select Cancellation.Please complete the online form, print the form, sign on the hardcopy form and then submit to Office of Finance at the available drop box at:• 1st floor, Administrative Building• SSH Office (Opp Dental@Uni)",
    "How can I retrieve the GIRO account information that I had submitted previously? You can view the previous submission under OASIS > Self-Service > Maintain Bank Accounts > Add Paying Bank Account.",
    "What is the coverage of the group insurance? The insurance coverage includes:-• Group Personal Accident Coverage that is a 24 hours worldwide coverage, which covers accidental death, accidental permanent disablement, outpatient accident medical reimbursement, and physiotherapy reimbursement.• Outpatient GP Consultation Coverage• Outpatient Specialist Consultation Coverage• Hospitalisation and Surgical Coverage To find out more on the coverage and claims, please visit student life website at:https://www.smu.edu.sg/campus-life/health-and-safety/student-insurance-coverage/student-insurance-coverage.",
    "When would the Finance Hold be lifted? Upon successful payment updates, your account would be lifted within 48 Hours",
    "I am into the 5th year of my study due to LOA in previous term(s). Am I eligible for student loan financing? If you are already on the Tuition Fee Loan (TFL) and/or Study Loan (SL) Schemes, you will continue to receive the same quantum of student loan financing, which is pegged to the subsidised tuition fee payable by a Singaporean student, until you graduate. No action is required from you as Office of Finance would have already extended your loan tenure accordingly based on your approved LOA application.However, if you are not on student loan financing schemes and would like to apply for the financing, you may do so when the application window opens. Please note that International Students who are paying non-subsidised tuition fees are not eligible to apply for the student loan financing.",
    "I qualify for Tuition Fee Loan (TFL) and Study Loan (SL). However, I still require further financial assistance to pay my tuition fee/living expenses. Is there another loan scheme I can consider? If you have exhausted all means under the TFL/SL schemes (including living allowance) but still require further financial assistance for living expenses or pay the balance tuition fee, you can consider applying for the SMU Education Loan.For further information and application, please go toSMU Education Loanlocated at theFinancial Assistance Schemeswebsite.",
    "What happens to my Tuition Fee and Study Loan if I terminate my studies? If you pre-terminate your studies or withdraw your studies from SMU without completing your course of study, the loans that you have taken out during your stay at SMU will become immediately due and repayable in full.Interest will be chargeable with effect from the first day of the month following the termination if the loans remained outstanding.",
    "Will my fees be adjusted if I have changed my nationality/citizenship? The effective date will be the date which students present their official documents to Office of Registrar. Any adjustment on the tuition fees will be made if the effective date falls before the start of academic term. Otherwise, the fee adjustment will take effect from the following academic term(s).",
    "What are the miscellaneous fees and how often do I have to pay? Miscellaneous fees are fees charged for registration, information technology, library, sports-related, student activity, insurance and other orientation and academic-related services. They are compulsory and are payable prior to the start of the new academic year.",
    "I have applied for student loans to finance my tuition fee but the loans are not showed in my account inquiry in OASIS. Do I need to pay the full tuition fee? If you have applied for student loan financing but the loan application (i) has not been approved or (ii) has been approved but the loans have not been disbursed to your account, it is not necessary for you to settle the full tuition fee.You are required to settle only theremainingbalance of your tuition fee not financed by the student loans and the mandatory annual fees (if applicable) if the annual fees are not covered by any of your approved financial aids or scholarship.",
    "I have applied for the CPF Education Loan (CPF Loan), Tuition Fee Loan (TFL) and Study Loan (SL) to finance my tuition fee. However, I want to utilise the TFL and SL first before the CPF Loan. Can this be done? As the CPF Loan ranked in higher priority in terms of disbursement (based on the order stipulated by MOE), the CPF funds will be disbursed first to finance your tuition fee. The TFL and SL will be disbursed accordingly to cover the balance outstanding tuition fee only if there is insufficient CPF funds to pay off the full tuition fee. Consequently, you would not be able to utilise the CPF funds last.Besides, the TFL and SL cover 100% of the subsidised tuition fees payable by a Singapore Citizen. If you are a Singapore Citizen and eligible for both TFL and SL, you will not require CPF Loan and may wish to consider revoking the CPF arrangement.If however, you are a non-Singapore Citizen, you may specify the percentage of CPF funds you wish to utilise when submitting the application to CPF Board so that the balance outstanding tuition fees will be financed by the TFL and SL. Please however, note that CPF, TFL and SL do not cover the annual fees which need to be paid by you.",
    "How do I pay my tuition fees? Can I pay in instalments? Fees are payable in two instalments in a year – at the beginning of the first and second semesters. Fees for special term courses are payable separately.",
    "I am a non-Singaporean student. Will I be able to get 100% financing for my tuition fees? As an International Student, you will not be able to finance your tuition fees fully with the various financial assistance schemes as the Tuition Fee Loan (TFL) and Study Loan (SL) finance only up to 90% and balance 10% (subject to eligibility) respectively of the subsidised tuition fees payable by a Singaporean student.Should you be eligible for the Study Loan Living Allowance (LA) and Education Loan (EL), these 2 schemes may potentially provide additional financing of up to $4,300. However, the EL is tenable for only 1 year of study.Nevertheless, if you are a Singapore Permanent Resident (SPR), you would be able to fully finance your tuition fees if you are eligible for all of the above 4 financial assistance schemes.",
    "How do I apply for financial assistance to fund my tuition fee if the banks I approached to enquire about loan financing for my tuition fees informed me that they do not offer Tuition Fee Loans to SMU students? As the student loans are administered by SMU instead of external agents, you can apply for the student loans via your student portalOASIS > Self-Service Apps – Financial Aid Application(under “Policies and Self-Service Apps”)or> Finance & Admin > Fee Matters & Financial Assistance Schemes > Schemes & Obligations > Apply for Finance Aid(located at the end of the page)Financial Aid Type: LoanFinancial Aid Form: Select as appropriate – (a) Tuition Fee Loan and Study Loan; (b) SMU Education Loan and/or (c) SMU Student Computer Loan",
    "How do I know if I am eligible for financial aid? You may use theStudent Financial Needs Calculatorto help determine if you are eligible and to find out the type and quantum of financial aid that you may qualify for.",
    "Are the miscellaneous fees covered under the financial loan schemes? The financial loan schemes only cover subsidized tuition fees. Miscellaneous fees are not covered under these loan schemes and are usually paid separately to the University.",
    "Does SMU offer any financial aid? SMU has a comprehensive range of financial aid schemes to help students in the payment of their tuition fees. These schemes cover only the subsidised tuition fees. They do not cover the miscellaneous fees charged by SMU. Please clickherefor more details.",
    "How do I apply for scholarships? You will be asked to indicate your choices of scholarships in the online application form for admission. If you have submitted an online application for admission without having indicated your choices of scholarships, you may do so by applying for scholarships throughApplicant's Self Service.",
    "I would like to find out more about the tuition fees. Please clickherefor more information.",
    "I have applied for the CPF Education Loan (CPF Loan) and maximum Tuition Fee Loan to finance my tuition fee. However, I want to utilise the TFL first before the CPF Loan. Can this be done? As the CPF Loan ranked in higher priority in terms of disbursement (based on the order stipulated by MOE), the CPF funds will be disbursed first to finance your tuition fee. The TFL (subject to the percentage as specified in your application) will only be disbursed to cover the balance outstanding tuition fee if there is insufficient CPF funds to pay off the full tuition fee. Consequently, you would not be able to opt to utilise the CPF funds last.That said, if you want wish to maximise the TFL financing, you would need to specify the percentage (10%) of CPF funds you wish to utilise when submitting the application to CPF Board so that the balance outstanding (90%) tuition fees will be financed by the TFL.",
    "Where can I find information on scholarships? Please clickherefor details on scholarships.",
    "When can I receive my scholarship allowance?​ If you have been approved of your scholarship prior to the start of the term, your scholarship allowance will be disbursed to you latest by end of Week 8 of the term.If however, you have been approved of your scholarship only after term starts, you will receive your scholarship allowance within 4-6 weeks after the scholarship has been awarded to you.",
    "When can I apply for financial aid? Students must first matriculate before they apply. Apply online viaOASIS Applicant's Self Service.",
    "Can I use my scholarship allowance to offset my tuition fee and annual fee?​ The scholarship will automatically be used to offset against your tuition fee if the quantum is less than $8,000 per year.If however, the scholarship quantum is at least $8,000 per year, the first $8,000 (ie, $4,000 per regular term) shall be disbursed to you as living allowance while the balance will be used to pay off any outstanding tuition fee (in equal amount for each regular term).Where there is no outstanding tuition fee, the full quantum for the term will be paid to you.You would need to pay the annual fees as the scholarship quantum will not used to offset against the annual fees. Should you wish to use the scholarship allowance (ie, wait for the scholarship allowance to be received and use the allowance) to pay the annual fees, you will find that there will be a finance hold on your account in the meantime as you will only receive the scholarship allowance sometime in end of Week 8 of the term.",
    "I need to purchase a notebook computer. Is there any loan scheme that I can apply for? You may apply for the SMU Student Computer Loan, which seeks to assist needy students in acquiring a notebook computer for their study activities, to purchase a notebook computer from one of the University-appointed notebook vendors.For more information and application, please go toSMU Student Computer Loanlocated on theFinancial Assistance Schemes website",
    "Does tuition fees include accommodation and living expenses? Tuition fees do not include accommodation, miscellaneous fees, cost of books and study materials and living expenses.",
    "Why do I need to pay tuition fee if I was informed that, as a Singaporean student, I will automatically be granted and need not apply for the Tuition Grant? Tuition Grant (TG) is a grant from the Singapore Government to help students manage the costs of full-time tertiary education in Singapore. It is applicable to eligible Singapore Citizens (SC), Singapore Permanent Residents (SPR) and International Students (IS) enrolled in full-time diploma or undergraduate courses at the autonomous universities, polytechnics and art institutions. For more information and application, please go to Tuition Grant Subsidy scheme located on theMinistry of Education (MOE) websiteor call the MOE Tuition Grant Section Hotline at 65-6872 2220.The TG thus, enables an eligible student to pay tuition fees at subsidised rates. It does not however finance the tuition fees payable. Should a student require financing to pay for his/her subsidised tuition fees, the student may apply for the various available financial assistance schemes.For further information and application, please go to theFinancial Assistance Schemes website",
    "What would be my tuition fees if I am admitted to the Double Degree Programme (DDP)? DDP students are required to pay the higher of the tuition fees if both degree programmes are priced differently e.g. Law students pay the higher tuition fees.",
    "I am receiving a number of financial aids (including CPF Education Loan and student loans) for my tuition fee. In what order will my tuition fee be deducted? Your tuition fee will be deducted by the following order of priority as stipulated by MOE (with 1 being the highest priority to be disbursed first) :Mendaki Tertiary Tuition Fee Subsidy (TTFS),Scholarship/bursary (per gift agreement),SkillsFuture Credit,Post-Secondary Education Account (PSEA),Central Provident Fund Education Loan (CPF Loan),Student Loans – (i) Tuition Fee Loan (TFL), (ii) Study Loan (SL), (iii) Study Loan Living Allowance (LA), (iv) Education Loan (EL)",
    "I am keen to go for an overseas exchange program. However, I do not have the financial means to do so. Is there any loan scheme available for this purpose? The SMU Overseas Student Programme (OSP) Loan Scheme is aimed at enabling more Singaporean students to take advantage of various overseas experiences so as to gain international exposure and consequently develop a more global mindset. The loan scheme is available for students participating in OSPs approved by SMU.For more information and application, please go toSMU Overseas Student Programme Loanlocated on theFinancial Assistance Schemeswebsite.If you are a non-Singapore Citizen, you would need to find alternative financing to fund your overseas experience, That said, grants and scholarships are available to help students (including non-Singaporean students) defray part of their costs. Should you be eligible, you may wish to consider applying for these schemes. For further information and application, please go to theFinancial Assistance Schemeswebsite.",
    "Will students paying unsubsidised tuition fees be eligible for any financial aid or scholarships? Students paying unsubsidised tuition fees are not eligible for any financial aid or scholarships administered by Singapore Ministry of Education (MOE) or SMU.",
    "Will I receive a statement of the financial aids that I have? You will receive the loan statement of accounts from the Student Loans Team. It will only reflect the loan (including Study Loan living allowance) disbursed throughout your course of studies.For more information on other financial aids (PSEA, CPF, Scholarships, Bursary, Tuition Fees), kindly go to yourOASISportal to view the summary for the past semesters.",
    "What are the financial assistance schemes available to post-graduate students? SMU offers loan financing for only 2 post-graduate programmes - SMU Master of Science in Wealth Management (MWM) and SMU Master of Science in Applied Finance (MAF).If you are a Singapore Citizen or Singapore Permanent Resident pursuing one of these post-graduate programmes, you may download the application forms from the respective programme websites:MWMMAFAlternatively, you may approach the relevant programme administrators to make enquiries.If however, you are a Singapore Citizen or Singapore Permanent Resident but pursuing other SMU post-graduate programmes, you would need to approach one of the commercial banks or financial institutions to apply for an education loan.Loan financing is generally not available to International Students who are on post-graduate programmes in Singapore. That said, if you are a post-graduate student of Indian nationality, you may wish to consider checking with State Bank of India Singapore Branch which offers student loans exclusively for students from India who have secured admission in selected educational institutions for higher studies in Singapore, to enquire if the student loans are also extended to post-graduate programmes.",
    "What is the Tuition Grant Scheme? The MOE Tuition Grant is a grant provided by the Government of Singapore to help students manage the costs of full-time tertiary education in Singapore. Eligible Singapore Citizens, Permanent Residents and international students enrolled in full-time undergraduate courses at the autonomous universities may receive it.You are eligible to take up a Tuition Grant if you have not previously taken a Tuition Grant or received sponsorship/scholarship from the Government of Singapore to attain another qualification at an equal or higher level.Eligible Singapore Citizens are automatically awarded a Tier A Tuition Grant, which is the highest level of tuition fee subsidy, when you commence your studies. Singapore Citizens thus pay the lowest tuition fees. There is no bond obligation.Eligible Permanent Residents may choose to apply for a Tier B Tuition Grant only. Successful applicants are required to work for a Singapore entity for three years upon graduation.Eligible international students may choose to apply for a Tier C Tuition Grant only. There is a limited number of Tuition Grants available for international students, and selection is competitive and based on merit. Successful applicants are required to work for a Singapore entity for three years upon graduation. Those who are not eligible for, or choose not to take the grant, will pay the non-subsidised tuition fees and will not be bound by the three-year work obligation.There are Tuition Grant implications for the following categories of students:1. Applicants holding degrees from the publicly-funded Singapore tertiary institutions2. Transfers within SMU or from the other publicly-funded Singapore tertiary institutions3. Re-admitted undergraduatesFor full details of this scheme and frequently asked questions, please refer to theMOE website.",
    "I have applied for a bursary as well as Tuition Fee Loan (TFL). Will the bursary be used to offset against the balance fees not covered by the Tuition Fee Loan? Depending whether your awarded bursary is an allowance or one that is used to offset your tuition fee.If the awarded bursary is an allowance, the allowance will be paid to you to the bank account that you have in OASIS. You may use the bursary to pay off the balance fees when you received the funds in your bank account.",
    "Do I need to terminate my student loans arrangement if I am subsequently awarded a scholarship? You would need to check the terms and conditions of your scholarship to find out if you are eligible for other financial aids. Please ensure that you do not breach the terms and conditions of your scholarship. If however you are unsure, do contact your sponsor or Centre for Student Financial Assistance (CSFA) (finasst@smu.edu.sg) (if applicable) for clarity.Should you need to cease the loan disbursement or repay your student loans, please write in to Student Loans Team (studentloans@smu.edu.sg).",
    "What are the financial assistance schemes available to undergraduates? There are several financial assistance schemes (FAS) available at SMU to assist undergraduates in managing their educational expenses, from financing of tuition fees, daily expenses to participating in overseas student programmes.For more information and application, please go to theFinancial Assistance Schemes website",
    "When is the PSEA application dates for current term? For the latest PSEA application dates, please visit the websitehttps://admissions.smu.edu.sg/financial-matters/financial-aid/post-secondary-education-account-psea-scheme",
    "When do I have to pay my term fees? Students will be notified via email of any charges (and its payment due date) posted to their online Statement of Account. Students may view their online Statement of Account by logging in toOASIS > Finance & Admin > Fee Matters & Financial Assistance Schemes > Account Inquiry.",
    "How do I apply for GIRO Payment to pay my school fees? Step to apply for GIRO to pay your school fees as follow:-You need to get ready the following before applying for Interbank GIRO:A - Name of Payer's bankB - Payer's bank account numberC - Payer’s name as reflected in their bank statement or bank bookD - Access to a printer to print out the generated Interbank GIRO Application Form Log in to OASIS > Self-Service > Maintain Bank Accounts > Add Paying Bank Account.Step 1: Complete the Interbank Giro Form online with the information from A, B and C.Step 2: Click \"Submit\"Step 3: Print GIRO Application Form (this may take a few minutes)Step 4: Print the generated PDF documentStep 5: Payer to sign the document with signature as per bank recordsStep 6: Student to submit the hard copy form to Finance Office (Level 1 of Administration Block or SSH Office Opp Dental@Uni )",
    "When is the CPF application dates for current term? For the latest CPF application dates, please visit the websitehttps://admissions.smu.edu.sg/financial-matters/financial-aid/cpf-education-loan-scheme",
    "What are annual fees and how frequent must I pay them? Annual fees are not included in the tuition fee and not covered by tuition grant. These fees are charged for information technology, student activities and insurance. They are mandatory and are payable once a year prior to the start of the new academic year.",
    "If I am approved of my application for leave of absence, can I still apply for bursary? You are not restricted to apply for bursary should you be contemplating to apply for leave of absence. Your bursary application, if approved, is awarded for one year of your academic studies.Payment is made in each regular term of your study and subject to you being in active term of study.",
    "What happens if I have applied for my tuition fee to be paid by GIRO and I have also submitted my PSEA application form? Your tuition fees will be paid forth by your PSEA Account first before any deduction on the balance outstanding fee is made from your Bank Account.If you have applied through the Standing Order PSEA Application Form, we will deduct whatever balance you have in your PSEA Account.If you have applied through the Ad-hoc PSEA Application Form, we will claim the stated amount on the form subject to the balance available in your PSEA Account.Please check with MOE to ensure that you have sufficient balance in your PSEA Account when filling out the PSEA Ad-hoc Application Form.",
    "Do I need to pay fees if I withdraw from the school within 2 weeks? If the withdrawal is effected within the first 2 weeks of the term, tuition fees charged would be reversed.",
    "Will my fees change if I change my primary program in year 2? If you are applying to change your primary degree programme in year 2, you shall be liable for payment of the prevailing rate of tuition fees applicable to the new programme if approved.National Servicemen will lose the fee privilege granted for admission to the previous programme.The Office of Registrar will inform you on the outcome of your application.",
    "If I am approved of my bursary application this year, do I need to submit a new application for my subsequent year of study? Generally, a bursary is tenable for one year of the recipient’s academic studies.To continue to receive such financial assistance, a new application is required to consider the applicant’s eligibility for a subsequent year’s award.",
    "How do I make payment by cheque? All cheque payment shall be made payable to “SMU” and in Singapore Dollars only.Please indicate clearly your Full Name, Matriculation Number (NRIC/SMU/Campus ID Number) and Contact Number on the back of the cheque and deposit it into the Finance drop box available below.• 1st floor of Administrative Building• Outside SSH Office(Opp Dental@Uni)",
    "When are the fees due for payment? Please log in toAccount Inquiry Appto view the due date for each charges.",
    "How many days are the fees due after charged? The fees charged are normally due in 30 days for Term billing. For trips and adhoc charges, it would be dependent on the programme manager.",
    "How can I be eligible for a bursary? To be eligible for the various University bursaries (eg, SMU Bursary, SMU Access), your tuition fees need to be funded by loan schemes or subsidies and covered up to 90% of the subsidised tuition fees payable by a Singaporean student.The loan schemes/subsidies are available for application during several application windows in an academic year and the application dates, other than being announced via emails, are published in the following:1. OASIS under \"Announcements\", \"SMU\" tab2. SMU websitehttps://www.smu.edu.sg/campus-life/financial-matters/financial-assistance-schemes(under the individual schemes)",
    "Does SMU accept GIRO Payment for Fees? Payment mode via Giro starts only from Term 2 of study. Do ensure that the application status is Approved for GIRO to be in effect. You can check the status inOASIS> Self-Service > Maintain Bank Accounts > Add Paying Bank Account.",
    "What is the subsidised tuition Fees for current term Singaporean? Your Tuition Fees will vary depending on your admit term. For the latest fees payable, please visit the websitehttps://admissions.smu.edu.sg/financial-matters/tuition-fees-grant",
    "How do I make payment online? Only Visa or Mastercard will be accepted.Credit Card payment is subject to the credit limit as granted by your bank. Please log in toOASIS > Self Service > Make A Payment",
    "May I know the CPF Loan rejection reason? Due to confidentiality reason, the CPF Account Holder will have to contact CPF Board directly either via call or email personally to find out the reason for rejection.CPF Hotline: 1800-227-1188 (local)CPF Education Scheme email:education@cpf.gov.sgCPF Education Scheme fax: 6229-3243",
    "When am I able to apply for financial assistance? The various financial assistance schemes (Mendaki Tertiary Tuition Fee Subsidy, PSEA, CPF Education Scheme, Tuition Fee Loan, Study Loan and SMU Education Loan) to help fund your tuition fees have application windows and the application dates. Other than being announced via emails, they are published in:1. OASIS under \"Announcements\", \"SMU\" tab2. SMU websitehttps://admissions.smu.edu.sg/financial-matters/financial-aid",
    "What are the financial loan schemes available to the undergraduates We have a range of financial loan schemes to assist students in the payment of the tuition fees. Please note that these loan schemes cover the subsidized tuition fees and exclude the non-tuition fees charged by the University. Detailed information on the application for these loans will be sent to the students in the Matriculation Pack. Please clickherefor the list of available financial loan schemes",
    "Am I allowed to receive a scholarship and a bursary in the same year? Generally, concurrent receipt of two awards in the same year of study may not be allowed. However, this may vary between awards. You would need to refer to the eligibility criteria and/or the terms and conditions of award.If you wish to seek further clarification, you may send your email to the Centre for Student Financial Assistance (finasst@smu.edu.sg), providing details of the schemes you are enquiring on.",
    "What is the subsidised tuition Fees for current term Singaporean? Your Tuition Fees will vary depending on your admit term. For the latest fees payable, please visithttps://admissions.smu.edu.sg/financial-matters/tuition-fees-grant",
    "Why did I receive a refund for my tuition fees? If you applied for your PSEA funds to offset your tuition fees or have applied for any financial assistance scheme (eg. bursary, loan), it will be deducted or disbursed to offset your tuition fees. Any excess payment would be refunded to you in accordance to the mode of your tuition fee payment.",
    "When will I be notified of my coming term fees? Term Fees will be posted to your account 2 to 3 weeks before the start of regular term. A notification email will be sent to all students via your respective SMU email account of any new charges and your relevant charges will be posted to your online Statement of Account. To view your online Statement of Account, please login toAccount Inquiry App.",
    "Are scholarships available to all students? Yes. Scholarships are available to all outstanding local and international students. Please visithttps://admissions.smu.edu.sg/scholarshipsfor the list of scholarships available.",
    "What is the subsidised tuition Fees for current term International Students? Your Tuition Fees will vary depending on your admit term. For the latest fees payable, please visithttps://admissions.smu.edu.sg/financial-matters/tuition-fees-grant",
    "I have completed my coursework requirements and I am doing my internship attachment. Do I have to pay tuition fee for the term? Students who have completed the coursework requirements for their degree but not their internship need not pay tuition fees for the remaining term(s) while fulfilling their internship.",
    "My single course billing has been approved and rates should be applied for my single course. However, I’ve received a full charge for my tuition fees instead. May I clarify? For single module billing charge queries, you may enquire withhttp://ofnsupport.smu.edu.sg.If you have existing loans with us, your Tuition Fee Loan and Study Loan will finance up to 90% or 10% (respectively) of the Singaporean subsidized tuition fees for your single course billing.",
    "Can I pay pro-rated fees for the regular terms (Term 1 & 2)? Student is required to pay the regular term fees regardless of the number of courses registered. If you only have one (1) course remaining before graduating in your final regular term, please approach your School Manager to appeal for single course billing, subject to approval.",
    "What is the subsidised tuition Fee for current term Singapore Permanent Resident? Your Tuition Fees will vary depending on your admit term. For the latest fees payable, please visit the websitehttps://admissions.smu.edu.sg/financial-matters/tuition-fees-grant",
    "I have paid my tuition fees for this term and I need to get a receipt. Where can I collect one? For payment via online credit card and AXS, please retain copy of the receipt generated from the system supported with your Statement of Account (Can be obtained from Account Inquiry App) for your necessary claims.For payment via any other modes, please email to Office of Finance ataccountenquiry@smu.edu.sg",
    "What are the type of fees and the exact outstanding amount I have to pay for the term? Students will be notified via email of any charges (and its payment due date) made to their online Statement of Account. Students may view their online Statement of Account for details on the charges and its outstanding amount by logging in toOASIS > Finance & Admin > Fee Matters & Financial Assistance Schemes > Account Inquiry.",
    "Do I have to pay the tuition fee if I am on student exchange program? Yes. Students on local or international exchange are to arrange for SMU tuition fee to be paid for the term participation in the exchange programme.",
    "When is the Mendaki application dates for current term? For the latest Mendaki application dates, please visit the websitehttps://admissions.smu.edu.sg/financial-matters/financial-aid/mendaki-tertiary-tuition-fee-subsidy",
    "Do I need to pay for my school fees while on internship if I have yet to complete my coursework requirements? If student is on internship and has yet to complete his/her coursework requirements, he/she is liable for tuition fee unless Leave of Absence (LOA) is applied and granted (approved ) for that period.",
    "How long does the MOE Tuition Grant last? There was a change in 2006 in government funding for undergraduate education in which every undergraduate student admitted from Academic Year 2006-07 or thereafter is only funded up to the normal candidature of four (4) years.If a student has yet to graduate after the 4th year of study, there will be no further Tuition Grant from the government to fund this student.Full tuition fee will then apply, as stipulated in OASIS (Refer toOASIS> Academic > Advisement & Curriculum > Period of Candidature.)",
    "How much is the tuition fee for Term 3 if I have bidded 2 course modules successfully? Unlike the regular terms, the tuition fee for Term 3 is priced on a per course basis and is subject to revision without prior notice. To find out the charges of Term 3 course fees, log in toOASIS > Self Service > Campus Finances > Account Inquiry.",
    "Can a person still be the guarantor of my student loans if he/she is already a guarantor of 2 student loans? A guarantor should guarantee a maximum of 2 student loans. If however, you are unable to find a suitable alternative guarantor and your guarantor is prepared to act as the guarantor of your student loans, you may write in to Student Loans Team (studentloans@smu.edu.sg) to appeal for exceptional approval to be granted, on a case-by-case basis, to your guarantor to be a guarantor of more than 2 student loans.Prior to the appeal, you would need to ensure that you highlight to your guarantor of the additional financial obligations that he/she needs to shoulder should, for some unfortunate reasons, the loans that he acts as a guarantor for, default.",
    "I’m a full-fee paying International Student. I am currently in a very tight financial situation and want to know if there is loan that I could take to fund the remaining years of my education? Full-fee paying International Students are not eligible to apply for any loan schemes. However, if you are unable to fund your education, you may consider applying for a bursary or emergency relief fund. For further information and application, please go to theFinancial Assistance Schemes website",
    "What are the supporting documents required for my student loan application? If you are applying for only Tuition Fee Loan (TFL), no supporting document is necessary to substantiate your application.If however, you are applying for other student loans which are subject to household income assessment (ie, PCI assessment), you would need to submit the relevant supporting documents to substantiate your application. Please refer to the attached link for the list of documents required to support your applicationhttps://oasis.smu.edu.sg/Documents/Downloads/OUAFA-CSFA/Checklist_CS.pdf",
    "Can my guarantor be someone who is currently serving National Service and intends to continue his studies after completing his National Service? Your guarantor may not be a full-time student. As he intends to pursue full-time education after he completes National Service, we would encourage you to look for an alternative guarantor due to the financial burden that he would need to shoulder should for some unfortunate reasons, the loans that he acts as a guarantor for, default during his full-time education.",
    "I am a non-Singaporean student. I never received the allowance even though I have been awarded the maximum Living Allowance (LA) of $3,600 under the Study Loan (SL) Scheme. Why is that so? The financing under the Tuition Fee Loan (TFL) and Study Loan (SL) Schemes is not sufficient to cover the tuition fees payable by you. As such, the Living Allowance (LA) which is disbursed over 2 terms annually has been used to offset the outstanding tuition fees.",
    "What does my guarantor need to do if he/she is residing overseas and unable to sign the loan agreements in person in Singapore? All guarantors based in Singapore must come to SMU with the student to sign the loan agreements in the presence of a SMU representative.If however, the guarantor is based overseas and unable to come to Singapore to sign the loan agreements, the student may arrange to send the loan agreements to the guarantor to sign the loan agreements in the presence of an official from the Singapore Embassy/Consulate Office. Alternatively, the guarantor may sign the loan agreements in the presence of a Notary Public or its equivalent.Please note thatnotall lawyers/solicitors are Notary Public or its equivalent. Hence, the guarantor would need to ensure that the lawyer/solicitor is a Notary Public or its equivalent if the guarantor approaches a lawyer/solicitor to witness the signing of the loan agreements and provide documentary evidence to support the Notary Public or its equivalent status is necessary.",
    "Do I need to apply for the Tuition Fee Loan (TFL) and Study Loan (SL) in my subsequent years of study if I am already on student loan financing? Application for financing under the TFL/SL schemes applications is one-time only. If you are approved of your application, you do not need to submit a new application in your subsequent years of study. The financing will take effect from the approved term and shall remain for the remaining tenure of your course of study (including summer term) unless you inform Student Loans Team (studentloans@smu.edu.sg) that you have alternative financing and do not require the loan disbursements.",
    "Can I accept the loan application’s Letter of Offer (LOO) first even though I am unable to sign the loan agreement within 7 days? You are required toacceptthe LOO within 7 days of receipt of the LOO notification. However, you and your guarantor are not required to sign the loan agreement(s) within 7 days of the LOO notification.Nevertheless, upon acceptance of the offer, you are strongly encouraged tofix anappointmentwith Student Loans Teamto sign the loan agreement(s) as soon as possible with your guarantor to avoid delay to the disbursement of loan(s) to your Student Account.",
    "How can I tell whether my loan application has been approved? Once your application has been approved, a Letter of Offer (LOO) notification will be sent to you via your SMU email account. You are required toacceptthis offerwithin 7 daysof receipt of the LOO notification andfix anappointmentwith Student LoansTeamto sign the loan agreement(s) with your guarantor.",
    "Do I have to wait for the next academic year to apply for student loan financing if I miss the application window? The application window for student loan financing opens thrice an academic year (students will be notified via emails of the exact dates):(a) between April and August,(b) between November and December(c) MarchIf you miss the Term 1 and Term 2 application windows, you can wait for the application window to open before the start of the next academic term. If however, you miss the Term 3 application window, you will need to wait for the window period for the next academic year to open before you apply for the student loan financing.",
    "I am interested to apply for the SMU Student Computer Loan. However, can I purchase the notebook computer from other sources? The SMU Student Computer Loan Scheme requires the applicant to purchase the notebook computer from one of the University-appointed notebook vendors.For more information on the notebook vendors, please go toNotebook and Macbook Tenderunder IT Services & Help located in the Integrated Information Technology Services website.",
    "I am an International Student currently overseas, how do I apply to open a bank account in Singapore for purpose of submitting my loan application? International Students currently overseas can open a local bank account with DBS without being physically present in Singapore. It will take 3-5 working days to get the account opened (from the application and submission of the full supporting documents online). The links can be found below.Applicants will just need to upload the supporting documents during their online application.1. Online Opening of personal account:https://www.dbs.com.sg/personal/deposits/bank-with-ease/addon-casa2. Supporting Documents required for the online account opening, under the section: “Foreigner (Studying in Singapore)”https://www.dbs.com.sg/personal/support/bank-account-opening-documents-required.html",
    "I have selected maximum financing for my TFL application. Do I still need to pay any fees? The Tuition Fee Loan (TFL) finances up to 90% of the subsidised tuition fee payable by a Singaporean student. Subject to meeting the eligibility criteria, you may apply for SL to finance the remaining 10% of the subsidised tuition fee payable by a Singaporean student and if applicable, an annual living allowance (LA) of $3,600 (maximum).Therefore, if you had opted for only TFL when you applied for loan financing, you will need to pay the balance fees not financed by the TFL.In addition, the annual fees are not covered under the loan financing. You will need to pay for these charges every Term 1. However, if you are a Singaporean student who is eligible for SL and had opted for SL with LA, you do not need to pay any fee as the LA can be used to offset the annual fees.Should you still require additional funding after exhausting all means under the TFL/SL schemes (including LA), you may consider applying the SMU Education Loan which can be used to pay the balance tuition fee or defray the living expenses.For further information and application, please go to SMU Education Loan located on theFinancial Assistance Schemeswebsite.",
    "What are the conditions for a guarantor for the TFL?​ A guarantor for the TFL needs to meet the following eligibility criteria:(a) Must be at least 21 years old and below 60 years old(b) Must not be an undischarged bankrupt or a student pursuing full-time education(c) May not serve in this capacity for more than two outstanding student loans, including this loanAndone of the following conditions:(i)   Must be a Singapore Citizen for an applicant who is a Singapore Citizen(ii)  Can be either a Singapore Citizen or a Singapore Permanent Resident for an applicant who is a Singapore Permanent Resident(iii) Can be of any nationality for an applicant who is a non-Singapore Citizen",
    "Can I apply for student loans (eg, TFL, SL, etc) and bursary concurrently? Student loans and scholarship are separate financial assistance schemes. Award of the loans and bursary are based on separate eligibility criterias. You may hence, apply for loans and scholarship concurrently. That said, you will need to act accordingly to ensure that you do not breach the terms and conditions of your scholarship.",
    "Do I need to re-apply for the Tuition Fee Loan (TFL) and Study Loan (SL) if I switch my course of study? Application for financing under the TFL/SL schemes applications is one-time only, regardless of change in course plan. If you are approved of your application, you do not need to submit a new application even though you may be pursuing a different course in your subsequent year of study. The financing will continue with amount adjusted accordingly (where applicable) until you complete your course of study (including summer term) unless you inform Student Loans Team (studentloans@smu.edu.sg) that you have alternative financing and do not require the loan disbursements.",
    "Can I still apply for student loans if I have already applied for CPF Education Loan (CPF Loan)? Student loans and CPF Loan are separate financial assistance schemes. . You may hence, apply for both loans concurrently. However, the CPF Loan will take precedence in terms of disbursement priority (as stipulated by MOE).",
    "What is the difference between Tuition Grant (TG) and Tuition Fee Loan (TFL)? Tuition Grant (TG) is a grant from the Singapore Government to help students manage the costs of full-time tertiary education in Singapore. It is applicable to eligible Singapore Citizens (SC), Singapore Permanent Residents (SPR) and International Students (IS) enrolled in full-time diploma or undergraduate courses at the autonomous universities, polytechnics and art institutions. For more information and application, please go to Tuition Grant Subsidy scheme located on theMinistry of Education (MOE)website or call the MOE Tuition Grant Section Hotline at 65-6872 2220.Tuition Fee Loan (TFL) is a loan to help students who require financial assistance to pay the tuition fee. It will help students finance up to 90% of the tuition fee payable by a Singaporean student. The TFL is interest-free during the course of study and repayable after graduation. For more information and application, please go toTuition Fee Loanlocated on theFinancial Assistance Schemeswebsite.",
    "Can my parents who are either unemployed/retired or a homemaker still be the guarantor of my student loans? It is not a requirement that your guarantor has to be in employment. Guarantors must however, meet the eligibility criteria as set out in the application instructions. For more information on the eligibility criteria for guarantors, please go to theFinancial Assistance Schemes website",
    "Does my guarantor need to be provide income statement for my student loans application? It is not a requirement that your guarantor has to be in employment. Hence, is not necessary to produce any income statement unless you are applying for a student loan that requires household income assessment (ie, PCI assessment). For more information on the eligibility criteria for guarantors, please go toFinancial Assistance Schemes website",
    "Can my father, who is handicapped, be the guarantor of my student loans? As there is concern that they may be misled into signing legally binding documents and to safeguard their interest, the visually impaired are not allowed to be guarantors of the student loans. Hence, the visually impaired person whom you are proposing to be guarantor will not be able to act as your guarantor even though he may have met the other eligibility criteria of a guarantor.If your proposed guarantor is hearing impaired and is able to read English, he may act as your guarantor as he would be able to understand and be aware of his obligations and responsibilities under the loans. He would however, not be able to act as your guarantor if he does not meet the eligibility criteria of a guarantor.",
    "What can I do if my guarantor does not meet one of the eligibility criteria and I am unable to find an alternative guarantor? If your guarantor does not meet one of the eligibility criteria due to (a) age exceeding the maximum age allowed or (b) nationality because you are the only family member who is a Singapore Citizen or Singapore Permanent Resident, you would need to demonstrate that you have attempted all efforts but were unable to find a suitable alternative guarantor.You may write in to Student Loans Team (studentloans@smu.edu.sg) to assist you put forth an appeal on your behalf, to the relevant authority to grant on a case-by-case basis, exceptional approval to you to allow the proposed to be your guarantor.",
    "Can I request to back-date the application for my Tuition Fee Loan (TFL) and Study Loan (SL) to finance my outstanding tuition fees from prior terms? Financing under the TFL/SL schemes is effective from the approved term and may not be back-dated to prior terms.If you have outstanding tuition fees from prior terms that have not been paid, you will need to find alternative source of financing to settle them.",
    "Who is eligible for the Tuition Fee Loan? All Singapore Citizens, SPRs, foreigners pursuing MOE-subsidised UG programmes at SMU except the following:Students on Government/ Statutory Board/ any scholarshipStudents receiving full subsidy from MendakiStudents using 100% CPFStudents on self-funded coursesFull-fee paying foreign students",
    "Can the person who witness my guarantor’s signing of the Tuition Grant (TG) agreement also witness his signing of the loan agreements? The TG agreement may be signed in the presence of a/an (i) lawyer/solicitor, (ii) Notary Public or its equivalent or (iii) official from the Singapore Embassy/Consulate Office. However, the signing of the loan agreements may only be witnessed by a/an (a) Notary Public or its equivalent or (b) official from the Singapore Embassy/Consulate Office.As such, if your guarantor approaches a lawyer/solicitor to witness the signing of the loan agreements, your guarantor would need to ensure that the lawyer/solicitor is a Notary Public or its equivalent. Documentary evidence to support the Notary Public or its equivalent status is necessary.",
    "Am I eligible to apply for student loans to finance my tuition fee if I am an International Student? International Students who are paying non-subsidised tuition fee are not eligible to apply for student loans. You may apply for student loan financing if you are paying subsidised tuition fee and you have completed the requirements as set out in the Tuition Grant (TG) process.If you have been awarded the student loan financing prior to the completion of the TG process, you would need to ensure that you complete the requirements set out in the TG process as the award of the student loan financing is contingent upon completion of the TG process.",
    "Where can I find the student loans application form? The student loan application form can be found in your student portalOASIS > Self-Service Apps – Financial Aid Application(under “Policies and Self-Service Apps”)or> Finance & Admin > Fee Matters & Financial Assistance Schemes > Schemes & Obligations > Apply for Finance Aid(located at the end of the page)Financial Aid Type: LoanFinancial Aid Form: Select as appropriate – (a) Tuition Fee Loan and Study Loan; (b) SMU Education Loan and/or (c) SMU Student Computer Loan",
    "How to check on the loan application status? Please log on to your student portalOASIS > Self-Service Apps – Financial Aid Applicationto check > Finance & Admin > Fee Matters & Financial Assistance Schemes > Schemes & Obligations > Financial Aid Application History.",
    "Am I still eligible to apply for the student loan financing if I have previously taken out loans to finance my education in the polytechnic? You would be eligible to apply for student loans provided you are paying subsidised tuition fee (ie, if you are not an International Student paying non-subsidised tuition fee) at the point of application.",
    "I am a second year student. Can I still apply for student loans to finance my tuition fees even though I did not apply for it previously? If you are a full-fee paying (ie, have fully utilised the MOE Tuition Grant (TG) and no longer paying subsidised tuition fees) SC or SPR, you may still apply for student loans to finance the tuition fees payable even though you previously have not applied for the loan(s) when you were paying subsidised tuition fees.",
    "When is the student loans application dates for current term? Student Loans Application PeriodFinancing TypeFinancial Aid SchemeApplication PeriodFor tuition feesTuition Fee Loan (up to 90% of a Singaporean student’s annual subsidised tuition fee)Study Loan (up to remaining 20% of a Singaporean student’s annual subsidised tuition fee)SMU Education LoanTuition Fee Loan & Study LoanApril to August (Term 1)November to December (Term 2)March (Term 3)SMU Education LoanApril to August (Term 1)November to December (Term 2)*All applications must be submitted in the application periods stated above.For living expensesStudy Loan (up to $3,600.00 annual living allowance)Study LoanApril to August (Term 1)November to December (Term 2)March (Term 3)For purchasing a computer/ notebook from one of SMU-appointed IT vendorsSMU Student Computer LoanApplications are accepted all year roundFor financial assistance to Singaporean undergraduate students in OSPs approved by the UniversitySMU Overseas Student Programme (OSP) LoanApplications are accepted all year round*Note: For SMU Overseas Student Programme (OSP) Loan applicants, please submit your applications at least2 months priorto departure",
    "If I am approved of the SMU Student Computer Loan, when will I receive the money? The approved loan amount will not be paid to you. The University will settle your invoice with the notebook vendor on your behalf, subject to the maximum quantum approved under the loan scheme.You will be given a Letter of Approval (LOA) indicating the approved loan quantum on the day you and your guarantor sign the loan agreement with SMU. This LOA is to be handed over to the notebook vendor (with both parties duly acknowledging the release and receipting of the notebook computer) when you collect the notebook computer from the selected notebook vendor.In the event your invoice value is higher than the approved loan quantum, it is your responsibility to settle the excess with the notebook vendor.",
    "What is the maximum loan quantum I can obtain under the Tuition Fee Loan (TFL) and Study Loan (SL) financing? The TFL finances up to 90% of the subsidised tuition fee payable by a Singaporean student. Subject to meeting the eligibility criteria, you may apply for SL to finance the remaining 10% of the subsidised tuition fee payable by a Singaporean student and if applicable, an annual living allowance (LA) of $3,600 (maximum).For further information and application, please go to theFinancial Assistance Schemes website",
    "When will I receive the Living Allowance (LA)? Office of Finance will disburse the LA starting Week 7 of Term 1 and Term 2. However, if you apply for the LA only during the application window prior to the start of the term, you will only receive the LA after you and your guarantor have signed the loan agreement and you have been awarded the loan scheme.",
    "I am on scholarship and my terms of scholarship does not allow other financial aid. Why are loans still being disbursed to my account? With effect from 1 Aug 2017 (ie, AY2017/18 Term 1), students who did not apply the scholarship via SMU and who are not scholars of Singapore Government Ministries, Organs of State or Statutory Boards, would need to need to liaise directly with their sponsors on the settlement of their tuition fees. To avoid being on finance hold due to delay in the settlement of your outstanding fees, you are advised to either (a) make payment then seek subsequent reimbursement from your sponsor or (b) submit the invoice to your sponsor immediately upon receipt of the billing notification for your sponsor to make payment directly to SMU.As we would not be aware of your scholarship, the loans will be disbursed accordingly if there are outstanding tuition fees in your account. It is hence, your responsibility to ensure that you do not breach the terms and conditions of your scholarship and write in to (studentloans@smu.edu.sg) to inform Student Loans Team that you need to cease the TFL/SL financing should your scholarship disallow other financing.Should you fail to inform Student Loans Team to cease the TFL/SL financing, Student Loans Team will continue to extend the loans to you as long as your tuition fees are outstanding when the loan disbursement takes place.",
    "I am on scholarship but I noticed that loans are still being disbursed to my account. Why? With effect from 1 Aug 2017 (ie, AY2017/18 Term 1), students who did not apply the scholarship via SMU would need to liaise directly with their sponsors on the settlement of their tuition fees.Under the new arrangement, students may submit the Statement of Account to their private sponsors directly on the payment arrangement of their tuition fees. Alternatively, students may also make payment first and print out the receipt to seek subsequent reimbursement from their sponsors.If your tuition fees are outstanding when the loan disbursement takes place, the loans will be disbursed to your account even though you are on scholarship. Thus, you would need to write in to Student Loans Team (studentloans@smu.edu.sg) to request Office of Finance to cease the loan financing and arrange for your tuition fees to be settled promptly to avoid finance hold on your account.This above arrangement however, does not apply if students are scholars of Singapore Government Ministries, Organs of State or Statutory Boards. That said, you would need to ensure that your sponsor informed us of your scholar status so that we can make the necessary arrangements with them.",
    "I applied for the SMU Overseas Student Programme (OSP) Loan Scheme. When can I expect to receive the funds? The funds will be disbursed to the (receiving) bank account between 4 and 6 weeks prior to your departure date.Students who submit application for loan financing within 1 month of date of departure may not be able to receive the funds before departure as the loan agreements must be signed and loan duly awarded before the funds may be disbursed to your bank account that you maintained in OASIS",
    "Why is the TFL still not disbursed to my account even though I have already accepted the Tuition Fee Loan (TFL) application’s Letter of Offer (LOO)? The TFL will only be disbursed to your Student Account after you and your guarantor have signed the loan agreement and the loan application status showed “Awarded”. Hence, if you have already accepted the offer but not fixed anappointmentwith Student Loans Team to sign the loan agreement, kindly write in to Student Loans Team (studentloans@smu.edu.sg) to make the necessary arrangements at the earliest possible.",
    "I have applied for Tuition Fee Loan (TFL) and Study Loan (SL). When will I receive the money in my bank account? For financing of tuition fee under the Tuition Fee Loan (TFL) and Study Loan (SL) Schemes, you will not receive any money in your bank account. The quantum which may vary from term to term depending on whether there are other financial aids that ranked in higher priority (based on the order stipulated by MOE) will be disbursed directly to your Student Account to offset against your outstanding tuition fees (if any).If you have applied for Living Allowance (LA) under the SL Scheme, the annual LA will be disbursed over 2 terms to the (receiving) bank account that you maintained in OASIS, after offsetting against the outstanding tuition fees and annual fees (if any).",
    "I have applied for Tuition Fee Loan (TFL) and Study Loan (SL). Will I receive the full quantum upfront? For financing of tuition fee under the Tuition Fee Loan (TFL) and Study Loan (SL) Schemes, the full quantum will not be disbursed upfront as the total financing required for your course of study cannot be ascertained at this point. The disbursement will be done on a per term basis and the quantum may vary from term to term, depending on whether there are other financial aids that ranked in higher priority (based on the order stipulated by MOE). The loan will be disbursed directly to your Student Account to offset against your outstanding tuition fees.If you have applied for Living Allowance (LA) under the SL Scheme, the annual LA will be disbursed over 2 terms to the (receiving) bank account that you maintained in OASIS, after offsetting against the outstanding tuition fees and annual fees (if any).",
    "I have applied for the maximum Living Allowance (LA) of $3,600 under the Study Loan (SL) Scheme. Why am I receiving a lower amount? The Living Allowance (LA) is disbursed over 2 terms annually. If you have outstanding tuition fees and/or annual fees, the LA will be used to offset the outstanding fees before the net amount is disbursed to you.",
    "What is the interest rate on the student loans? Except for the interest-free Study Loan Tier 1, the interest rate payable on the rest of the student loans is pegged to the prevailing average prime lending rates of the 3 local banks in Singapore.",
    "I have previously applied for GIRO to repay my school tuition fees. Do I have to apply for GIRO again to repay my loans? GIRO arrangement made with OCBC Bank during UG days CANNOT be used for repayment of the loans due to different receiving bank account. Establishing a new GIRO authorisation arrangement is required.The application for payment by Interbank GIRO is secured and convenient. Students just need to follow the simple step-by-step guide below:GIRO Instructions via DBS/POSB iBanking for DBS/POSB bank account holders:1. Select \"Payments\", \"GIRO: Manage GIRO Arrangements\" and “Add GIRO Arrangement”2. Under \"From Account\", choose your preferred account for this payment3. Under \"To Billing Organisation\", select the “SMU”4. Under \"Bill Reference No.\", please key in yourCampus ID as per SMU Student Card (e.g. S1234567X / G0123456X / 01234567)for the Billing Organisation. For the explanatory guide on \"Bill Reference No\", please click \"View More Info\"5. Under \"Payment Limit\", please key in \"0\"6. Click \"Submit\"7. Check your information again before you click \"Confirm\"8. When you get to the next page, please wait for the OTP (one-time password) to be sent to you through SMS. Key the OTP into your token and follow the instructions given on the website9. The GIRO arrangement is completed and ready once the OTP is submitted",
    "What is the penalty and interest if I fully repay my student loans before graduation? The student loans are interest-free during the course of study. Consequently, if youfullyrepay the loans prior to graduation, you are not required to pay any interest as the loans are still interest-free. If however, you do not fully repay the loan before graduation, you would need to pay interest on any outstanding balance not repaid when interest starts after graduation.There is no penalty or administrative charge for fully repaying the loans before graduation or before the maximum repayment period.",
    "Do I need to repay the Living Allowance (LA)? The Living Allowance (LA) is a form of financial assistance extended to needy students to help them pay for their daily expenses. The LA is part of the Study Loan (SL) Scheme and thus, a loan that is also repayable after graduation.",
    "I took up student loans during my undergraduate days. How do I make loan repayment? Repayment of loans starts after your graduation and according to the Terms and conditions per your signed loan agreements. You will be notified upon graduation on your loan repayment commencement. You will need to fill up areply slipto submit your payment instructions to Office of Finance.",
    "When is the interest chargeable for on the Tuition Fee Loan (TFL) and Study Loan (SL)? The student loans are interest-free during the course of study. The interest chargeable on the loans will commence after graduation.Depending on the term in which a student graduates, interest will be chargeable with effect from the following dates:Term 1 – 1st MarchTerm 2 – 1st AugTerm 3 – 1st Oct",
    "I want to repay my student loans. What are the available mode of payment? You may repay your student loans by the following various payment methods:1. INTERBANK GIROGIRO arrangement made with OCBC Bank during UG days CANNOT be used for repayment of the loans due to different receiving bank account. Establishing a new GIRO authorisation arrangement is required.The application for payment by Interbank GIRO is secured and convenient. Students just need to follow the simple step-by-step guide below:GIRO Instructions via DBS/POSB iBanking for DBS/POSB bank account holders:1. Select \"Payments\", \"GIRO: Manage GIRO Arrangements\" and “Add GIRO Arrangement”2. Under \"From Account\", choose your preferred account for this payment3. Under \"To Billing Organisation\", select the “SMU”4. Under \"Bill Reference No.\", please key in yourCampus ID as per SMU Student Card (e.g. S1234567X / G0123456X / 01234567)for the Billing Organisation. For the explanatory guide on \"Bill Reference No\", please click \"View More Info\"5. Under \"Payment Limit\", please key in \"0\"6. Click \"Submit\"7. Check your information again before you click \"Confirm\"8. When you get to the next page, please wait for the OTP (one-time password) to be sent to you through SMS. Key the OTP into your token and follow the instructions given on the website9. The GIRO arrangement is completed and ready once the OTP is submitted2. BANK TRANSFEREmail tostudentloans@smu.edu.sgto request for bank transfer details. Indicate your campus ID & loan account no.Once payment is completed, please provide a screenshot of your bank transfer.3. CASH / CHEQUE / CASHIER'S ORDERNo cash / cheque / cashier's order will be accepted. We encourage students to repay via GIRO / Bank Transfer.",
    "I took up student loans during my undergraduate days. When can I start repaying the loan? Repayment of loans starts after your graduation and in accordance with the terms and conditions of your signed loan agreements. Please refer to your copy of the loan agreements for the terms and conditions of the loans. If you require any further clarification, please write in to Student Loans Team (studentloans@smu.edu.sg).Upon graduation, you will be notified on your loan repayment commencement. However, you may start repayment during your course of study if you have the financial capability to do so.Should you wish to start repaying the loan during your undergraduate days, and unless you are confident of keeping up with the monthly instalments (due on 1st of each month), we would suggest that you consider doing lump sum payment (minimum sum - $1,000 each) so that you do not incur penalty interest if you fail to pay the monthly instalment on time.",
    "Can I repay the student loans before I graduate? You may start the repayment of your student loans before you graduate.If however, you are not repaying the loans in full during your course of study, it is preferable that the repayment be in the form of lump sum/partial payment as the repayment instalment plan cannot be paused once the plan commenced. Penalty interest at 1% per month will be charged on overdue instalments.",
    "Can I use CPF to repay my student loans? CPF savings can only be used to pay tuition fees. You may utilise your own PSEA funds and/or repay your student loan by GIRO/Bank Transfer.",
    "Can I repay my student loan in cash? Physical cash is not accepted for loan repayment. Loan repayment may only be made via these payment methods: GIRO/Bank Transfer.",
    "How do I change my GIRO bank account? Please re-authorise your GIRO arrangements by referring to the GIRO Instructions stated below.GIRO Instructions via DBS/POSB iBanking for DBS/POSB bank holders:1. Select \"Payments\", \"GIRO: Manage GIRO Arrangements\" and “Add GIRO Arrangement”2. Under \"From Account\", choose your preferred account for this payment3. Under \"To Billing Organisation\", select the “SMU”4. Under \"Bill Reference No.\", please key in yourCampus ID as per SMU Student Card (e.g. S1234567X / G0123456X / 01234567)for the Billing Organisation. For the explanatory guide on \"Bill Reference No\", please click \"View More Info\"5. Under \"Payment Limit\", please key in \"0\"6. Click \"Submit\"7. Check your information again before you click \"Confirm\"8. When you get to the next page, please wait for the OTP (one-time password) to be sent to you through SMS. Key the OTP into your token and follow the instructions given on the website9. After submitting the OTP, the GIRO arrangement is then completedIf you are a non-DBS/POSB bank holder, please submit theoriginal signedcopy of the GIRO Application form to SMU. Please continue to arrange for payment for the loan until the GIRO application is approved. If the GIRO application is approved, you will receive a GIRO reminder e-mail from Student Loans Team.",
    "Can I issue a cheque to repay my student loan? Cheques are not accepted. We encourage students to repay via GIRO / Bank Transfer.",
    "I am residing overseas and have closed my Singapore bank accounts but would like to repay my loans. What are the payment options available for me? For those who are residing overseas, our only available payment mode for loan repayment is via Bank Transfer. Please contact Student Loans Team atstudentloans@smu.edu.sgto request for bank transfer details (Indicate your campus ID & loan account no.).",
    "Can I repay my student loans by bank transfer? Yes. Please write in to Student Loans Team atstudentloans@smu.edu.sgto request for bank transfer details (Indicate your campus ID & loan account no.).",
    "Can I use Post-Secondary Education Account (PSEA) funds to repay my student loans? You may apply to use the funds in your PSEA account to repay your loan if you are no longer studying at SMU (ie, graduated or withdrawn). For more information and application, please go to Post-Secondary Education scheme located at theMOE PSEAwebsite.That said, you may withdraw the PSEA funds during your course of study to pay the tuition fees if you are still an undergraduate so that you do not have to incur a bigger loan at the end of your study at SMU.",
    "Can I repay my student loans by debit/credit card/paynow/paylah? Our mode of payment is via GIRO / Bank Transfer. We currently do not have Paynow / Paylah function and credit cards are not accepted for loan repayment.",
    "Will I receive a statement of account for my loan? Yes, the consolidated statement of account will be emailed to you mid-month. Please note that the statements are pertaining on theprevious month’s end balanceand the $100.00 is just a default indication of the minimum required monthly instalment if students do not submit the repayment plan, based on the terms and conditions of the loan agreement.",
    "What are the most pertinent things that I will need to settle upon arrival in Singapore? Complete the Disembarkation/ Embarkation card, which you will receive while on the plane. Copies are also available at the Immigration Checkpoint at the Singapore Changi Airport. You must present this with your passport and the original copy of your Student's Pass approval letter (application for those who require a visa to enter Singapore) to the Duty Officer at the Immigration Checkpoint upon your arrival in Singapore. Please retain the portion of the Disembarkation/ Embarkation card and your Student's Pass approval letter which will be returned to you, as these are required for the completion of your Student's Pass formalities at the Immigration Checkpoints Authority.Complete your medical examination. Remember to make a photocopy of your medical examination report for the ID verification exercise at SMU.Complete your Student's Pass formalities at the Immigration Checkpoints Authority (ICA) – please see Question on “How do I go about applying for my Student Pass?”Required documents:- IPA Letter- Passport- Disembarkation/ Embarkation card- Form 16- Medical report from approved hospitals/clinics in SingaporeOpen a bank account.Finalise your Tuition Fee Loan application (if pending).Attend SMU Matriculation.Verify your original academic documents at:Office of Undergraduates AdmissionsSMU Administration Building, Level 3For enquiries, you may contact us at:Tel: (65) 6828 0980Email:admissions@smu.edu.sg",
    "Are there any medical tests that I have to undergo? All students are required to undergo a compulsory medical examination with The Clinic Group (TCG) in Singapore prior to starting their studies at SMU. Please visit the matriculation website for more details.",
    "What are some of the useful numbers that I will have should have on hand? Office of Global Learning (OGL) Emergency Hotline(+65) 9112 8896OGL Emergency Emailhotline@smu.edu.sg-->SMU NumbersOffice of Global Learning6828 0400-->General Office6828 0100IT Helpdesk6828 0123Dato' Kho Hui Meng Career Centre6828 0177Office of Dean of StudentsEmail:deanofstudents@smu.edu.sgMrs Wong Kwok Leong Student Wellness Centre6828 0786Email:counselling@smu.edu.sgCentre for Student Financial Assistance6828 0264Email:finasst@smu.edu.sgCentre for Social Responsibility6828 0676Office of Facilities Management6828 0340Office of Finance6808 5470 (Student Loans)Office of Registrar6828 0531Office of Student Life6828 0321International Student Experience6808 5429Office of Undergraduate Admissions6828 0980Li Ka Shing Library6828 0355Emergency NumbersAmbulance and Fire Brigade995Non-Emergency Ambulance1777Police999Police Hotline1800 255 0000General NumbersLocal Directory Assistance100Immigration Enquiry Service6391 6100Flight Information1800 542 4422Taxi Booking NumbersCityCab6552 1111Comfort Taxis6552 1111SMRT Taxis6555 8888TransCab6555 3333Premier Taxis6363 6888Prime Taxis6778 0808Yellow-Top Taxis6293 5545",
    "What do I have to note with regards visa-related matters? SMU will arrange for a visa to be issued should you require one to enter Singapore. The student's pass in-principal approval (IPA) letter that you will receive will include a single-entry visa. Please ensure that you have received the IPA letter before you leave for Singapore.",
    "How much should I budget for each month for my living expenses? Singapore has one of the highest living standards in the South East Asia.An international student in Singapore spends, on average, about S$750 to S$2,000 a month on living expenses. This amount will, of course, vary depending on your lifestyle and course of study.Clickherefor information on the estimated living expenses in Singapore.",
    "What are the essential items/issues that I will need to note or arrange prior to my departure? To facilitate a smooth administrative process in Singapore, please ensure that you have these items ready prior to your departure for Singapore:A valid passport for international travel with a validity of at least six months.A photocopy of the bio-data page of the passportStudent pass In-Principal-Approval (IPA) LetterForm 16 – to be presented when collecting your student pass from ICA.Pre-enrolment medical report.SMU's Letter of Offer (printed copies from email are also acceptable)All original academic transcripts and educational documents. International full-time undergraduates must bring along their original high school results and/or transcripts, SAT I report etc. for verification at the Office of Undergraduate Admissions at SMU upon arrival into Singapore. Official translations of documents are required if they are not in English.Other forms of personal identification, such as an identity card and birth certificateSix passport-sized photographs done in your home country (size: 35mm x 43mm)Letter or email confirming your accommodation plans in Singapore.",
    "How do I go about applying for my student pass? In accordance with the Immigration Act, any foreigner who is not a Singapore Permanent Resident and wishes to study at SMU is required to apply for a student's pass.SMU will advise you by email on the student's pass application procedures. After receiving the email, please log on to the SOLAR system on the Immigration & Checkpoints Authority (ICA) website, with your assigned SOLAR application number and your personal particulars. Once you have logged on to the system, you may proceed to complete the student's pass application form (Form 16) and submit the application online to ICA for processing.Please ensure that you read through the FAQs before you proceed to apply online. The FAQs are available at the ICA website.We will keep in touch with you via email throughout the student's pass application process until you arrive safely in Singapore. Hence, please ensure that you check and clear your mailbox regularly.Completion of Formality (COF)All international students are also required to make an e-appointment with ICA for the Completion of Formality (COF). Once you have confirmed your travel dates, please log on to SOLAR or the ICA website to arrange an e-appointment date as there are limited slots. Please note that:• For undergraduates, you must book a date before the ID verification period as you will need to submit your student's pass for verification• For postgraduates, you must book a date before your respective graduate offices' stipulated student card collection date• You are only allowed to cancel your appointment online once",
    "What do I have to look out for in renting a private accommodation? If you prefer to rent a private apartment, you can engage the services of property agents to help you with such arrangements. Please note that you would need to pay an agent fee if you engage their services. These are some of the things to look out for:RentThis includes the rental amount of the unit, rental deposit, security deposit, administrative charges, agent fees for service rendered, etc.LocationCheck whether the apartment or hostel is conveniently located and if public transport, grocery stores, food outlets or banks are easily accessible.Period of leaseThe lease of a unit is normally for a year. Landlords of private apartments usually ask for up to three months' rent as deposit. However, short term lease is available but usually at a higher rental.OthersThe cost of accommodation depends on several factors such as the locality, type of premises, size, furnishings provided, recreational facilities available, period of lease. Housing in Singapore is generally expensive, especially within the city.Please note that the contract or tenancy agreement is solely between the student and hostel management or owner. Beware of scams:Make sure you visit the room or apartment for rent, and ensure that you thoroughly understand the contract or tenancy agreement before you make any commitmentsNever make any payment before thatIf in doubt, consult your peers, senior students and friends",
    "I will need to find local accommodation. Is there one that SMU provides or recommends? Students may apply to stay at SMU’sPrinsep Street Residences (PSR), which is sought out for its diverse social, cultural, and academic programming, and its location at the heart of Singapore!",
    "I am concerned about medical insurance coverage. Where can I get myself insured adequately for the duration of my studies? Specialist consultation, hospitalisation or surgery can be a financial burden for students. All SMU Undergraduates are covered under a Group Personal Accident Policy, and a Medical and Group Hospitalisation & Surgical Policy. Insurance premiums are payable annually. It ismandatoryfor all International Exchange Students to participate in this insurance scheme. The insurance fee is inclusive of other miscellaneous fees. Students will be instructed on the payment arrangements they are formally accepted to study at SMU.",
    "Where would the nearest medical consultation clinic be in the campus vicinity should I require medical advice/treatment? Medical facilities in Singapore are of a high standard and are readily available. A visit to a General Practitioner (GP) usually costs around S$30. However, SMU students will only need to pay S$5 for each doctor’s visit at The Clinic @ Campus located at Basement 1 of SMU.Singapore's public hospitals accept patients without a doctor or specialist's referral. Vaccinations are required only if you come from a yellow-fever area. You do not need to worry about malaria here as Singapore is not within the malaria zone",
    "Will I be required to go through any form of pre-enrolment medical examination? Yes, all SMU students are required to undergo a compulsory medical examination with The Clinic Group (TCG) in Singapore prior to commencing studies at SMU. You can check the matriculation website for the list of TCG clinics. It is strongly advised to check with the clinic beforehand as certain clinics with high crowd volume may take a few days to process the medical report.",
    "How do I get to SMU? SMU is located at the heart of the Central Business District and is very accessible via public transportation.Address:Singapore Management UniversityAdministration Building,81 Victoria Street,Singapore 188065By MRT – alight at Bras Basah Station (Circle Line)By Bus – 7, 14, 16, 36, 111, 131, 162, 167, 171, 502, 518, 700, 700ABy Taxi - Taxi service in Singapore is easily available, convenient, and reasonably priced. If this is your first time in Singapore, you are strongly advised to take a taxi to your hostel from Changi Airport. Taxi bays are available at the Changi Airport arrival halls. Taxis are metered and fares start from S$3.20. A list of possible additional surcharges can be found posted in the taxis. For trips originating from the airport, there is a surcharge of between S$3 to S$5. Between midnight and 6 a.m., there is an additional surcharge of 50% of the fare shown on the meter. Tipping is not expected. Most taxi drivers are conversant in both English and Mandarin. If you are dissatisfied with the taxi service for whatever reasons, please note down the taxi number and time of boarding so that you can provide feedback to the respective Taxi Companies.",
    "Where can I find more information on SAT/ACT/IELTS/TOEFL/C1 Advanced? Please click on the following links for more informationSATACTIELTSTOEFLC1 AdvancedRegistration for SAT/ACT/IELTS/TOEFL/C1 Advanced is a separate process from application for admission to SMU. Click the above links for information on test dates and registration. You must submit a separate application for admission by 19 March 2022. Clickhereto find out how to apply for admission to SMU.",
    "Can I combine SAT/ACT/IELTS/TOEFL/C1 Advanced scores from more than one sitting? Combination of scores from different sittings will not be allowed.",
    "When must I submit SAT/ACT/IELTS/TOEFL/C1 Advanced scores to be considered? To be considered in the 2023 admissions exercise, applicants must take the SAT/ ACT/ IELTS/ TOEFL/C1 Advanced by 19 March 2023 and submit the test scores to SMU by 31 March 2023. Tests taken after 19 March 2023 will not be considered. You are strongly encouraged to take the test early.",
    "How long are SAT/ACT/IELTS/TOEFL/C1 Advanced scores valid for? SAT/ ACT scores are valid for 5 years. For the 2023 admissions exercise, scores from tests taken before 19 March 2018 will not be considered.IELTS/ TOEFL/ C1 Advanced/ PTE Academic scores are valid for 2 years. For the 2023 admissions exercise, scores from tests taken before 19 March 2021 will not be considered.",
    "Can I submit GMAT / GRE? GMAT and GRE are test scores required of applicants who are applying for admission into postgraduate programmes. For the purpose of admission into undergraduate programmes, we will only consider SAT/ACT/IELTS/TOEFL/C1 Advanced.",
    "Is SAT/ACT/IELTS/TOEFL/C1 Advanced compulsory for applicants with international qualifications? Applicants with international qualifications, including UK A-Levels must submit either SAT or ACT or IELTS or TOEFL or C1 Advanced for consideration. For details of the minimum requirements, please clickhere.SAT/ACT/IELTS/TOEFL/C1 Advanced is not compulsory for IB Diploma applicants.",
    "Is SAT/ACT/IELTS/TOEFL/C1 Advanced compulsory for applicants with the local qualifications? SAT/ACT/IELTS/TOEFL/C1 Advanced isnotcompulsory for applicants with the following entry qualifications:-     Singapore-Cambridge GCE A-Levels-     Acceptable Polytechnic Diplomas from Nanyang Poly, Ngee Ann Poly, Republic Poly, Singapore Poly and Temasek Poly-     IB Diploma-     NUS High School Diploma-     Acceptable Diplomas from NAFA / LASALLE / NIE",
    "Are SAT Subject Tests required for admission? SAT Subject Tests are not required. SAT Subject Tests do not replace your high school academic grades.",
    "How much would it cost a student to go on an international student exchange programme? A student going on an exchange programme to a partner university remains enrolled full-time at SMU while away on the exchange programme. Therefore, for each term that the student is away, the amount of tuition and student fees are as per what the student would pay for a regular SMU term.While the student is not required to pay tuition fees to the overseas partner University, the student is responsible for the air tickets cost, living expenses, accommodation costs, additional travel arrangements and health insurance etc. Based on feedback from students who recently went on such trips, the estimated cost differs according to the region that the student travels to:RegionEstimated costSoutheast AsiaS$3,000 to S$5,000Rest of AsiaS$5,000 to S$8,000OceaniaS$8,000 to S$12,000EuropeS$8,000 to S$12,000South AmericaS$8,000 to S$12,000North AmericaS$10,000 to S$16,000There are numerous forms offinancial aidavailable to students to offset the cost of going on exchange programmes.",
    "Are students allowed to use their own overseas arrangements, rather than official SMU programmes, to fulfil this global exposure requirement? About 90% of our graduates in the Class of 2019 chose to take up an activity from the myriad of overseas exposure programmes offered by the University. SMU is continuing to ramp up and enhance these opportunities following the implementation of the global exposure graduation requirement from Academic Year 2018-2019 onwards. With these added opportunities, the University expects more students to take up these formal programmes to fulfil the global exposure requirement.",
    "How long do these different forms of overseas stints last? ActivityAverage durationInternational Exchange1 term (15 weeks)Summer Exchange Programme4 weeksCommunity Service3 weeksStudy Mission10 to 14 daysCo-Curricular Activities11 daysInternship10 weeksGlobal Innovation Immersion10 weeks",
    "How may students fulfil this global exposure requirement? Students may fulfil the global exposure requirement by participating in any of the following SMU-organised overseas activities:Global Exposure ActivityQualifying durationInternational Exchange ProgrammeAs per programme requirementSummer Exchange ProgrammeAs per programme requirementShort-Term Study ProgrammeAs per programme requirementCommunity Service5 working days or longerStudy Mission5 working days or longerCo-Curricular Activities5 working days or longerInternship5 working days or longerGlobal Innovation Immersion Programme5 working days or longerSMU-X Overseas5 working days or longerCultural Immersion Programme5 working days or longer",
    "Why is SMU making it a requirement for all undergraduates to acquire overseas experience during their period of study at the University? Global traction and understanding underpins success in careers in today’s globally connected environment.  To have global exposure from the vantage of a university education is invaluable for international networking and global vision; it also open doors to bigger opportunities.When students approach their global exposure opportunities with an enthusiastic and open mind, the benefits are immense.  Academically, gaining a first-hand, real-world perspective of issues learnt in the classroom serves to deepen students’ learning and knowledge application.  More importantly, the journey builds independence, empathy, open-mindedness, not to mention soft-skills like communication and teamwork.  These attributes not only build character and personal development, but also give students an edge when they are seeking employment and advancement in the competitive workplace.We believe that our consistently strongGraduate Employment Surveyresults can be attributed to SMU’s holistic approach towards education (which includes making 80-hours of community service and 10-week of internship graduation requirements), and particularly to the international exposure that the majority of SMU graduates receive.  To make sure no student misses out on this precious global experience, the University is committed to giving global exposure participation an extra push by enhancing support and by providing more (and new) opportunities for students.",
    "How many SMU undergraduates experience global exposure? At SMU, we aspire to have 100% of our students embark on at least one global experience before graduating. Many students go on to have more than one global experience, whether through an overseas exchange programme, international internship, overseas community service programme, study mission, summer school, and so on. In fact, SMU is so serious about global exposure that we have made acquiring overseas experience a graduation requirement for our students!",
    "What options do I have if I am unable to travel due to medical conditions or family constraints? We are aware of students who have difficulties travelling because of exceptional circumstances. We strongly encourage students to discuss and seek advice with our university counsellors and faculty advisors should they have any concerns. SMU is committed to our students’ welfare and success, and we will work with students facing exceptional and challenging situations to explore holistic alternatives and consider exceptions where necessary",
    "What types of financial assistance are available to students with demonstrated needs to help them afford the costs of embarking on global exposure trips? SMU has a range of University-funded and donor-supportedfinancial assistance schemesthat needy students can tap on for their overseas activities and programmes. The value of these financial assistance schemes ranges from S$500 to S$10,000.  Some of these grants/subsidies are listed below.  Singaporean SMU students may also tap on theSMU Overseas Student Programme Loan, which has no income criterion.SMU is committed to provide necessary assistance and financial support in situations where a student faces difficulties completing the global exposure requirement due to financial issues.* Some of the grants/subsidies available (non-exhaustive) include:SMU Overseas Student Educational Programme SubsidyArnoud De Meyer Business Study MissionCommunity Service Projects GrantDBS Sustainability Business Study MissionDoris and Mick Aw Accounting Study GrantEddie & Lindy Chang Overseas Study Mission GrantsHanh Nguyen Overseas Study Mission GrantJoanne Chan Memorial Fund Social Science Study Mission GrantKwai Fong & Raymond Goh SMU-XO GrantLaw Study Mission Financial GrantRuth Chiang Overseas Community Service GrantSchool of Accountancy Education Enhancement FundSchool of Accountancy International Experience FundSMU ASEAN Exposure GrantThe SMU Ambassadorial Corps Study Mission GrantSMU Partial Conference FundingTan Tiong Hwee Memorial Fund GrantWilmar Overseas Community Service Project GrantWilmar Overseas Internship Grant",
    "How much would it cost a student to embark on other forms of global exposure – e.g. overseas community service and study missions? Students who participate in many forms of global exposure, such as overseas internships and overseas community service, may apply forgrants/subsidiesto cover the cost of the travel. Most students who go on overseas internships or overseas community service are awarded grants which would cover the expenses involved with the global exposure activity.For study missions, the cost varies depending on the destination region. The estimated cost, by region, is as follows:RegionEstimated costSoutheast AsiaS$500 to S$1,500Rest of AsiaUp to S$2,000Europe / North AmericaS$3,000 to $4,000",
    "I am an NSMen and I have a reserved place in SMU. How do I submit an appeal to change programme before commencement of my academic year? Please kindly email (admissions@smu.edu.sg) to express your interest to appeal with the following details :(i)                Your full name(ii)                Application No.(iii)               Programme you intend to change to(iv)               Reasons for change of programme (a write-up is preferred; 1000-word limit)We will inform you on the outcome of your appeal. Please check the status of your appeal online via Applicant’s Self Service. If your appeal for course change is not successful, you will still keep your place in the degree programme that you have previously accepted.",
    "I am still waiting for my appeal outcome. However, I am asked to matriculate now. What should I do? If you have received our email on matriculation, you may wish to matriculate for the programme which you had already accepted. If your appeal is successful, we will make the necessary amendments on our system and your student records to reflect the latest status.",
    "I missed this year's application deadline. Can I still apply? You will not be able to apply once the online application portal is closed. If you missed the application deadline, you will have to apply in the following year. All prospective students are strongly advised to take note of the SMU application opening and closing dates. Having not applied to other universities is not a valid ground for appeal. All applicants are advised to apply to more than one university.",
    "I was not offered a place in any of the degree programmes that I have chosen. Can I appeal for a programme that I had not opted previously? You may appeal for a programme that you had not opted previously.",
    "I have not been successful in my application for admission. Can I appeal to be reconsidered? I have been offered my second choice of degree programme. Can I appeal to be considered for my first choice? If your application has not been successful or you have not been offered your first choice of programme or you have been offered admission to a single degree but would like to appeal for a double degree programme, you may submit an appeal for reconsideration. Appeals must be submitted online viaApplicant’s Self Service. You must have your User ID and Password to access Applicant's Self-Service.For the 2023 admissions exercise, the online appeal portal will open from 2 May - 31 July 2023.Only applicants whose outcome of their applications is known (successful or reject) can submit their appeals online.In your online appeal, you may state your reasons for reconsideration (not more than 1000 words). All online appeals must be submitted by 31 July 2023. We would advise applicants who wish to appeal to do so early, preferably within one week following notification of the outcome of the application. The Office of Undergraduate Admissions & Financial Assistance (OUAFA) is the central co-ordinating body for all appeals. As such, please refrain from sending your appeals to multiple parties within SMU as this will only slow down the appeal process. Appeals sent to the other offices will be re-directed to OUAFA for processing.All appeals will be processed in a timely and equitable manner. As the number of appeals received will be large, we will aim to inform most applicants of the outcome of their appeals within 21 working days. Some appeals, though, may take a longer time to process and notifications of outcome for such appeals will be sent beyond the 21 working days timeline. You may check the outcome of your appeal online viaApplicant's Self Service.Notifications will be sent by email, so please ensure that you have provided us with a valid email address for reply and that you check your email inbox on a regular basis. If you would like to update your email address, please do so atApplicant's Self Service.If you have been offered admission to a degree programme and would like to appeal for a change of programme, you should accept the programme offered first while waiting for the outcome of your appeal. The offer will lapse if you do not accept it within the stipulated deadline.",
    "Will there be exemptions for SMU accounting modules if I have the ACCA/CAT qualifications? You will not be eligible for exemptions from ACCA/CAT qualifications.",
    "If I am granted some exemptions, can I choose not to be exempted from these modules? You can choose not to be exempted from the modules. This is a privilege given to you and the final decision lies with you. Please seek advice from your school first before making the final decision.",
    "Do I get exemptions for the relevant subjects that I have taken in the Junior Colleges / Polytechnics / High Schools / University? Singapore-Cambridge GCEA-Levels, IB Diploma, NUS High School Diploma and international qualifications- Up to 5 subject exemptionsAcceptable Diplomas from Nanyang Poly, Ngee Ann Poly, Singapore Poly, Republic Poly and Temasek Poly- For cGPA 3.8 and above: Up to 10 subject exemptions.- For cGPA 3.7 to 3.79: Up to 4 subject exemptions.- For cGPA 3.65 to 3.69: Up to 3 subject exemptions.- For cGPA 3.60 to 3.649: Up to 2 subject exemptions.The above are indicative guidelines and are subject to change from time to time. The number of exemptions will depend on specific course(s) taken and results obtained for these courses. Exemptions will be assessed by the Dean's Office after the applicant receives an offer of admission into SMU and accepts the offer.",
    "What is the difference between a double degree and a second major? A double degree programme (DDP) allows students to take courses and graduate with two different degrees. They receive two separate degree certificates. In a DDP, some courses can be double-counted towards the requirements of both degrees, allowing students to complete both programmes in a shorter time than it would take if both are completed separately.In a second major or double major, students take courses to meet the requirements of two majors (the first major and the second major) in a single degree programme. Upon graduation, the name of the majors will be indicated in the result transcripts. They will not be shown in the degree certificate.Clickherefor more information about double degrees and second majors. For a listing of the second majors, please clickhere.",
    "Can I withdraw from the double degree programme and continue with a single degree programme? Double degree students may withdraw from their secondary degree. However, before withdrawing from the double degree programme, you should seek advice from your school on how to fulfill the remaining academic requirements of your primary degree.",
    "What is the duration of a double degree programme? The expected duration is 4 years for non-Law double degree students. Law students who are enrolled in a double degree programme will complete the programme in 5 years.",
    "I was not offered direct entry into the double degree programme. Does this mean I will not have the opportunity to do a double degree? Freshmen who are not offered direct admission into the double degree programme (DDP) may enrol in the single degree programme and will be eligible to apply for the DDP by the end of Year 2 if they meet the double degree requirements, which are a minimum cumulative GPA of 3.4 and certain minimum grades in stipulated programme-specific courses. Enrolment into the DDP is also subject to availability of places, and the ability to complete the DDP successfully within the normal candidature period of four years, so as to enjoy the subsidised tuition fees.Freshmen who are offered direct admission into the DDP are deemed to be provisionally enrolled in the secondary degree. Provisionally enrolled students will be required to fulfill the above-mentioned double degree requirements for confirmation, failing which they will be asked to withdraw from the double degree programme and pursue a single degree. As such, direct entry into the DDP does not guarantee that you will be confirmed and graduate as a double degree student.",
    "What are the minimum requirements for a double degree programme? Places in the double degree programme (DDP) which are merit-based are limited. As such, keen competition is expected. To be eligible for direct entry into the DDP, applicants must have good academic results.Students aspiring to do a double degree at the School of Law must be offered admission into the Law programme. Admission into the double degree programme will be decided by the School of Law.No additional interview is required for those who apply for a place in the DDP for non-law programmes. However, for those who wish to be considered for the DDP with Bachelor of Social Science - Politics, Law and Economics (PLE) major as the secondary degree programme, an interview to assess suitability will be conducted by the School of Social Sciences for shortlisted candidates.",
    "I would like to change my first choice to Law in my online application. How should I go about doing this? For the 2023 admissions exercise, you must email SMU of your request atadmissions.smu.edu.sgby 23 March 2023.",
    "What if I am shortlisted and unable to attend the interview and writing test? All shortlisted Law applicants must attend the interview and writing tests. Your application will not be considered if you fail to attend the interview and writing test.",
    "When will the interviews and writing tests be conducted? For the 2023 admissions exercise, the interviews and writing tests will be conducted in end-March to April 2023. Shortlisted Law applicants should not be making any plans that will result in them not being able to attend the interviews and writing tests during this period. The Yong Pung How School of Law reserves the right to make changes to the interview and writing test dates.The writing test will be between one hour and one hour 15 minutes long.  Candidates will be presented with one or more passages and asked to provide written responses to several questions. The test will allow candidates to demonstrate their communication skills and their reasoning ability. Candidates will be called upon to demonstrate their skills in understanding, synthesising, and critically thinking about newly acquired information, as well as in forming and communicating their personal views in response. The writing test may discuss legal issues, but will not require that candidates have any prior knowledge of the law, philosophy, or any other discipline. Candidates need not do anything in particular to prepare for the writing test. The Yong Pung How School of Law reserves the right to modify the writing test format and test duration from time to time",
    "Will all Law applicants get to be interviewed? No. Only shortlisted applicants will be interviewed.",
    "Must I put law as my first choice if I wish to be considered? To be considered, you must indicate Law as your first choice in your application for admission to SMU.",
    "Will there be any interviews for PLE applicants? Shortlisted PLE applicants will be interviewed by a joint panel comprising faculty members from the School of Social Sciences, School of Economics and School of Law.",
    "How do I apply for the PLE major? For prospective students, please clickhereto apply. There is no separate application for the PLE major.",
    "Are there any additional requirements to be considered for the PLE major? Prospective students are expected to demonstrate a strong command of the English Language and possess strong grades in Mathematics.English Language RequirementsThe English Language requirements are as follows:•    GCE A-Levels (H1/H2 Level curriculum): Minimum of A or B in General Paper (GP) or Knowledge & Inquiry (KI)•    GCE A-Levels (A-Level/AO-Level curriculum): Minimum of B3 grade or better in GP•    Polytechnic Diploma: Minimum of A1 or A2 in O-Level English Language•    IB Diploma: Grade 6 or 7 in English A1 at Higher Level or Standard Level or Grade 6 or 7 in English A - Literature or English - Language and Literature at Higher or Standard Level•    NUS High School Diploma: English Language Subject CAP of B+ or better and B+ or better in EL5102 English for Academic Purposes or EL5101 Language in Society II and EL6103 Language in Society III•    International Qualifications: Either one of the following:◦            SAT (old SAT - before March 2016) : A minimum total score of 1,900 with a combined score of 1,400 for critical reading and writing◦            SAT (new SAT - from March 2016) : A minimum total score of 1,350 with at least 700 each for evidence-based reading and writing. Essay is not required.◦            ACT : A minimum composite score 29 and a writing score of at least 32◦            IELTS : A minimum overall score of 7.5 with at least 7.0 each for both reading and writing◦            TOEFL iBT (internet-based test) : A minimum score of 100, with at least 24 each for both reading and writing◦            TOEFL PBT (paper-based test) : A minimum score of 600, with at least 5.5 for TWE (Test of Written English) and 50 for readingNote: The minimum scores indicated above for law applicants will be minimally sufficient for applicants to make a competitive application. Meeting these requirements does not guarantee an admission into SMU, as admission is on a highly competitive and selective basis.Mathematics RequirementsA significant number of courses in the PLE major are of a highly quantitative nature. As such, applicants are expected to meet additional requirements in the form of a good pass in Mathematics at H2 Level/A-Level/H1 Level/Additional Mathematics at O-Level. Applicants who do not meet this requirement can still apply for consideration if they have an alternative Mathematics content background. The PLE selection committee makes the final decision on admission.",
    "Where do I find out more about the PLE major, including the curriculum? Please clickherefor more information.",
    "How are students selected for the PLE major? SMU adopts a holistic approach to selection. Applicants will be evaluated on their academic credentials and co-curricular activity records. Interviews will be conducted for shortlisted applicants.",
    "I am currently serving my Singapore National Service and have a place reserved in SMU. I am interested in pursuing the PLE major. Do I have to submit a new application for admission? There is no need for you to re-apply. For Academic Year 2023-24, please email to express your interest atadmissions@smu.edu.sgby 19 March 2023 (Now extended to 22 March 2023, 11.59pm, Singapore Standard Time).",
    "How many students are enrolled in the PLE major each year? The PLE major enrols 45 students in each year.",
    "Can a PLE student transfer out of PLE to another major offered by School of Social Sciences, e.g. Psychology? Yes, it is possible. Applications for transfer are subject to approval, and must be submitted to the school before the end of the second year.",
    "Can I become a lawyer with the Bachelor of Social Science BSocSc (PLE major) degree? The BSocSc (PLE major) does not enable a graduate to be called to the Singapore Bar. However, BSocSc (PLE major) graduates may choose to apply to the SMU Juris Doctor (JD) programme. If they are so admitted and are graduates of the BSocSc (PLE major), they will be eligible for certain exemptions when completing the JD programme. PLE students who are admitted to the J.D. programme within three years of obtaining their bachelor degree may be exempted for up to 5 course units from the 25 course units of the J.D. degree, if they have completed 5 Law courses at SMU in the undergraduate degree. LGST courses and other universities’ courses taken on exchange do not qualify for exemption. The grade point obtained for the Law courses exempted will be computed into the J.D. GPA. If, in addition to the 5 exempted Law courses, a student has completed other SMU courses listed in the J.D. list of Law core courses, s/he does not have to take those courses again, but will have to replace them with J.D. Law electives, in order to bring the total course units completed in the J.D. degree to 20 course units. Graduates of the SMU JD programme (if they fulfill the minimum GPA of 3.0) can qualify for legal practice in Singapore after completing the practical requirements of training and the exam for the Singapore bar. Further information on the JD programme can be found at:http://www.smu.edu.sg/programmes/postgraduate/jd.",
    "Can Social Science (PLE major) be taken as a secondary degree in the double degree programme? At the end of Year 2, non-Social Science students can apply to be considered for the double degree programme with Social Science (PLE major) as a secondary degree. This option is not available to Social Science students.",
    "What degree will I get upon graduation? You will graduate with a Bachelor of Social Science degree. The PLE major will be indicated in the official result transcript.",
    "Can current SMU students take PLE as a first major? No. This option is not available to current SMU students.",
    "What are the career opportunities for graduates with a PLE major? Due to the interdisciplinary nature of the programme, graduates would be well-equipped with the knowledge and skills to handle multifaceted jobs in their chosen fields of public service, non-government organisations or industry. Possible jobs include careers in journalism, diplomatic service, foreign affairs, public service, consulting and research, amongst others.",
    "Can PLE be offered as a second major? At the moment, there are no plans for PLE to be offered as a second major. Prospective students who wish to pursue the PLE which is offered as a first major must apply for it at the time of application into SMU.",
    "What type of student are we looking to enroll in the PLE major? We are looking for students who possess the following attributes:•    Strong academic records;•    The ability to think strategically and reason well;•    The ability to frame a problem and develop a solution in new ways by drawing from multiple disciplines;•    The ability to express ideas clearly and effectively;•    The ability to gather and utilise relevant knowledge;•    Personal characteristics such as curiosity, open-mindedness and persistence.",
    "Can Social Science (PLE major) students enroll in the double degree programme? Yes, PLE major students are eligible to apply for consideration into the double degree programme with their secondary degree either in Accountancy, Business Management, Economics or Information Systems. If you aspire to do a double degree programme at the School of Law, you must first be offered admission into the School of Law. Selection for a place in the double degree programme at the School of Law is highly competitive as a very small number of places are available each year.",
    "What is the PLE major? What are its distinctive features? The first of its kind in Singapore, the PLE major will be offered by SMU School of Social Sciences for the pioneer intake in Academic Year 2016-17. The programme provides a unique and rigorous, interdisciplinary major between Politics, Law and Economics. PLE majors will get to focus on a specific area of complex problems they are interested in under one of four themes. Each theme offers electives from a set of carefully curated multidisciplinary and interdisciplinary courses relevant to real world problems. It aims to prepare future leaders and thinkers with a deep understanding of global political and economic transformations and the legal frameworks and contexts within which such changes take place. As a student of this major, you will hone strategic and analytical thinking skills and seek innovative solutions to real world problems.",
    "Can PLE major students take a second major? Yes, like all SMU students, PLE students may take up a second major offered by SOSS or by another school by the end of the second year.",
    "Must I declare my interest in PLE major before commencement of Year 1? Yes, you must declare your interest in PLE major at the time of application for admission into SMU. You will be asked to indicate your interest in the online application for admission.",
    "I would like to know why we are required to pay for matriculation? The one-time confirmation fees are for pre-course activities and the actual matriculation process. For the matriculation process, the costs are allocated for registration, information technology services, library services, sports-related activities, student activities, insurance, as well as academic-related services.",
    "Who should I contact in SMU when I start my academic term and am feeling unwell? SMU students are covered under a medical insurance scheme. When you collect your SMU student card, you will also be issued a medical e-card which you can use to visit a doctor. If you are unwell, you can visit the doctors on SMU’s Panel Clinic list (https://www.mycg.com.sg/smu#smu-e-card-panel).",
    "Will there be someone from SMU to greet me at the airport upon arrival? If you have concerns about your arrival at the airport, please email our staff from the Diversity, Inclusion and Integration (DII) team atdii@smu.edu.sg.",
    "Are there any useful contacts which I could reach out to in case that I require assistance from the University upon my arrival in Singapore? There is a comprehensive list of contact emails on the matriculation websitehttps://matriculation.smu.edu.sg/contact.Please feel free to contact any of our SMU colleagues from the list.",
    "What is the current situation with my student pass application? Will my student pass application be approved soon? Before you can complete the online matriculation process (Part 1), in accordance with the Immigration Act, any foreigner who is not a Singapore Permanent Resident, and wishes to study at SMU, is required to apply for a Student’s Pass. Your student pass application will be processed by the Singapore Immigration & Checkpoints Authority (ICA).  The Office of Admissions and Financial Assistance will send you an email on the Student’s Pass application procedures. Kindly email admissions@smu.edu.sg for enquiries on student’s pass matters.Singapore has implemented a COVID-19 Vaccinated Travel Framework to facilitate the resumption of travel. All incoming International Students (including Singapore citizens and permanent residents) who are currently overseas should refer to the Safe Travel Office (STO) website for information on Traveller entry checklists under Vaccinated Travel Framework and Accepted COVID-19 Vaccinations for Entry to Singapore. Students may need to obtain additional documentation if needed.",
    "Are parents allowed to travel with their children to Singapore? Please refer toTravelling to Singapore - Overview (ica.gov.sg)for more information on travelling to Singapore.",
    "What should I do if my country (or province/state) is still in lockdown mode, and I cannot travel to Singapore? If you are in such a situation, please contact us at admissions@smu.edu.sg so that we can see how we can best help you.",
    "What are the safety measures undertaken by the University to ensure my child’s well-being in light of Covid-19? The safety and well-being of SMU students, faculty and staff is the University’s top priority. SMU’s premises have achieved the SG Clean quality mark certification. Take a look at some of what we are doing to keep you safe on campus: these include mandatory mask-wearing in indoor spaces on campus, enhanced daily cleaning of common areas, deployment of 'handsfree' water coolers, amongst other measures.",
    "Do I need to obtain additional insurance for Covid-19? SMU provides basic medical insurance for students, and you can review the benefits under our SMU medical insurance policies and determine whether you have a need to increase and augment the current benefits. If you determine that this is required, then you can go ahead to purchase additional medical insurance.  For any further questions, please contact our SMU medical insurer through email:smu@mycg.com.sg",
    "Will my SMU medical insurance cover the treatment for Covid-19, if I contract Covid-19? Any SMU student, upon suspicion of having Covid-19, when already in Singapore, can go to our panel of clinics under our SMU medical insurance scheme and consult the doctor with respect to the symptoms that he/she is experiencing. Should the doctor determine that the student needs to undergo a Covid-19 swab test, this could be done at the clinic (if approved for testing) or referred to an approved testing centre.If your Covid-19 test results are positive, our SMU medical insurance provider would treat the Covid-19 infection like it would any other illness suffered that requires hospitalization treatment at government re-structured hospitals under our insurance benefits (seehttps://www.smu.edu.sg/sites/default/files/smu/factsheet_GHS_20190701.pdf)",
    "Do I need to produce any medical documents to prove that I am Covid-19 negative before coming to Singapore? Singapore has implemented a COVID-19 Vaccinated Travel Framework to facilitate the resumption of travel. All incoming International Students (including Singapore citizens and permanent residents) who are currently overseas should refer to the Safe Travel Office (STO) website for information on Traveller entry checklists under Vaccinated Travel Framework and Accepted COVID-19 Vaccinations for Entry to Singapore. Students may need to obtain additional documentation if needed.",
    "What happens if my child is unable to secure a place in PSR? PSR can accommodate up to 255 students in a typical year. If you apply to PSR but are not able to secure a space, we will try our best to let you know as soon as possible so that you have sufficient time to explore other suitable accommodation options.",
    "Would the student hostel fees be charged only for the period the hostel is occupied by the student? Hostel fees will be charged for the duration that the students had committed for their stay, which may be by semester or for the whole academic year.",
    "When can I apply for on-campus housing? There are several campus housing options you can consider, including SMU’s Prinsep Street Residences (PSR). The application portal is now open for campus housing. You are encouraged to apply as soon as you can.",
    "Are examinations conducted online or in-person? Examinations will be conducted in-person, on campus. Nonetheless, instructors will try their best to accommodate students who have to be absent because they contracted COVID-19 or have COVID-19 symptoms by providing alternative options, on a case-by-case basis.",
    "Are classes conducted face-to-face, on campus? Classes will be taught in-person, on campus. Nonetheless, instructors will try their best to continue accommodating students who have to be absent from classes because they contracted COVID-19 or have COVID-19 symptoms by livestreaming classes, providing consultation sessions, extending the assistance of TAs, or providing other similar accommodations."
  ],
  "sources": [
    "https://admissions.smu.edu.sg/faqs/general",
    "https://admissions.smu.edu.sg/faqs/general",
    "https://admissions.smu.edu.sg/faqs/general",
    "https://admissions.smu.edu.sg/faqs/general",
    "https://admissions.smu.edu.sg/faqs/general",
    "https://admissions.smu.edu.sg/faqs/general",
    "https://admissions.smu.edu.sg/faqs/general",
    "https://admissions.smu.edu.sg/faqs/general",
    "https://admissions.smu.edu.sg/faqs/general",
    "https://admissions.smu.edu.sg/faqs/general",
    "https://admissions.smu.edu.sg/faqs/general",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/admissions-and-applications",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/tuition-fees-and-financial-aid",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/for-international-students",
    "https://admissions.smu.edu.sg/faqs/sat-act-ielts-toefl-c1-advanced",
    "https://admissions.smu.edu.sg/faqs/sat-act-ielts-toefl-c1-advanced",
    "https://admissions.smu.edu.sg/faqs/sat-act-ielts-toefl-c1-advanced",
    "https://admissions.smu.edu.sg/faqs/sat-act-ielts-toefl-c1-advanced",
    "https://admissions.smu.edu.sg/faqs/sat-act-ielts-toefl-c1-advanced",
    "https://admissions.smu.edu.sg/faqs/sat-act-ielts-toefl-c1-advanced",
    "https://admissions.smu.edu.sg/faqs/sat-act-ielts-toefl-c1-advanced",
    "https://admissions.smu.edu.sg/faqs/sat-act-ielts-toefl-c1-advanced",
    "https://admissions.smu.edu.sg/faqs/global-exposure",
    "https://admissions.smu.edu.sg/faqs/global-exposure",
    "https://admissions.smu.edu.sg/faqs/global-exposure",
    "https://admissions.smu.edu.sg/faqs/global-exposure",
    "https://admissions.smu.edu.sg/faqs/global-exposure",
    "https://admissions.smu.edu.sg/faqs/global-exposure",
    "https://admissions.smu.edu.sg/faqs/global-exposure",
    "https://admissions.smu.edu.sg/faqs/global-exposure",
    "https://admissions.smu.edu.sg/faqs/global-exposure",
    "https://admissions.smu.edu.sg/faqs/appeal",
    "https://admissions.smu.edu.sg/faqs/appeal",
    "https://admissions.smu.edu.sg/faqs/appeal",
    "https://admissions.smu.edu.sg/faqs/appeal",
    "https://admissions.smu.edu.sg/faqs/appeal",
    "https://admissions.smu.edu.sg/faqs/exemptions",
    "https://admissions.smu.edu.sg/faqs/exemptions",
    "https://admissions.smu.edu.sg/faqs/exemptions",
    "https://admissions.smu.edu.sg/faqs/double-degree",
    "https://admissions.smu.edu.sg/faqs/double-degree",
    "https://admissions.smu.edu.sg/faqs/double-degree",
    "https://admissions.smu.edu.sg/faqs/double-degree",
    "https://admissions.smu.edu.sg/faqs/double-degree",
    "https://admissions.smu.edu.sg/faqs/law-interviews-and-writing-tests",
    "https://admissions.smu.edu.sg/faqs/law-interviews-and-writing-tests",
    "https://admissions.smu.edu.sg/faqs/law-interviews-and-writing-tests",
    "https://admissions.smu.edu.sg/faqs/law-interviews-and-writing-tests",
    "https://admissions.smu.edu.sg/faqs/law-interviews-and-writing-tests",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/bachelor-of-social-science-%E2%80%94-politics,-law-and-economics-(ple)-major",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students",
    "https://admissions.smu.edu.sg/faqs/for-incoming-international-students"
  ]
}
