{
  "documents": [
    "What is sexual harassment?Sexual harassment is when an individual uses threats or abusive/ insulting words or behaviours of a sexual nature that is likely to cause distress or alarm to a person. These incidents are usually marked by power imbalance, coercion or predatory behaviour.",
    "What is sexual assault?Sexual assault is when an individual is forced or threatened into sexual contact against his or her free will or without his or her consent. It can include acts such as rape and molest, and even incidents such as sex trafficking, forced abortion and dating violence. Sexual assault is usually seen as a more extreme form of sexual harassment.",
    "What is sexually unwelcome behaviour?Any unsolicited, sexually suggestive act or comment can be considered as unwelcome. These include subtle or overt pressure for sexual activity, unnecessary touching, stalking, sexually suggestive displays, demands for sexual favors, promises of gifts in exchange for sex, lurid telephone calls, obscene messages and e-mails, or being followed or watched.",
    "What is consent?Consent is unmistakable, clear and given by willing participants. It cannot be given under situations of coercion, fear or pressure, or if an individual is intoxicated or unconscious. Consent should not be assumed or inferred, and it is the responsibility of participants to actively seek and obtain consent at every level and occasion of physical intimacy.",
    "How do I know if I have given consent or if my partner has given consent?If you are unsure whether your partner has given consent, you may wish to follow the following guidelines.You shouldstopif your partner is intoxicated, asleep or passed out, has said “no”, has not said “yes”, kept silent or is unresponsive, or is under the age of consentYou shouldpause and talkif you are not sure what your partner wants, you feel like you are receiving mixed signals, you have not talked about what you want to do or if you assume that it is ok to proceed because consent was given previouslyYou mayproceed (but keep communicating)if both of you clearly express comfort with the situation, reached a mutual decision about how far to go, or feel comfortable and safe stopping at any time",
    "What can I do to help as a member of the SMU community?If you witness sexual harassment or misconduct, be an active bystander by adopting the 4Ds ofdirectlyintervening in the situation,distractingthe perpetrator,delegatinghelp to someone anddelayintervening if unsuitable at the time and check in with the victim after.You should inform the school of the incident and let the victim know that they may approach Voices@SMU if they require support, or to approach the police if they want to report the incident.",
    "Where can I seek help if I have experienced sexual harassment?If you wish to seek advice, emotional support or lodge an official report with theschool, you may approach Voices@SMU through the official emailvoices@smu.edu.sgor request to meet with someone from the team at the Student Services Hub. If you feel that you are in immediate danger on campus, please call the campus security hotline (24 hours) at 6828 0343.If you wish to make an official report with thelegal authorities, please call the police at their emergency hotline 999",
    "Can I report anonymously?There are plans to develop an anonymous reporting channel online. Until then, you may wish to pick up a reporting form (for either yourself or a friend) at the Student Services Hub or on the Voices@SMU website and fill it in. You are not required to include identifying information if you do not wish to do so when submitting it.However, do note that this would limit the University’s ability to take action.",
    "If I think I have experienced sexual harassment, what should I do?If you are unsure whether your experience constitutes as sexual harassment, you should speak to a trusted individual or adult about it. You may also approach the staff at Voices@SMU who will be able to advise you further. Generally, any discomforting act or comment that was committed or uttered without your consent can be interpreted as sexual harassment.",
    "What should I immediately do if I was sexually assaulted?Try and get yourself to a physically safe space. Remember that what happened was not your fault and consider seeking help from trusted individuals or the authorities. If you are on the campus, you can contact campus security at 6828 0343, Voices@SMU at voices@smu.edu.sg or any other staff who can help support and guide you through what to do next. You may also report the incident to the police by dialing 999.",
    "I am uncomfortable with the staff’s conduct towards me. What should I do?If you feel confident to, tell them that the sexually suggestive, offensive or inappropriate comments or acts he or she makes are uncomfortable for you. If you do not feel able to do so, do reach out to Voices@SMU for support and discuss your options in addressing this misbehaviour or harassment.",
    "Will Voices@SMU keep my personal information and identity confidential?All personal information will be kept confidential as per the Personal Data and Protection Act (PDPA). If there is a need to involve other support services, relevant information may be shared. However, these agencies/ departments will also be bound by the PDPA. This will help safeguard your personal information from being leaked to the public. Please be assured that information is only released on a purely need-to-know basis and with your consent.",
    "Can I get help even if I am not sure whether to report, or do not want to report the case?Yes. Filing a report is a personal decision and we understand that it might not be something you wish to do. You can still approach Voices@SMU for support without filing a report. SMU believes in the right for all students to feel safe and respected while on campus.",
    "Can I approach Voices@SMU if I experienced sexual harassment off-campus?Yes. Support is extended to all current students at SMU regardless of the location of the incident. Please reach out to Voices@SMU if you wish to speak to someone at the school.",
    "Can I approach Voices@SMU if I experienced sexual harassment before enrolling into SMU?Yes. Support is extended to all CURRENT students at SMU regardless of the time period of the incident. Please reach out to Voices@SMU if you wish to speak to someone at the school.",
    "I am worried that the person who did this to me might retaliate.If you feel that you are in immediate danger, notify the POLICE by dialling 999. If you are on campus you can call CAMPUS SECURITY at 68280343. If you are not in immediate danger and would like to discuss ways to increase your security on campus, approach Voices@SMU. The team will work with the relevant authorities in school to increase your safety while on campus.",
    "I have not decided if I want to file a report. Who can help me better understand my options?You can approach Voices@SMU to discuss your options in terms of getting support or officially filing a report. Filing a report is a personal decision and disclosing an incident to Voices@SMU does not mean that a report has been made.",
    "How do I file a formal report of sexual harassment?Before filing the report, you may wish to speak with Voices@SMU to better understand your rights and options. You can approach Voices@SMU by either emailingvoices@smu.edu.sgto make an appointment, or filling in and submitting the report form (available at Student Services Hub and on the Voices@SMU website).",
    "Will information in the report be kept confidential?Information in reports are confidential and only shared in situations where an investigation is conducted. In this case, only relevant information is shared with the Student Disciplinary team and the alleged harasser who will need to respond to the allegations.",
    "Will there be an investigation if I choose to file a report?The school will conduct an investigation if the alleged harasser is a staff or student of SMU. The alleged harasser will then be informed of the details of the complaint in order to respond to the allegations. If you do not wish for an investigation to take place, you have the option to disclose the incident to Voices@SMU without filing an official report.",
    "Will the university investigation result in disciplinary action for the accused?The University will determine if the alleged harasser had broken the code of conduct. If so, the disciplinary team will decide on the appropriate disciplinary action for the accused, according to their guidelines.",
    "What are the sexual harassment education and training requirements for students and staff at SMU?Voices@SMU has arranged for first responder trainings for specific students and staff on sexual violence and harassment issues. There are ongoing plans to carry out more trainings to reach out to a larger population in the University.If you are interested in finding out more about the topic, there is also a“Supporting a Harassment-Free Environment”online module available on eLearn that is accessible to all students. There are plans for an equivalent module for staff to be rolled out in the future.",
    "What concepts are covered in SMU’s education and training program?Currently, contents include topics on learning to understand and define sexual harassment and consent, debunking sexual myths, the effects of experiencing sexual harassment, how to be an active bystander or first responder.",
    "Do I have to take the education and training every year?Training and education on this topic is currently not compulsory. However all members of the SMU community are strongly encouraged to sign up for such opportunities when they arise in order to help create a supportive culture with zero tolerance for acts of sexual harassment in the University.",
    "Do students, faculty, and employees take the same education and training course?Although the contents delivered are largely similar, both the eLearn modules and face-to-face trainings will be tailored to the different needs and circumstances of students and staff at SMU.",
    "Where can I go for information and help if I’ve been accused of sexual violence or harassment?If you have been accused of sexual violence or harassment and are unsure of what to do next, you may reach out to Voices@SMU atvoices@smu.edu.sgto meet with the team in order to discuss your options or seek support. You may also choose to access the “Guidebook for Accused Persons” pdf document that is available on the State Court website for more information.",
    "What are my rights as an accused individual?As an accused individual, you will have the right to understand and request for an explanation of the charges filed against you by the police and at the Courts. Thereafter you will be allowed to take a plea i.e. decide whether to admit to or deny having committed the offence. If you do not admit to this, you will be transferred to a Pre-Trial Conference (PTC) where the Judge will decide whether to convict or acquit you on the charges. Sentencing will only take place if the judge decides to convict you or if you had previously decided to plead guilty to the charge.",
    "Should I hire a lawyer if I have been accused of sexual harassment?Whether or not to hire a lawyer is a personal decision. You will be allowed to represent yourself in court if you do not do so. In that situation, you will need to familiarize yourself with the legal procedures and laws and bear full responsibility in preparing for and conducting your own case. These can be managed for you should you choose to hire a lawyer."
  ],
  "sources": [
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs",
    "https://voices.smu.edu.sg/faqs"
  ]
}
